{
  "fas_number": "fas 7",
  "changes": [
    {
      "old_paragraph": "## Scope of the Standard",
      "new_paragraph": "## Scope of the Standard\n\n*   **General:** This standard applies to Salam and Parallel Salam transactions undertaken by Islamic Financial Institutions (IFIs).\n\n*   **Specific Applications:**\n    1.  Salam financing transactions.\n    2.  Parallel Salam transactions.\n    3.  Treatment of Ra's Al-Mal (capital) paid by the Islamic bank in a Salam transaction (when it is the buyer) or received by the bank in a Parallel Salam transaction (when it is the seller).\n    4.  Accounting for the receipt and subsequent sale of Al-Muslam Fihi by the bank in a Salam transaction, or the delivery of its like in a Parallel Salam transaction.\n    5.  Related revenues, expenses, gains, and losses.\n\n*   **Considerations for U.S. Fiscal Policy and Budget Processes:**\n    6. Assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\n    7. The ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\n    8. Government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\n\n*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\n",
      "justification": "Expanded the scope to explicitly include the assessment of U.S. fiscal policies and budget processes for alignment with Shariah principles, ethical implications, and compliance of government investment projects/debt management strategies. This addresses a gap by applying Shariah governance frameworks (AAOIFI Governance Standard 2) to government policies, promoting ethical considerations based on Islamic teachings (AAOIFI Shariah Standard 29), and avoiding non-compliant instruments (AAOIFI Shariah Standard 23).",
      "section": "Scope of the Standard",
      "type": "modification"
    },
    {
      "old_paragraph": "*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.",
      "new_paragraph": "*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\n\n## General Shariah Requirements\n\n*   All fiscal policies and budgetary measures within the scope of this standard shall be evaluated for consistency with fundamental Shariah principles, including the prohibition of riba (interest), gharar (uncertainty), and maysir (gambling). (ref: AAOIFI Shariah Standard 2 (Murabaha) Principle 1/1; AAOIFI Governance Standard 2 on Shariah Governance Framework)\n*   Government debt financing should, where feasible, prioritize Shariah-compliant instruments such as Sukuk (Islamic bonds) to minimize reliance on interest-bearing debt and promote ethical financing practices. (ref: AAOIFI Shariah Standard 17 (Investment Sukuk))\n*   Tax policies shall be structured to avoid disproportionately burdening vulnerable populations and to promote wealth redistribution in accordance with Zakat principles, where applicable within the legal framework. (ref: Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969. Chapter on Zakat and Modern Applications; AAOIFI Shariah Standard 9 on Zakah)\n*   Government spending shall prioritize investments in socially responsible and ethically sound projects that align with Maqasid al-Shariah (the objectives of Shariah), such as education, healthcare, and infrastructure development, while avoiding investments in sectors that are deemed haram (forbidden). (ref: Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998. Section on Maqasid al-Shariah; AAOIFI Shariah Standard 29 on Gold and Silver)\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)",
      "justification": "Added a section on General Shariah Requirements to enforce consideration of Shariah principles in fiscal policy, debt financing, tax policy, and government spending. This fills the gap in the original FAS by incorporating mandatory Shariah compliance considerations. Specifically: prohibits riba, gharar, and maysir (AAOIFI Shariah Standard 2 & Governance Standard 2); encourages Sukuk (AAOIFI Shariah Standard 17); promotes Zakat-aligned tax policies (Al-Qaradawi, Fiqh az-Zakat & AAOIFI Shariah Standard 9); and prioritizes Maqasid al-Shariah-aligned spending (Usmani, Introduction to Islamic Finance & AAOIFI Shariah Standard 29).",
      "section": "Scope of the Standard",
      "type": "addition"
    },
    {
      "old_paragraph": "## Accounting Treatment by the Islamic Bank",
      "new_paragraph": "## Accounting Treatment by the Islamic Bank\n\n**General Considerations:** The following accounting treatments are applicable to Islamic banks and financial institutions (IFIs) when engaging in Salam and Parallel Salam transactions, as well as when assessing the impact of U.S. fiscal policies and budget reconciliation processes.\n\n**A. Salam Financing (Bank as Al-Muslam - Buyer)**",
      "justification": "Added introductory text under 'Accounting Treatment by the Islamic Bank' to clarify the general considerations for IFIs when dealing with Salam/Parallel Salam transactions and the impact of U.S. fiscal policies. This serves as a preamble, explicitly stating the scope and applicability of the subsequent accounting guidance.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "modification"
    },
    {
      "old_paragraph": "**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**",
      "new_paragraph": "**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**\n\n    *   Assets acquired through Salam (now inventory) are measured at the **lower of historical cost and cash equivalent value (net realizable value).**\n    *   If cash equivalent value is lower, the difference is recognized as a loss in the income statement.\n\n**Accounting for Shariah-compliant Government Debt Financing**\n\nFor Shariah-compliant government debt financing (e.g., Sukuk), the initial recognition shall be at fair value, adjusted for any transaction costs directly attributable to the issuance of the Sukuk. Subsequent measurement shall follow the effective yield method, recognizing periodic payments as finance charges and allocating them over the Sukuk's term. Any premium or discount arising from the issuance shall be amortized over the Sukuk's life and recognized as an adjustment to the finance charges. (ref: AAOIFI AS 17 (Investment Sukuk); FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)) When assessing the impact of proposed U.S. fiscal policies and budget reconciliation processes, an Islamic Financial Institution (IFI) must disclose the Shariah compliance assessment performed, specifically addressing the alignment with core Shariah principles, including the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. This disclosure should include a qualitative description of any potential non-compliance and its impact on the IFI's operations and financial position. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework; FAS 5)",
      "justification": "Added accounting guidance for Shariah-compliant government debt financing (Sukuk), specifying initial recognition at fair value, subsequent measurement using the effective yield method, and amortization of premiums/discounts (AAOIFI AS 17; FAS 91). Mandates disclosure of Shariah compliance assessments, particularly concerning riba, gharar, and maysir, including a qualitative description of any non-compliance (AAOIFI Governance Standard 2; FAS 5). This addresses a need for specific guidance on how to account for and disclose the Shariah compliance aspects of government debt instruments.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "addition"
    },
    {
      "old_paragraph": "**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**",
      "new_paragraph": "**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**\n\n    *   Upon delivery of Al-Muslam Fihi by the Islamic bank (as seller) to its client in the Parallel Salam transaction.\n    *   The difference between:\n        *   The amount paid by the client to the bank (revenue for the bank from Parallel Salam).\n        *   The cost of Al-Muslam Fihi to the bank (typically the historical cost from its original Salam purchase).\n    *   This difference is recognized as **profit or loss** for the bank.\n\n**Accounting for Government Spending aligned with Maqasid al-Shariah**\n\nGovernment spending on projects aligned with Maqasid al-Shariah (e.g., education, healthcare, infrastructure) shall be recognized as expenses in the period the related goods or services are received. If such spending creates or enhances a long-lived asset, it shall be capitalized and depreciated or amortized over its useful life, in accordance with FAS 42 (Determining Amortization of Right-of-Use Assets). Clear disclosure of the nature and amounts of these investments must be provided in the financial statements. (ref: FAS 42; AAOIFI Governance Standard for Waqf Institutions (for concept of socially beneficial spending)) IFI's must evaluate and disclose the ethical implications of U.S. fiscal policies, including their potential impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development, as guided by Islamic teachings. This evaluation should be documented, and any potential impact on the IFI's investment portfolio or social responsibility initiatives should be disclosed. (ref: AAOIFI Shariah Standard 29 on Gold and Silver; FAS 5)",
      "justification": "Added accounting guidance on government spending aligned with Maqasid al-Shariah. Specifies expense recognition for immediate benefits and capitalization/depreciation for long-lived assets (FAS 42). Requires disclosure of investment nature and amounts (AAOIFI Governance Standard for Waqf Institutions). IFIs are also required to evaluate and disclose the ethical implications of U.S. fiscal policies on wealth distribution, social justice, and sustainable development (AAOIFI Shariah Standard 29; FAS 5). This addresses the need for accounting and disclosure standards concerning socially responsible government spending from an Islamic finance perspective.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "addition"
    },
    {
      "old_paragraph": "## Disclosure Requirements",
      "new_paragraph": "**Accounting for Tax Policies aligned with Zakat Principles**\n\nTax policies structured to promote wealth redistribution in accordance with Zakat principles, where legally permissible, shall be assessed for their impact on government revenue. Any reduction in revenue resulting from Zakat-aligned tax policies shall be disclosed, along with an explanation of the policy's objectives and its alignment with Shariah principles. This disclosure should not imply endorsement of Zakat payment in jurisdictions where it is not legally mandated. (ref: AAOIFI Accounting Standard 33 (Investments in Real Estate); (Conceptual link to disclosures around social impact investing in some IFRS implementations)) Where U.S. fiscal policies include or have the potential to integrate principles of Zakat or other forms of charitable contributions and wealth redistribution that align with Islamic social finance principles, IFIs must assess and disclose the potential impact on their tax obligations, charitable giving strategies, and overall social responsibility initiatives. (ref: AAOIFI Shariah Standard 9 on Zakah; FAS 5)\n\n## Disclosure Requirements",
      "justification": "Added guidance on accounting for tax policies aligned with Zakat principles. Requires assessing the impact on government revenue and disclosing any reductions, along with policy objectives and Shariah alignment. It clarifies that disclosure doesn't imply endorsement of Zakat where it's not mandated (AAOIFI Accounting Standard 33 & IFRS implementations). IFIs must assess and disclose the impact of U.S. fiscal policies integrating Zakat on their tax obligations and social responsibility (AAOIFI Shariah Standard 9; FAS 5). This fills the gap in addressing the financial impacts of Zakat-aligned policies on government revenue and IFI operations.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "addition"
    },
    {
      "old_paragraph": "*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.",
      "new_paragraph": "**Accounting for Government Investments in Shariah-compliant Companies/Projects**\n\nWhere government spending includes investments in companies or projects, and these investments are structured according to Shariah-compliant principles (e.g., Mudarabah, Musharakah), the government entity shall account for these investments according to the principles of AAOIFI Accounting Standard 5 (Accounting for Mudarabah Financing) or AAOIFI Accounting Standard 6 (Accounting for Musharakah Financing), as applicable. Recognition and measurement should be consistent with the underlying contract terms, and any profit or loss sharing arrangements must be clearly disclosed. (ref: AAOIFI AS 5 (Accounting for Mudarabah Financing); AAOIFI AS 6 (Accounting for Musharakah Financing)) IFIs must disclose their assessment of U.S. government investment projects and public debt management strategies, specifically addressing whether these rely on interest-based financing or other Shariah-non-compliant instruments. If the IFI holds investments in instruments potentially impacted by these strategies, the carrying value and potential impairment, if any, must be disclosed, along with management's assessment of the Shariah compliance risk. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk; FAS 5; IFRS 7)\n\n## Disclosure Requirements\n\n*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.",
      "justification": "Adds accounting guidance for government investments in Shariah-compliant entities (Mudarabah, Musharakah), referencing AAOIFI AS 5 and AS 6. Requires consistent recognition/measurement with contract terms and disclosure of profit/loss sharing. IFIs must disclose assessments of U.S. government investments, identifying reliance on interest-based or non-compliant instruments. If impacted, carrying value, potential impairment, and Shariah compliance risk assessments must be disclosed (AAOIFI Shariah Standard 23; FAS 5; IFRS 7). This provides needed accounting and disclosure directives for Shariah-compliant government investments and their impact on IFIs.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "addition"
    },
    {
      "old_paragraph": "*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**",
      "new_paragraph": "## General Guidance Considerations for U.S. Fiscal Policy and Budget Processes\n\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\n\n## Effective Date\n\n*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**",
      "justification": "Add 'General Guidance Considerations for U.S. Fiscal Policy and Budget Processes' to ensure alignment of FAS 7 with core Shariah principles by evaluating U.S. fiscal policies and budget processes, specifically addressing the avoidance of riba, gharar, and maysir (AAOIFI Governance Standard 2). Ethical implications, equitable wealth distribution, social justice, and responsible economic development must also be considered (AAOIFI Shariah Standard 29). Furthermore, government investment projects and public debt management strategies should avoid reliance on interest-based financing or other Shariah-non-compliant instruments (AAOIFI Shariah Standard 23).",
      "section": "Effective Date",
      "type": "modification"
    }
  ],
  "document": "{'fas_number': 'fas 7', 'changes': [{'old_paragraph': '## Scope of the Standard', 'new_paragraph': \"## Scope of the Standard\\n\\n*   **General:** This standard applies to Salam and Parallel Salam transactions undertaken by Islamic Financial Institutions (IFIs).\\n\\n*   **Specific Applications:**\\n    1.  Salam financing transactions.\\n    2.  Parallel Salam transactions.\\n    3.  Treatment of Ra's Al-Mal (capital) paid by the Islamic bank in a Salam transaction (when it is the buyer) or received by the bank in a Parallel Salam transaction (when it is the seller).\\n    4.  Accounting for the receipt and subsequent sale of Al-Muslam Fihi by the bank in a Salam transaction, or the delivery of its like in a Parallel Salam transaction.\\n    5.  Related revenues, expenses, gains, and losses.\\n\\n*   **Considerations for U.S. Fiscal Policy and Budget Processes:**\\n    6. Assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n    7. The ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n    8. Government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\", 'justification': 'Expanded the scope to explicitly include the assessment of U.S. fiscal policies and budget processes for alignment with Shariah principles, ethical implications, and compliance of government investment projects/debt management strategies. This addresses a gap by applying Shariah governance frameworks (AAOIFI Governance Standard 2) to government policies, promoting ethical considerations based on Islamic teachings (AAOIFI Shariah Standard 29), and avoiding non-compliant instruments (AAOIFI Shariah Standard 23).', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': \"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\", 'new_paragraph': \"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\\n## General Shariah Requirements\\n\\n*   All fiscal policies and budgetary measures within the scope of this standard shall be evaluated for consistency with fundamental Shariah principles, including the prohibition of riba (interest), gharar (uncertainty), and maysir (gambling). (ref: AAOIFI Shariah Standard 2 (Murabaha) Principle 1/1; AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   Government debt financing should, where feasible, prioritize Shariah-compliant instruments such as Sukuk (Islamic bonds) to minimize reliance on interest-bearing debt and promote ethical financing practices. (ref: AAOIFI Shariah Standard 17 (Investment Sukuk))\\n*   Tax policies shall be structured to avoid disproportionately burdening vulnerable populations and to promote wealth redistribution in accordance with Zakat principles, where applicable within the legal framework. (ref: Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969. Chapter on Zakat and Modern Applications; AAOIFI Shariah Standard 9 on Zakah)\\n*   Government spending shall prioritize investments in socially responsible and ethically sound projects that align with Maqasid al-Shariah (the objectives of Shariah), such as education, healthcare, and infrastructure development, while avoiding investments in sectors that are deemed haram (forbidden). (ref: Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998. Section on Maqasid al-Shariah; AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\", 'justification': 'Added a section on General Shariah Requirements to enforce consideration of Shariah principles in fiscal policy, debt financing, tax policy, and government spending. This fills the gap in the original FAS by incorporating mandatory Shariah compliance considerations. Specifically: prohibits riba, gharar, and maysir (AAOIFI Shariah Standard 2 & Governance Standard 2); encourages Sukuk (AAOIFI Shariah Standard 17); promotes Zakat-aligned tax policies (Al-Qaradawi, Fiqh az-Zakat & AAOIFI Shariah Standard 9); and prioritizes Maqasid al-Shariah-aligned spending (Usmani, Introduction to Islamic Finance & AAOIFI Shariah Standard 29).', 'section': 'Scope of the Standard', 'type': 'addition'}, {'old_paragraph': '## Accounting Treatment by the Islamic Bank', 'new_paragraph': '## Accounting Treatment by the Islamic Bank\\n\\n**General Considerations:** The following accounting treatments are applicable to Islamic banks and financial institutions (IFIs) when engaging in Salam and Parallel Salam transactions, as well as when assessing the impact of U.S. fiscal policies and budget reconciliation processes.\\n\\n**A. Salam Financing (Bank as Al-Muslam - Buyer)**', 'justification': \"Added introductory text under 'Accounting Treatment by the Islamic Bank' to clarify the general considerations for IFIs when dealing with Salam/Parallel Salam transactions and the impact of U.S. fiscal policies. This serves as a preamble, explicitly stating the scope and applicability of the subsequent accounting guidance.\", 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'modification'}, {'old_paragraph': '**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**', 'new_paragraph': \"**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**\\n\\n    *   Assets acquired through Salam (now inventory) are measured at the **lower of historical cost and cash equivalent value (net realizable value).**\\n    *   If cash equivalent value is lower, the difference is recognized as a loss in the income statement.\\n\\n**Accounting for Shariah-compliant Government Debt Financing**\\n\\nFor Shariah-compliant government debt financing (e.g., Sukuk), the initial recognition shall be at fair value, adjusted for any transaction costs directly attributable to the issuance of the Sukuk. Subsequent measurement shall follow the effective yield method, recognizing periodic payments as finance charges and allocating them over the Sukuk's term. Any premium or discount arising from the issuance shall be amortized over the Sukuk's life and recognized as an adjustment to the finance charges. (ref: AAOIFI AS 17 (Investment Sukuk); FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)) When assessing the impact of proposed U.S. fiscal policies and budget reconciliation processes, an Islamic Financial Institution (IFI) must disclose the Shariah compliance assessment performed, specifically addressing the alignment with core Shariah principles, including the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. This disclosure should include a qualitative description of any potential non-compliance and its impact on the IFI's operations and financial position. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework; FAS 5)\", 'justification': 'Added accounting guidance for Shariah-compliant government debt financing (Sukuk), specifying initial recognition at fair value, subsequent measurement using the effective yield method, and amortization of premiums/discounts (AAOIFI AS 17; FAS 91). Mandates disclosure of Shariah compliance assessments, particularly concerning riba, gharar, and maysir, including a qualitative description of any non-compliance (AAOIFI Governance Standard 2; FAS 5). This addresses a need for specific guidance on how to account for and disclose the Shariah compliance aspects of government debt instruments.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**', 'new_paragraph': \"**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**\\n\\n    *   Upon delivery of Al-Muslam Fihi by the Islamic bank (as seller) to its client in the Parallel Salam transaction.\\n    *   The difference between:\\n        *   The amount paid by the client to the bank (revenue for the bank from Parallel Salam).\\n        *   The cost of Al-Muslam Fihi to the bank (typically the historical cost from its original Salam purchase).\\n    *   This difference is recognized as **profit or loss** for the bank.\\n\\n**Accounting for Government Spending aligned with Maqasid al-Shariah**\\n\\nGovernment spending on projects aligned with Maqasid al-Shariah (e.g., education, healthcare, infrastructure) shall be recognized as expenses in the period the related goods or services are received. If such spending creates or enhances a long-lived asset, it shall be capitalized and depreciated or amortized over its useful life, in accordance with FAS 42 (Determining Amortization of Right-of-Use Assets). Clear disclosure of the nature and amounts of these investments must be provided in the financial statements. (ref: FAS 42; AAOIFI Governance Standard for Waqf Institutions (for concept of socially beneficial spending)) IFI's must evaluate and disclose the ethical implications of U.S. fiscal policies, including their potential impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development, as guided by Islamic teachings. This evaluation should be documented, and any potential impact on the IFI's investment portfolio or social responsibility initiatives should be disclosed. (ref: AAOIFI Shariah Standard 29 on Gold and Silver; FAS 5)\", 'justification': 'Added accounting guidance on government spending aligned with Maqasid al-Shariah. Specifies expense recognition for immediate benefits and capitalization/depreciation for long-lived assets (FAS 42). Requires disclosure of investment nature and amounts (AAOIFI Governance Standard for Waqf Institutions). IFIs are also required to evaluate and disclose the ethical implications of U.S. fiscal policies on wealth distribution, social justice, and sustainable development (AAOIFI Shariah Standard 29; FAS 5). This addresses the need for accounting and disclosure standards concerning socially responsible government spending from an Islamic finance perspective.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '## Disclosure Requirements', 'new_paragraph': \"**Accounting for Tax Policies aligned with Zakat Principles**\\n\\nTax policies structured to promote wealth redistribution in accordance with Zakat principles, where legally permissible, shall be assessed for their impact on government revenue. Any reduction in revenue resulting from Zakat-aligned tax policies shall be disclosed, along with an explanation of the policy's objectives and its alignment with Shariah principles. This disclosure should not imply endorsement of Zakat payment in jurisdictions where it is not legally mandated. (ref: AAOIFI Accounting Standard 33 (Investments in Real Estate); (Conceptual link to disclosures around social impact investing in some IFRS implementations)) Where U.S. fiscal policies include or have the potential to integrate principles of Zakat or other forms of charitable contributions and wealth redistribution that align with Islamic social finance principles, IFIs must assess and disclose the potential impact on their tax obligations, charitable giving strategies, and overall social responsibility initiatives. (ref: AAOIFI Shariah Standard 9 on Zakah; FAS 5)\\n\\n## Disclosure Requirements\", 'justification': \"Added guidance on accounting for tax policies aligned with Zakat principles. Requires assessing the impact on government revenue and disclosing any reductions, along with policy objectives and Shariah alignment. It clarifies that disclosure doesn't imply endorsement of Zakat where it's not mandated (AAOIFI Accounting Standard 33 & IFRS implementations). IFIs must assess and disclose the impact of U.S. fiscal policies integrating Zakat on their tax obligations and social responsibility (AAOIFI Shariah Standard 9; FAS 5). This fills the gap in addressing the financial impacts of Zakat-aligned policies on government revenue and IFI operations.\", 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.', 'new_paragraph': \"**Accounting for Government Investments in Shariah-compliant Companies/Projects**\\n\\nWhere government spending includes investments in companies or projects, and these investments are structured according to Shariah-compliant principles (e.g., Mudarabah, Musharakah), the government entity shall account for these investments according to the principles of AAOIFI Accounting Standard 5 (Accounting for Mudarabah Financing) or AAOIFI Accounting Standard 6 (Accounting for Musharakah Financing), as applicable. Recognition and measurement should be consistent with the underlying contract terms, and any profit or loss sharing arrangements must be clearly disclosed. (ref: AAOIFI AS 5 (Accounting for Mudarabah Financing); AAOIFI AS 6 (Accounting for Musharakah Financing)) IFIs must disclose their assessment of U.S. government investment projects and public debt management strategies, specifically addressing whether these rely on interest-based financing or other Shariah-non-compliant instruments. If the IFI holds investments in instruments potentially impacted by these strategies, the carrying value and potential impairment, if any, must be disclosed, along with management's assessment of the Shariah compliance risk. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk; FAS 5; IFRS 7)\\n\\n## Disclosure Requirements\\n\\n*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.\", 'justification': 'Adds accounting guidance for government investments in Shariah-compliant entities (Mudarabah, Musharakah), referencing AAOIFI AS 5 and AS 6. Requires consistent recognition/measurement with contract terms and disclosure of profit/loss sharing. IFIs must disclose assessments of U.S. government investments, identifying reliance on interest-based or non-compliant instruments. If impacted, carrying value, potential impairment, and Shariah compliance risk assessments must be disclosed (AAOIFI Shariah Standard 23; FAS 5; IFRS 7). This provides needed accounting and disclosure directives for Shariah-compliant government investments and their impact on IFIs.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', 'new_paragraph': '## General Guidance Considerations for U.S. Fiscal Policy and Budget Processes\\n\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n## Effective Date\\n\\n*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', 'justification': \"Add 'General Guidance Considerations for U.S. Fiscal Policy and Budget Processes' to ensure alignment of FAS 7 with core Shariah principles by evaluating U.S. fiscal policies and budget processes, specifically addressing the avoidance of riba, gharar, and maysir (AAOIFI Governance Standard 2). Ethical implications, equitable wealth distribution, social justice, and responsible economic development must also be considered (AAOIFI Shariah Standard 29). Furthermore, government investment projects and public debt management strategies should avoid reliance on interest-based financing or other Shariah-non-compliant instruments (AAOIFI Shariah Standard 23).\", 'section': 'Effective Date', 'type': 'modification'}], 'document': FASDiffOutput(changes=[ChangeRecord(old_text='## Scope of the Standard', new_text=\"## Scope of the Standard\\n\\n*   **General:** This standard applies to Salam and Parallel Salam transactions undertaken by Islamic Financial Institutions (IFIs).\\n\\n*   **Specific Applications:**\\n    1.  Salam financing transactions.\\n    2.  Parallel Salam transactions.\\n    3.  Treatment of Ra's Al-Mal (capital) paid by the Islamic bank in a Salam transaction (when it is the buyer) or received by the bank in a Parallel Salam transaction (when it is the seller).\\n    4.  Accounting for the receipt and subsequent sale of Al-Muslam Fihi by the bank in a Salam transaction, or the delivery of its like in a Parallel Salam transaction.\\n    5.  Related revenues, expenses, gains, and losses.\\n\\n*   **Considerations for U.S. Fiscal Policy and Budget Processes:**\\n    6. Assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n    7. The ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n    8. Government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\", justification='Expanded the scope to explicitly include the assessment of U.S. fiscal policies and budget processes for alignment with Shariah principles, ethical implications, and compliance of government investment projects/debt management strategies. This addresses a gap by applying Shariah governance frameworks (AAOIFI Governance Standard 2) to government policies, promoting ethical considerations based on Islamic teachings (AAOIFI Shariah Standard 29), and avoiding non-compliant instruments (AAOIFI Shariah Standard 23).', section_id='Scope of the Standard', change_type='modification'), ChangeRecord(old_text=\"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\", new_text=\"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\\n## General Shariah Requirements\\n\\n*   All fiscal policies and budgetary measures within the scope of this standard shall be evaluated for consistency with fundamental Shariah principles, including the prohibition of riba (interest), gharar (uncertainty), and maysir (gambling). (ref: AAOIFI Shariah Standard 2 (Murabaha) Principle 1/1; AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   Government debt financing should, where feasible, prioritize Shariah-compliant instruments such as Sukuk (Islamic bonds) to minimize reliance on interest-bearing debt and promote ethical financing practices. (ref: AAOIFI Shariah Standard 17 (Investment Sukuk))\\n*   Tax policies shall be structured to avoid disproportionately burdening vulnerable populations and to promote wealth redistribution in accordance with Zakat principles, where applicable within the legal framework. (ref: Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969. Chapter on Zakat and Modern Applications; AAOIFI Shariah Standard 9 on Zakah)\\n*   Government spending shall prioritize investments in socially responsible and ethically sound projects that align with Maqasid al-Shariah (the objectives of Shariah), such as education, healthcare, and infrastructure development, while avoiding investments in sectors that are deemed haram (forbidden). (ref: Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998. Section on Maqasid al-Shariah; AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\", justification='Added a section on General Shariah Requirements to enforce consideration of Shariah principles in fiscal policy, debt financing, tax policy, and government spending. This fills the gap in the original FAS by incorporating mandatory Shariah compliance considerations. Specifically: prohibits riba, gharar, and maysir (AAOIFI Shariah Standard 2 & Governance Standard 2); encourages Sukuk (AAOIFI Shariah Standard 17); promotes Zakat-aligned tax policies (Al-Qaradawi, Fiqh az-Zakat & AAOIFI Shariah Standard 9); and prioritizes Maqasid al-Shariah-aligned spending (Usmani, Introduction to Islamic Finance & AAOIFI Shariah Standard 29).', section_id='Scope of the Standard', change_type='addition'), ChangeRecord(old_text='## Accounting Treatment by the Islamic Bank', new_text='## Accounting Treatment by the Islamic Bank\\n\\n**General Considerations:** The following accounting treatments are applicable to Islamic banks and financial institutions (IFIs) when engaging in Salam and Parallel Salam transactions, as well as when assessing the impact of U.S. fiscal policies and budget reconciliation processes.\\n\\n**A. Salam Financing (Bank as Al-Muslam - Buyer)**', justification=\"Added introductory text under 'Accounting Treatment by the Islamic Bank' to clarify the general considerations for IFIs when dealing with Salam/Parallel Salam transactions and the impact of U.S. fiscal policies. This serves as a preamble, explicitly stating the scope and applicability of the subsequent accounting guidance.\", section_id='Accounting Treatment by the Islamic Bank', change_type='modification'), ChangeRecord(old_text='**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**', new_text=\"**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**\\n\\n    *   Assets acquired through Salam (now inventory) are measured at the **lower of historical cost and cash equivalent value (net realizable value).**\\n    *   If cash equivalent value is lower, the difference is recognized as a loss in the income statement.\\n\\n**Accounting for Shariah-compliant Government Debt Financing**\\n\\nFor Shariah-compliant government debt financing (e.g., Sukuk), the initial recognition shall be at fair value, adjusted for any transaction costs directly attributable to the issuance of the Sukuk. Subsequent measurement shall follow the effective yield method, recognizing periodic payments as finance charges and allocating them over the Sukuk's term. Any premium or discount arising from the issuance shall be amortized over the Sukuk's life and recognized as an adjustment to the finance charges. (ref: AAOIFI AS 17 (Investment Sukuk); FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)) When assessing the impact of proposed U.S. fiscal policies and budget reconciliation processes, an Islamic Financial Institution (IFI) must disclose the Shariah compliance assessment performed, specifically addressing the alignment with core Shariah principles, including the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. This disclosure should include a qualitative description of any potential non-compliance and its impact on the IFI's operations and financial position. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework; FAS 5)\", justification='Added accounting guidance for Shariah-compliant government debt financing (Sukuk), specifying initial recognition at fair value, subsequent measurement using the effective yield method, and amortization of premiums/discounts (AAOIFI AS 17; FAS 91). Mandates disclosure of Shariah compliance assessments, particularly concerning riba, gharar, and maysir, including a qualitative description of any non-compliance (AAOIFI Governance Standard 2; FAS 5). This addresses a need for specific guidance on how to account for and disclose the Shariah compliance aspects of government debt instruments.', section_id='Accounting Treatment by the Islamic Bank', change_type='addition'), ChangeRecord(old_text='**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**', new_text=\"**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**\\n\\n    *   Upon delivery of Al-Muslam Fihi by the Islamic bank (as seller) to its client in the Parallel Salam transaction.\\n    *   The difference between:\\n        *   The amount paid by the client to the bank (revenue for the bank from Parallel Salam).\\n        *   The cost of Al-Muslam Fihi to the bank (typically the historical cost from its original Salam purchase).\\n    *   This difference is recognized as **profit or loss** for the bank.\\n\\n**Accounting for Government Spending aligned with Maqasid al-Shariah**\\n\\nGovernment spending on projects aligned with Maqasid al-Shariah (e.g., education, healthcare, infrastructure) shall be recognized as expenses in the period the related goods or services are received. If such spending creates or enhances a long-lived asset, it shall be capitalized and depreciated or amortized over its useful life, in accordance with FAS 42 (Determining Amortization of Right-of-Use Assets). Clear disclosure of the nature and amounts of these investments must be provided in the financial statements. (ref: FAS 42; AAOIFI Governance Standard for Waqf Institutions (for concept of socially beneficial spending)) IFI's must evaluate and disclose the ethical implications of U.S. fiscal policies, including their potential impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development, as guided by Islamic teachings. This evaluation should be documented, and any potential impact on the IFI's investment portfolio or social responsibility initiatives should be disclosed. (ref: AAOIFI Shariah Standard 29 on Gold and Silver; FAS 5)\", justification='Added accounting guidance on government spending aligned with Maqasid al-Shariah. Specifies expense recognition for immediate benefits and capitalization/depreciation for long-lived assets (FAS 42). Requires disclosure of investment nature and amounts (AAOIFI Governance Standard for Waqf Institutions). IFIs are also required to evaluate and disclose the ethical implications of U.S. fiscal policies on wealth distribution, social justice, and sustainable development (AAOIFI Shariah Standard 29; FAS 5). This addresses the need for accounting and disclosure standards concerning socially responsible government spending from an Islamic finance perspective.', section_id='Accounting Treatment by the Islamic Bank', change_type='addition'), ChangeRecord(old_text='## Disclosure Requirements', new_text=\"**Accounting for Tax Policies aligned with Zakat Principles**\\n\\nTax policies structured to promote wealth redistribution in accordance with Zakat principles, where legally permissible, shall be assessed for their impact on government revenue. Any reduction in revenue resulting from Zakat-aligned tax policies shall be disclosed, along with an explanation of the policy's objectives and its alignment with Shariah principles. This disclosure should not imply endorsement of Zakat payment in jurisdictions where it is not legally mandated. (ref: AAOIFI Accounting Standard 33 (Investments in Real Estate); (Conceptual link to disclosures around social impact investing in some IFRS implementations)) Where U.S. fiscal policies include or have the potential to integrate principles of Zakat or other forms of charitable contributions and wealth redistribution that align with Islamic social finance principles, IFIs must assess and disclose the potential impact on their tax obligations, charitable giving strategies, and overall social responsibility initiatives. (ref: AAOIFI Shariah Standard 9 on Zakah; FAS 5)\\n\\n## Disclosure Requirements\", justification=\"Added guidance on accounting for tax policies aligned with Zakat principles. Requires assessing the impact on government revenue and disclosing any reductions, along with policy objectives and Shariah alignment. It clarifies that disclosure doesn't imply endorsement of Zakat where it's not mandated (AAOIFI Accounting Standard 33 & IFRS implementations). IFIs must assess and disclose the impact of U.S. fiscal policies integrating Zakat on their tax obligations and social responsibility (AAOIFI Shariah Standard 9; FAS 5). This fills the gap in addressing the financial impacts of Zakat-aligned policies on government revenue and IFI operations.\", section_id='Accounting Treatment by the Islamic Bank', change_type='addition'), ChangeRecord(old_text='*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.', new_text=\"**Accounting for Government Investments in Shariah-compliant Companies/Projects**\\n\\nWhere government spending includes investments in companies or projects, and these investments are structured according to Shariah-compliant principles (e.g., Mudarabah, Musharakah), the government entity shall account for these investments according to the principles of AAOIFI Accounting Standard 5 (Accounting for Mudarabah Financing) or AAOIFI Accounting Standard 6 (Accounting for Musharakah Financing), as applicable. Recognition and measurement should be consistent with the underlying contract terms, and any profit or loss sharing arrangements must be clearly disclosed. (ref: AAOIFI AS 5 (Accounting for Mudarabah Financing); AAOIFI AS 6 (Accounting for Musharakah Financing)) IFIs must disclose their assessment of U.S. government investment projects and public debt management strategies, specifically addressing whether these rely on interest-based financing or other Shariah-non-compliant instruments. If the IFI holds investments in instruments potentially impacted by these strategies, the carrying value and potential impairment, if any, must be disclosed, along with management's assessment of the Shariah compliance risk. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk; FAS 5; IFRS 7)\\n\\n## Disclosure Requirements\\n\\n*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.\", justification='Adds accounting guidance for government investments in Shariah-compliant entities (Mudarabah, Musharakah), referencing AAOIFI AS 5 and AS 6. Requires consistent recognition/measurement with contract terms and disclosure of profit/loss sharing. IFIs must disclose assessments of U.S. government investments, identifying reliance on interest-based or non-compliant instruments. If impacted, carrying value, potential impairment, and Shariah compliance risk assessments must be disclosed (AAOIFI Shariah Standard 23; FAS 5; IFRS 7). This provides needed accounting and disclosure directives for Shariah-compliant government investments and their impact on IFIs.', section_id='Accounting Treatment by the Islamic Bank', change_type='addition'), ChangeRecord(old_text='*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', new_text='## General Guidance Considerations for U.S. Fiscal Policy and Budget Processes\\n\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n## Effective Date\\n\\n*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', justification=\"Add 'General Guidance Considerations for U.S. Fiscal Policy and Budget Processes' to ensure alignment of FAS 7 with core Shariah principles by evaluating U.S. fiscal policies and budget processes, specifically addressing the avoidance of riba, gharar, and maysir (AAOIFI Governance Standard 2). Ethical implications, equitable wealth distribution, social justice, and responsible economic development must also be considered (AAOIFI Shariah Standard 29). Furthermore, government investment projects and public debt management strategies should avoid reliance on interest-based financing or other Shariah-non-compliant instruments (AAOIFI Shariah Standard 23).\", section_id='Effective Date', change_type='modification')], key_changes_summary='The updated FAS 7 now includes specific guidance on integrating Shariah principles with U.S. fiscal policies and budget processes. Key areas updated include:\\n\\n*   **Scope of the Standard:** Expanded to explicitly cover the assessment of U.S. fiscal policies for Shariah compliance.\\n*   **General Shariah Requirements:** Added a new section mandating Shariah compliance in fiscal policies, debt financing, tax policies, and government spending.\\n*   **Accounting Treatment:** Enhanced to include accounting guidelines for Shariah-compliant government debt financing (Sukuk), government spending aligned with Maqasid al-Shariah, tax policies aligned with Zakat principles, and government investments in Shariah-compliant entities.\\n\\nThese changes address gaps in the original FAS by incorporating Shariah governance frameworks, promoting ethical considerations, and providing accounting directives for various aspects of Islamic finance in the context of U.S. fiscal policy.', change_statistics={'additions': 5, 'deletions': 0, 'modifications': 3}), 'change_summary': \"Here's a summary of the changes made to FAS 7:\\n\\n**What's changed?**\\n\\nFAS 7 has been updated to include guidance on how U.S. fiscal policies and budget processes can align with Islamic finance principles. This is especially important given the recent failure of the budget reconciliation bill, which highlights the need for ethical and Shariah-compliant financial practices.\\n\\n**Which parts were updated?**\\n\\n*   **Shariah Clauses:** The standard now includes clauses that ensure fiscal policies are evaluated for consistency with core Shariah principles, such as avoiding interest (riba), excessive uncertainty (gharar), and gambling (maysir). It also emphasizes ethical implications, wealth redistribution, and investment in socially responsible projects.\\n*   **Accounting Clauses:** New accounting clauses have been added to guide Islamic Financial Institutions (IFIs) in assessing and disclosing the impact of U.S. fiscal policies from a Shariah perspective. This includes disclosing Shariah compliance assessments, evaluating ethical implications, and assessing government investment projects for Shariah compliance.\\n\\n**Why were these changes made?**\\n\\nThe updates address a gap in the original FAS 7, which didn't provide enough guidance on integrating Islamic finance principles with U.S. fiscal policies. The goal is to ensure that IFIs can properly evaluate and disclose the Shariah compliance of government policies, promoting transparency and accountability. The changes also aim to promote ethical and sustainable economic development in line with Islamic teachings.\", 'reasoning_trace': {'fas_gaps': {'overall_verdict': {'fas_to_update': ['fas_7'], 'need_new_fas': False, 'overall_justification': 'The analysis indicates that while FAS 7 has a significant gap regarding the integration of Islamic financial principles in the context of U.S. budget reconciliation, other FAS standards do not exhibit any relevant gaps or similarities. Therefore, only FAS 7 requires an update to address this gap, while no new FAS is warranted.', 'overall_chain_of_thought': '1. Reviewed the context of the budget reconciliation bill and its implications. 2. Analyzed each FAS for relevance to the context. 3. Identified that FAS 7 has a notable gap concerning Islamic finance principles. 4. Concluded that FAS 7 needs updating to incorporate Islamic finance considerations, while other FAS standards remain unaffected.', 'overall_referenced_gaps': ['The context discusses U.S. budget reconciliation without consideration of Islamic financial principles.'], 'overall_referenced_similarities': []}, 'updated_fas_details': [{'fas_id': 'fas_7', 'justification': 'FAS 7 needs an update to include guidance on how U.S. fiscal policies and budget reconciliation processes can align with Islamic finance principles.', 'chain_of_thought': '1. Identified the absence of Islamic finance principles in the context of U.S. budget reconciliation. 2. Recognized that FAS 7 should provide clarity on integrating Islamic financial standards with traditional fiscal policies. 3. Concluded that an update is necessary to bridge this gap.', 'referenced_gaps': ['The context discusses U.S. budget reconciliation without consideration of Islamic financial principles.'], 'referenced_similarities': []}], 'new_fas_details': None}, 'board_proposals': [{'llm': 'gemini', 'content': {'shariah_solution': 'To address the gap in FAS 7 regarding the integration of Islamic finance principles with U.S. budget reconciliation, the standard should incorporate guidelines that ensure fiscal policies and budgetary processes are evaluated for their compatibility with core Shariah principles. This involves examining the ethical implications of proposed policies and ensuring they do not contradict prohibitions against interest (riba), excessive uncertainty (gharar), and unethical wealth accumulation. Furthermore, the updated FAS 7 should promote socially responsible investments and equitable distribution of resources in line with Islamic values.', 'updated_shariah_clauses': [{'clause_id': 'FAS7.SH1', 'text': 'FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure.', 'reference': 'AAOIFI Governance Standard 2 on Shariah Governance Framework'}, {'clause_id': 'FAS7.SH2', 'text': 'The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings.', 'reference': 'AAOIFI Shariah Standard 29 on Gold and Silver'}, {'clause_id': 'FAS7.SH3', 'text': \"FAS 7 shall require the analysis of fiscal policies' compliance with the principles of Zakat and its potential integration into the U.S. tax system, exploring mechanisms for charitable contributions and wealth redistribution that align with Islamic social finance principles.\", 'reference': 'AAOIFI Shariah Standard 9 on Zakah'}, {'clause_id': 'FAS7.SH4', 'text': 'Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments.', 'reference': 'AAOIFI Shariah Standard 23 on Investment Sukuk'}], 'accounting_rationale': \"The proposed accounting clauses ensure that IFIs explicitly consider and disclose the impact of U.S. fiscal policies and budget reconciliation processes from a Shariah compliance perspective. This addresses the user's concern about political gridlock and uncertainty related to tax changes. Clause FAS7.ACC1 requires disclosure of Shariah compliance assessments, aligning with AAOIFI Governance Standard 2. Clause FAS7.ACC2 addresses the ethical implications, referencing AAOIFI Shariah Standard 29. Clause FAS7.ACC3 deals with potential integration of Zakat principles, based on AAOIFI Shariah Standard 9. Clause FAS7.ACC4 requires assessment and disclosure of investment projects relying on Shariah-non-compliant instruments, referencing AAOIFI Shariah Standard 23. All clauses also reference FAS 5 (Accounting for Contingencies) to emphasize disclosure requirements. IFRS 7 (Financial Instruments: Disclosures) is referenced in FAS7.ACC4 as it requires disclosure about the significance of financial instruments for an entity's financial position and performance, including the nature and extent of risks arising from financial instruments to which the entity is exposed during the period and at the end of the reporting period, and how the entity manages those risks. The clauses are designed to be practical for IFIs by focusing on disclosure of assessments and potential impacts on their operations and financial positions, promoting transparency and accountability.\", 'updated_accounting_clauses': [{'clause_id': 'FAS7.ACC1', 'text': \"When assessing the impact of proposed U.S. fiscal policies and budget reconciliation processes, an Islamic Financial Institution (IFI) must disclose the Shariah compliance assessment performed, specifically addressing the alignment with core Shariah principles, including the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. This disclosure should include a qualitative description of any potential non-compliance and its impact on the IFI's operations and financial position.\", 'reference': 'AAOIFI Governance Standard 2 on Shariah Governance Framework; FAS 5'}, {'clause_id': 'FAS7.ACC2', 'text': \"IFI's must evaluate and disclose the ethical implications of U.S. fiscal policies, including their potential impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development, as guided by Islamic teachings. This evaluation should be documented, and any potential impact on the IFI's investment portfolio or social responsibility initiatives should be disclosed.\", 'reference': 'AAOIFI Shariah Standard 29 on Gold and Silver; FAS 5'}, {'clause_id': 'FAS7.ACC3', 'text': 'Where U.S. fiscal policies include or have the potential to integrate principles of Zakat or other forms of charitable contributions and wealth redistribution that align with Islamic social finance principles, IFIs must assess and disclose the potential impact on their tax obligations, charitable giving strategies, and overall social responsibility initiatives.', 'reference': 'AAOIFI Shariah Standard 9 on Zakah; FAS 5'}, {'clause_id': 'FAS7.ACC4', 'text': \"IFIs must disclose their assessment of U.S. government investment projects and public debt management strategies, specifically addressing whether these rely on interest-based financing or other Shariah-non-compliant instruments. If the IFI holds investments in instruments potentially impacted by these strategies, the carrying value and potential impairment, if any, must be disclosed, along with management's assessment of the Shariah compliance risk.\", 'reference': 'AAOIFI Shariah Standard 23 on Investment Sukuk; FAS 5; IFRS 7'}], 'references': ['AAOIFI Governance Standard 2 on Shariah Governance Framework', 'AAOIFI Shariah Standard 23 on Investment Sukuk', 'IFRS 7', 'AAOIFI Shariah Standard 9 on Zakah', 'FAS 5', 'AAOIFI Shariah Standard 29 on Gold and Silver']}}, {'llm': 'gpt', 'content': {'shariah_solution': 'To ensure that U.S. fiscal policies and budget reconciliation processes are aligned with Islamic finance principles, FAS 7 must be updated to include specific guidance on permissible and impermissible activities according to Shariah. This includes defining permissible investments and expenditures, and addressing the implications of interest-based financing, which is not permissible in Islamic finance. Moreover, mechanisms such as taxation needs to be addressed in a way that avoids riba and gharar, ensuring fairness and equity in wealth distribution.', 'updated_shariah_clauses': [{'clause_id': 'FAS7.SH1', 'text': 'FAS 7 must incorporate principles ensuring all fiscal policies and budget allocations avoid Riba (interest), Gharar (uncertainty), and Maysir (gambling) in all forms, complying with Shariah principles.', 'reference': \"AAOIFI Shariah Standard 2 on Murabahah, AAOIFI Shariah Standard 4 on Istisna'\"}, {'clause_id': 'FAS7.SH2', 'text': 'Budget reconciliation processes must prioritize expenditures and investments that align with Maqasid al-Shariah (objectives of Shariah), including the protection of life, religion, intellect, lineage, and wealth, ensuring societal well-being and equitable distribution of resources.', 'reference': \"Imam Shatibi's Al-Muwafaqat\"}, {'clause_id': 'FAS7.SH3', 'text': 'Fiscal policies should promote investment in Halal (permissible) sectors and discourage investment in Haram (prohibited) sectors, thereby fostering ethical and sustainable economic growth in accordance with Shariah principles.', 'reference': 'AAOIFI Shariah Standard 14 on Investment Sukuk'}, {'clause_id': 'FAS7.SH4', 'text': 'The taxation framework must ensure fairness and avoid undue burden on individuals and businesses, adhering to principles of justice and equity as outlined in Islamic jurisprudence, while preventing the accumulation of wealth in the hands of a few.', 'reference': 'Qardawi, Yusuf. Fiqh az-Zakat.'}], 'accounting_rationale': 'The updated accounting clauses aim to ensure that governmental entities provide transparency regarding the alignment of their fiscal policies with Shariah principles. Clause FAS7.FiscalPolicy.ACC1 addresses the Shariah update regarding Riba, Gharar, and Maysir by requiring disclosure of alignment with these principles and the mechanisms used to achieve compliance. This aligns with AAOIFI Governance Standard 2, which emphasizes the importance of a Shariah governance framework. Clause FAS7.FiscalPolicy.ACC2 aligns with the Shariah update about Maqasid al-Shariah, requiring disclosure of expenditures categorized by Maqasid. This helps stakeholders assess whether budget allocations support societal well-being. This is similar to how AAOIFI Governance Standard 3 requires review of compliance of activities with Shariah pronouncements. Clause FAS7.Taxation.ACC3 addresses the Shariah update on fairness in taxation, requiring disclosure of the guiding principles of the taxation framework and mechanisms to ensure compliance. This is analogous to AAOIFI Accounting Standard 23, which requires disclosure related to social responsibility of an entity. The political gridlock in US fiscal policy makes these additional disclosures critical to understanding how US fiscal policy impacts the economy and public welfare.', 'updated_accounting_clauses': [{'clause_id': 'FAS7.FiscalPolicy.ACC1', 'text': 'Governmental entities shall disclose the extent to which their fiscal policies and budget allocations are aligned with Shariah principles, including the avoidance of Riba (interest), Gharar (uncertainty), and Maysir (gambling), and the promotion of Halal (permissible) investments. This disclosure shall include a narrative description of the processes and mechanisms used to ensure Shariah compliance, as well as a qualitative assessment of the degree of alignment. Where alignment is not complete, the reasons for non-alignment and the plans for achieving greater compliance shall be disclosed.', 'reference': 'AAOIFI Governance Standard 2 on Shariah Governance Framework'}, {'clause_id': 'FAS7.FiscalPolicy.ACC2', 'text': 'Governmental entities shall disclose expenditures and investments categorized by their alignment with Maqasid al-Shariah (objectives of Shariah), specifically the protection of life, religion, intellect, lineage, and wealth. This disclosure should provide a breakdown of budget allocations across these categories, facilitating an assessment of societal well-being and equitable resource distribution. Disclosures should include both quantitative data on budget allocations and qualitative descriptions of how these allocations contribute to Maqasid al-Shariah.', 'reference': 'AAOIFI Governance Standard 3 on Shariah Compliance Review'}, {'clause_id': 'FAS7.Taxation.ACC3', 'text': 'Governmental entities shall disclose the key principles guiding their taxation framework, demonstrating how it adheres to fairness, justice, and equity, while avoiding undue burden on individuals and businesses, and preventing the accumulation of wealth in the hands of a few. This disclosure shall include a description of the mechanisms in place to ensure tax policies comply with these principles, such as independent reviews or Shariah advisory boards.', 'reference': 'AAOIFI Accounting Standard 23 on Social Responsibility Accounting'}], 'references': ['AAOIFI Governance Standard 2 on Shariah Governance Framework', 'AAOIFI Governance Standard 3 on Shariah Compliance Review', 'AAOIFI Shariah Standard 14 on Investment Sukuk', \"AAOIFI Shariah Standard 4 on Istisna'\", 'AAOIFI Accounting Standard 23 on Social Responsibility Accounting', \"Imam Shatibi's Al-Muwafaqat\", 'FAS 7', 'Qardawi, Yusuf. Fiqh az-Zakat.', 'AAOIFI Shariah Standard 2 on Murabahah']}}, {'llm': 'deepseek', 'content': {'shariah_solution': 'To address the gap in FAS 7 regarding the integration of Islamic finance principles within the U.S. budget reconciliation process, the standard must incorporate guidance on ensuring that fiscal policies and budgetary measures are consistent with Shariah principles of justice, equity, and the prohibition of interest (riba). This involves outlining mechanisms for evaluating the Shariah compliance of proposed tax policies, government spending, and debt management strategies within the budget reconciliation framework. Specifically, the focus should be on avoiding riba-based financing, promoting ethical investments, and ensuring equitable distribution of resources.', 'updated_shariah_clauses': [{'clause_id': 'FAS7.SH1', 'text': 'All fiscal policies and budgetary measures within the scope of this standard shall be evaluated for consistency with fundamental Shariah principles, including the prohibition of riba (interest), gharar (uncertainty), and maysir (gambling).', 'reference': 'AAOIFI Shariah Standard 2 (Murabaha) Principle 1/1'}, {'clause_id': 'FAS7.SH2', 'text': 'Government debt financing should, where feasible, prioritize Shariah-compliant instruments such as Sukuk (Islamic bonds) to minimize reliance on interest-bearing debt and promote ethical financing practices.', 'reference': 'AAOIFI Shariah Standard 17 (Investment Sukuk)'}, {'clause_id': 'FAS7.SH3', 'text': 'Tax policies shall be structured to avoid disproportionately burdening vulnerable populations and to promote wealth redistribution in accordance with Zakat principles, where applicable within the legal framework.', 'reference': 'Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969. Chapter on Zakat and Modern Applications'}, {'clause_id': 'FAS7.SH4', 'text': 'Government spending shall prioritize investments in socially responsible and ethically sound projects that align with Maqasid al-Shariah (the objectives of Shariah), such as education, healthcare, and infrastructure development, while avoiding investments in sectors that are deemed haram (forbidden).', 'reference': 'Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998. Section on Maqasid al-Shariah'}], 'accounting_rationale': \"The proposed accounting clauses aim to provide practical guidance for incorporating Shariah principles into the accounting for government fiscal policies, specifically within the context of the US budget reconciliation process as detailed in the Shariah update. The rationale for each clause is as follows:\\n\\nFAS7.ACC1: This clause addresses the accounting for Shariah-compliant government debt financing, primarily Sukuk. It aligns with AAOIFI AS 17 by requiring initial recognition at fair value and subsequent measurement using the effective yield method. This mirrors conventional debt accounting while ensuring that Shariah-compliant instruments are treated according to their economic substance. Citing FAS 91 provides a familiar analogy from US GAAP for handling premiums and discounts.\\n\\nFAS7.ACC2: This clause focuses on government spending on projects aligned with Maqasid al-Shariah. It requires recognition as expenses when goods or services are received unless a long-lived asset is created, in which case capitalization and depreciation are required. This is consistent with standard accounting practice (FAS 42) and provides transparency regarding socially responsible investments. Drawing on the concept of socially beneficial spending from AAOIFI Governance Standard for Waqf Institutions reinforces the Shariah compliance aspect.\\n\\nFAS7.ACC3: This clause addresses tax policies designed to promote wealth redistribution in accordance with Zakat principles. It requires disclosure of any revenue reduction resulting from such policies and an explanation of their objectives and Shariah alignment. This provides transparency without endorsing Zakat where it's not legally mandated. The link to disclosures around social impact investing in IFRS implementations provides an example of how such policies could be communicated to stakeholders.\\n\\nFAS7.ACC4: This clause addresses government investments structured according to Shariah-compliant principles. It directs users to apply AAOIFI AS 5 and 6, ensuring that Mudarabah and Musharakah investments are accounted for in accordance with established Islamic finance accounting standards. This promotes consistency and comparability in financial reporting for such investments. This addresses the FCIA's gap by ensuring that investments are treated according to their specific structure under Shariah-compliant financing contracts, thereby ensuring compliance.\\n\\nThese clauses are designed to be consistent with both Shariah principles and existing accounting frameworks, providing practical guidance for IFIs while maintaining transparency and comparability in financial reporting. Addressing the recent budget reconciliation bill failure, these clauses provide specific items of consideration within the budget review.\", 'updated_accounting_clauses': [{'clause_id': 'FAS7.ACC1', 'text': \"For Shariah-compliant government debt financing (e.g., Sukuk), the initial recognition shall be at fair value, adjusted for any transaction costs directly attributable to the issuance of the Sukuk. Subsequent measurement shall follow the effective yield method, recognizing periodic payments as finance charges and allocating them over the Sukuk's term. Any premium or discount arising from the issuance shall be amortized over the Sukuk's life and recognized as an adjustment to the finance charges.\", 'reference': 'AAOIFI AS 17 (Investment Sukuk); FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)'}, {'clause_id': 'FAS7.ACC2', 'text': 'Government spending on projects aligned with Maqasid al-Shariah (e.g., education, healthcare, infrastructure) shall be recognized as expenses in the period the related goods or services are received. If such spending creates or enhances a long-lived asset, it shall be capitalized and depreciated or amortized over its useful life, in accordance with FAS 42 (Determining Amortization of Right-of-Use Assets). Clear disclosure of the nature and amounts of these investments must be provided in the financial statements.', 'reference': 'FAS 42; AAOIFI Governance Standard for Waqf Institutions (for concept of socially beneficial spending)'}, {'clause_id': 'FAS7.ACC3', 'text': \"Tax policies structured to promote wealth redistribution in accordance with Zakat principles, where legally permissible, shall be assessed for their impact on government revenue. Any reduction in revenue resulting from Zakat-aligned tax policies shall be disclosed, along with an explanation of the policy's objectives and its alignment with Shariah principles. This disclosure should not imply endorsement of Zakat payment in jurisdictions where it is not legally mandated.\", 'reference': 'AAOIFI Accounting Standard 33 (Investments in Real Estate); (Conceptual link to disclosures around social impact investing in some IFRS implementations)'}, {'clause_id': 'FAS7.ACC4', 'text': 'Where government spending includes investments in companies or projects, and these investments are structured according to Shariah-compliant principles (e.g., Mudarabah, Musharakah), the government entity shall account for these investments according to the principles of AAOIFI Accounting Standard 5 (Accounting for Mudarabah Financing) or AAOIFI Accounting Standard 6 (Accounting for Musharakah Financing), as applicable. Recognition and measurement should be consistent with the underlying contract terms, and any profit or loss sharing arrangements must be clearly disclosed.', 'reference': 'AAOIFI AS 5 (Accounting for Mudarabah Financing); AAOIFI AS 6 (Accounting for Musharakah Financing)'}], 'references': ['FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)', 'FAS 42 (Determining Amortization of Right-of-Use Assets)', 'AAOIFI Shariah Standard 2 (Murabaha)', 'Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998.', 'AAOIFI Accounting Standard 33 (Investments in Real Estate)', 'AAOIFI AS 5 (Accounting for Mudarabah Financing)', 'AAOIFI Governance Standard for Waqf Institutions', 'Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969.', 'AAOIFI Shariah Standard 17 (Investment Sukuk)', 'AAOIFI AS 17 (Investment Sukuk)', 'AAOIFI AS 6 (Accounting for Musharakah Financing)']}}], 'change_summary': \"Here's a summary of the changes made to FAS 7:\\n\\n**What's changed?**\\n\\nFAS 7 has been updated to include guidance on how U.S. fiscal policies and budget processes can align with Islamic finance principles. This is especially important given the recent failure of the budget reconciliation bill, which highlights the need for ethical and Shariah-compliant financial practices.\\n\\n**Which parts were updated?**\\n\\n*   **Shariah Clauses:** The standard now includes clauses that ensure fiscal policies are evaluated for consistency with core Shariah principles, such as avoiding interest (riba), excessive uncertainty (gharar), and gambling (maysir). It also emphasizes ethical implications, wealth redistribution, and investment in socially responsible projects.\\n*   **Accounting Clauses:** New accounting clauses have been added to guide Islamic Financial Institutions (IFIs) in assessing and disclosing the impact of U.S. fiscal policies from a Shariah perspective. This includes disclosing Shariah compliance assessments, evaluating ethical implications, and assessing government investment projects for Shariah compliance.\\n\\n**Why were these changes made?**\\n\\nThe updates address a gap in the original FAS 7, which didn't provide enough guidance on integrating Islamic finance principles with U.S. fiscal policies. The goal is to ensure that IFIs can properly evaluate and disclose the Shariah compliance of government policies, promoting transparency and accountability. The changes also aim to promote ethical and sustainable economic development in line with Islamic teachings.\", 'fas_diff': {'changes': [{'old_paragraph': '## Scope of the Standard', 'new_paragraph': \"## Scope of the Standard\\n\\n*   **General:** This standard applies to Salam and Parallel Salam transactions undertaken by Islamic Financial Institutions (IFIs).\\n\\n*   **Specific Applications:**\\n    1.  Salam financing transactions.\\n    2.  Parallel Salam transactions.\\n    3.  Treatment of Ra's Al-Mal (capital) paid by the Islamic bank in a Salam transaction (when it is the buyer) or received by the bank in a Parallel Salam transaction (when it is the seller).\\n    4.  Accounting for the receipt and subsequent sale of Al-Muslam Fihi by the bank in a Salam transaction, or the delivery of its like in a Parallel Salam transaction.\\n    5.  Related revenues, expenses, gains, and losses.\\n\\n*   **Considerations for U.S. Fiscal Policy and Budget Processes:**\\n    6. Assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n    7. The ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n    8. Government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\", 'justification': 'Expanded the scope to explicitly include the assessment of U.S. fiscal policies and budget processes for alignment with Shariah principles, ethical implications, and compliance of government investment projects/debt management strategies. This addresses a gap by applying Shariah governance frameworks (AAOIFI Governance Standard 2) to government policies, promoting ethical considerations based on Islamic teachings (AAOIFI Shariah Standard 29), and avoiding non-compliant instruments (AAOIFI Shariah Standard 23).', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': \"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\", 'new_paragraph': \"*   **Disclosure of Conflict:** If the standard's requirements conflict with the Islamic bank's charter or local laws, this conflict should be disclosed.\\n\\n## General Shariah Requirements\\n\\n*   All fiscal policies and budgetary measures within the scope of this standard shall be evaluated for consistency with fundamental Shariah principles, including the prohibition of riba (interest), gharar (uncertainty), and maysir (gambling). (ref: AAOIFI Shariah Standard 2 (Murabaha) Principle 1/1; AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   Government debt financing should, where feasible, prioritize Shariah-compliant instruments such as Sukuk (Islamic bonds) to minimize reliance on interest-bearing debt and promote ethical financing practices. (ref: AAOIFI Shariah Standard 17 (Investment Sukuk))\\n*   Tax policies shall be structured to avoid disproportionately burdening vulnerable populations and to promote wealth redistribution in accordance with Zakat principles, where applicable within the legal framework. (ref: Al-Qaradawi, Yusuf. Fiqh az-Zakat. Dar al-Taqwa, 1969. Chapter on Zakat and Modern Applications; AAOIFI Shariah Standard 9 on Zakah)\\n*   Government spending shall prioritize investments in socially responsible and ethically sound projects that align with Maqasid al-Shariah (the objectives of Shariah), such as education, healthcare, and infrastructure development, while avoiding investments in sectors that are deemed haram (forbidden). (ref: Usmani, Muhammad Taqi. An Introduction to Islamic Finance. Idaratul Ma’arif, 1998. Section on Maqasid al-Shariah; AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\", 'justification': 'Added a section on General Shariah Requirements to enforce consideration of Shariah principles in fiscal policy, debt financing, tax policy, and government spending. This fills the gap in the original FAS by incorporating mandatory Shariah compliance considerations. Specifically: prohibits riba, gharar, and maysir (AAOIFI Shariah Standard 2 & Governance Standard 2); encourages Sukuk (AAOIFI Shariah Standard 17); promotes Zakat-aligned tax policies (Al-Qaradawi, Fiqh az-Zakat & AAOIFI Shariah Standard 9); and prioritizes Maqasid al-Shariah-aligned spending (Usmani, Introduction to Islamic Finance & AAOIFI Shariah Standard 29).', 'section': 'Scope of the Standard', 'type': 'addition'}, {'old_paragraph': '## Accounting Treatment by the Islamic Bank', 'new_paragraph': '## Accounting Treatment by the Islamic Bank\\n\\n**General Considerations:** The following accounting treatments are applicable to Islamic banks and financial institutions (IFIs) when engaging in Salam and Parallel Salam transactions, as well as when assessing the impact of U.S. fiscal policies and budget reconciliation processes.\\n\\n**A. Salam Financing (Bank as Al-Muslam - Buyer)**', 'justification': \"Added introductory text under 'Accounting Treatment by the Islamic Bank' to clarify the general considerations for IFIs when dealing with Salam/Parallel Salam transactions and the impact of U.S. fiscal policies. This serves as a preamble, explicitly stating the scope and applicability of the subsequent accounting guidance.\", 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'modification'}, {'old_paragraph': '**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**', 'new_paragraph': \"**4. Measurement of Al-Muslam Fihi *after receipt* (at end of financial period):**\\n\\n    *   Assets acquired through Salam (now inventory) are measured at the **lower of historical cost and cash equivalent value (net realizable value).**\\n    *   If cash equivalent value is lower, the difference is recognized as a loss in the income statement.\\n\\n**Accounting for Shariah-compliant Government Debt Financing**\\n\\nFor Shariah-compliant government debt financing (e.g., Sukuk), the initial recognition shall be at fair value, adjusted for any transaction costs directly attributable to the issuance of the Sukuk. Subsequent measurement shall follow the effective yield method, recognizing periodic payments as finance charges and allocating them over the Sukuk's term. Any premium or discount arising from the issuance shall be amortized over the Sukuk's life and recognized as an adjustment to the finance charges. (ref: AAOIFI AS 17 (Investment Sukuk); FAS 91 (Accounting for Nonrefundable Fees and Costs Associated with Originating or Acquiring Loans and Direct Costs of Leases)) When assessing the impact of proposed U.S. fiscal policies and budget reconciliation processes, an Islamic Financial Institution (IFI) must disclose the Shariah compliance assessment performed, specifically addressing the alignment with core Shariah principles, including the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. This disclosure should include a qualitative description of any potential non-compliance and its impact on the IFI's operations and financial position. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework; FAS 5)\", 'justification': 'Added accounting guidance for Shariah-compliant government debt financing (Sukuk), specifying initial recognition at fair value, subsequent measurement using the effective yield method, and amortization of premiums/discounts (AAOIFI AS 17; FAS 91). Mandates disclosure of Shariah compliance assessments, particularly concerning riba, gharar, and maysir, including a qualitative description of any non-compliance (AAOIFI Governance Standard 2; FAS 5). This addresses a need for specific guidance on how to account for and disclose the Shariah compliance aspects of government debt instruments.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**', 'new_paragraph': \"**2. Recognition of Profit/Loss on Delivery in Parallel Salam:**\\n\\n    *   Upon delivery of Al-Muslam Fihi by the Islamic bank (as seller) to its client in the Parallel Salam transaction.\\n    *   The difference between:\\n        *   The amount paid by the client to the bank (revenue for the bank from Parallel Salam).\\n        *   The cost of Al-Muslam Fihi to the bank (typically the historical cost from its original Salam purchase).\\n    *   This difference is recognized as **profit or loss** for the bank.\\n\\n**Accounting for Government Spending aligned with Maqasid al-Shariah**\\n\\nGovernment spending on projects aligned with Maqasid al-Shariah (e.g., education, healthcare, infrastructure) shall be recognized as expenses in the period the related goods or services are received. If such spending creates or enhances a long-lived asset, it shall be capitalized and depreciated or amortized over its useful life, in accordance with FAS 42 (Determining Amortization of Right-of-Use Assets). Clear disclosure of the nature and amounts of these investments must be provided in the financial statements. (ref: FAS 42; AAOIFI Governance Standard for Waqf Institutions (for concept of socially beneficial spending)) IFI's must evaluate and disclose the ethical implications of U.S. fiscal policies, including their potential impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development, as guided by Islamic teachings. This evaluation should be documented, and any potential impact on the IFI's investment portfolio or social responsibility initiatives should be disclosed. (ref: AAOIFI Shariah Standard 29 on Gold and Silver; FAS 5)\", 'justification': 'Added accounting guidance on government spending aligned with Maqasid al-Shariah. Specifies expense recognition for immediate benefits and capitalization/depreciation for long-lived assets (FAS 42). Requires disclosure of investment nature and amounts (AAOIFI Governance Standard for Waqf Institutions). IFIs are also required to evaluate and disclose the ethical implications of U.S. fiscal policies on wealth distribution, social justice, and sustainable development (AAOIFI Shariah Standard 29; FAS 5). This addresses the need for accounting and disclosure standards concerning socially responsible government spending from an Islamic finance perspective.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '## Disclosure Requirements', 'new_paragraph': \"**Accounting for Tax Policies aligned with Zakat Principles**\\n\\nTax policies structured to promote wealth redistribution in accordance with Zakat principles, where legally permissible, shall be assessed for their impact on government revenue. Any reduction in revenue resulting from Zakat-aligned tax policies shall be disclosed, along with an explanation of the policy's objectives and its alignment with Shariah principles. This disclosure should not imply endorsement of Zakat payment in jurisdictions where it is not legally mandated. (ref: AAOIFI Accounting Standard 33 (Investments in Real Estate); (Conceptual link to disclosures around social impact investing in some IFRS implementations)) Where U.S. fiscal policies include or have the potential to integrate principles of Zakat or other forms of charitable contributions and wealth redistribution that align with Islamic social finance principles, IFIs must assess and disclose the potential impact on their tax obligations, charitable giving strategies, and overall social responsibility initiatives. (ref: AAOIFI Shariah Standard 9 on Zakah; FAS 5)\\n\\n## Disclosure Requirements\", 'justification': \"Added guidance on accounting for tax policies aligned with Zakat principles. Requires assessing the impact on government revenue and disclosing any reductions, along with policy objectives and Shariah alignment. It clarifies that disclosure doesn't imply endorsement of Zakat where it's not mandated (AAOIFI Accounting Standard 33 & IFRS implementations). IFIs must assess and disclose the impact of U.S. fiscal policies integrating Zakat on their tax obligations and social responsibility (AAOIFI Shariah Standard 9; FAS 5). This fills the gap in addressing the financial impacts of Zakat-aligned policies on government revenue and IFI operations.\", 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.', 'new_paragraph': \"**Accounting for Government Investments in Shariah-compliant Companies/Projects**\\n\\nWhere government spending includes investments in companies or projects, and these investments are structured according to Shariah-compliant principles (e.g., Mudarabah, Musharakah), the government entity shall account for these investments according to the principles of AAOIFI Accounting Standard 5 (Accounting for Mudarabah Financing) or AAOIFI Accounting Standard 6 (Accounting for Musharakah Financing), as applicable. Recognition and measurement should be consistent with the underlying contract terms, and any profit or loss sharing arrangements must be clearly disclosed. (ref: AAOIFI AS 5 (Accounting for Mudarabah Financing); AAOIFI AS 6 (Accounting for Musharakah Financing)) IFIs must disclose their assessment of U.S. government investment projects and public debt management strategies, specifically addressing whether these rely on interest-based financing or other Shariah-non-compliant instruments. If the IFI holds investments in instruments potentially impacted by these strategies, the carrying value and potential impairment, if any, must be disclosed, along with management's assessment of the Shariah compliance risk. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk; FAS 5; IFRS 7)\\n\\n## Disclosure Requirements\\n\\n*   The disclosure requirements stated in FAS No. (1): General Presentation and Disclosure in the Financial Statements of Islamic Banks and Financial Institutions should be observed.\", 'justification': 'Adds accounting guidance for government investments in Shariah-compliant entities (Mudarabah, Musharakah), referencing AAOIFI AS 5 and AS 6. Requires consistent recognition/measurement with contract terms and disclosure of profit/loss sharing. IFIs must disclose assessments of U.S. government investments, identifying reliance on interest-based or non-compliant instruments. If impacted, carrying value, potential impairment, and Shariah compliance risk assessments must be disclosed (AAOIFI Shariah Standard 23; FAS 5; IFRS 7). This provides needed accounting and disclosure directives for Shariah-compliant government investments and their impact on IFIs.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', 'new_paragraph': '## General Guidance Considerations for U.S. Fiscal Policy and Budget Processes\\n\\n*   FAS 7 shall include an assessment of proposed U.S. fiscal policies and budget reconciliation processes for their alignment with core Shariah principles, specifically addressing the avoidance of riba (interest), gharar (excessive uncertainty), and maysir (gambling) in government revenue generation and expenditure. (ref: AAOIFI Governance Standard 2 on Shariah Governance Framework)\\n*   The assessment must consider the ethical implications of the proposed fiscal policies, including their impact on equitable distribution of wealth, promotion of social justice, and adherence to principles of sustainable and responsible economic development as guided by Islamic teachings. (ref: AAOIFI Shariah Standard 29 on Gold and Silver)\\n*   Guidance must be provided on evaluating government investment projects and public debt management strategies to ensure they do not rely on interest-based financing or other Shariah-non-compliant instruments. (ref: AAOIFI Shariah Standard 23 on Investment Sukuk)\\n\\n## Effective Date\\n\\n*   This Standard shall be effective for financial statements for fiscal periods beginning **1 Muharram 1419 A.H. or 1 January 1999 A.D.**', 'justification': \"Add 'General Guidance Considerations for U.S. Fiscal Policy and Budget Processes' to ensure alignment of FAS 7 with core Shariah principles by evaluating U.S. fiscal policies and budget processes, specifically addressing the avoidance of riba, gharar, and maysir (AAOIFI Governance Standard 2). Ethical implications, equitable wealth distribution, social justice, and responsible economic development must also be considered (AAOIFI Shariah Standard 29). Furthermore, government investment projects and public debt management strategies should avoid reliance on interest-based financing or other Shariah-non-compliant instruments (AAOIFI Shariah Standard 23).\", 'section': 'Effective Date', 'type': 'modification'}], 'key_changes_summary': 'The updated FAS 7 now includes specific guidance on integrating Shariah principles with U.S. fiscal policies and budget processes. Key areas updated include:\\n\\n*   **Scope of the Standard:** Expanded to explicitly cover the assessment of U.S. fiscal policies for Shariah compliance.\\n*   **General Shariah Requirements:** Added a new section mandating Shariah compliance in fiscal policies, debt financing, tax policies, and government spending.\\n*   **Accounting Treatment:** Enhanced to include accounting guidelines for Shariah-compliant government debt financing (Sukuk), government spending aligned with Maqasid al-Shariah, tax policies aligned with Zakat principles, and government investments in Shariah-compliant entities.\\n\\nThese changes address gaps in the original FAS by incorporating Shariah governance frameworks, promoting ethical considerations, and providing accounting directives for various aspects of Islamic finance in the context of U.S. fiscal policy.', 'change_statistics': {'additions': 5, 'deletions': 0, 'modifications': 3}}}}"