{
  "fas_number": "fas 10",
  "changes": [
    {
      "old_paragraph": "# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview",
      "new_paragraph": "# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\n\nThis standard is updated to incorporate considerations for political risks and uncertainties that may impact Istisna'a and Parallel Istisna'a transactions, particularly for Islamic Financial Institutions (IFIs).",
      "justification": "Added a preamble to indicate that the standard is updated to include considerations for political risks, addressing a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments, especially for IFIs. This aligns with the goal of ensuring that IFIs are more aware of and better prepared for political uncertainties. It sets the stage for the subsequent additions regarding political risk assessment, mitigation, and disclosure.",
      "section": "Overview",
      "type": "addition"
    },
    {
      "old_paragraph": "## Key Principles of Istisna'a",
      "new_paragraph": "## Key Principles of Istisna'a\n\n### Consideration of Political Risks in Istisna'a\n\n*   **Assessment of Political Risks:** IFIs must conduct a thorough assessment of the political risks associated with fiscal policies and budget reconciliation processes, considering potential impacts on financial instruments and investments, and relevant political risks, including potential changes in legislation, government policy, and geopolitical factors, which may materially impact the instrument's value, risk profile, or Shariah compliance. This assessment should include the likelihood of policy changes, their potential financial effects, and strategies for mitigating adverse outcomes. (ref: General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity), Adapted from AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm))\n*   **Disclosure of Political Uncertainties:** Financial reporting should disclose the potential impact of political uncertainties, such as the failure of budget reconciliation bills, on the value and Shariah compliance of financial instruments. Such disclosure should allow stakeholders to make informed decisions based on the best available information about political and economic risks. (ref: AAOIFI Governance Standard 6 on Transparency and Disclosure)\n*   **Scenario Planning:** Investment decisions should incorporate scenario planning that considers various political outcomes and their impact on the permissibility (halal) and profitability of investments, ensuring alignment with Shariah principles under different political circumstances to assess the resilience of financial instruments and transactions under such conditions. (ref: General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha, AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Ihtiyat (Precaution))\n*   **Transaction Structuring:** Where political risks are deemed significant, IFIs should structure transactions to mitigate potential adverse effects, such as incorporating clauses that allow for adjustments or termination in the event of specific political events or policy changes, subject to Shariah compliance requirements. (ref: General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil) and Consideration of Ma'alat (Consequences of Actions))\n*   **Disclosure to Stakeholders:** IFIs must disclose material political risks associated with financial instruments and transactions to relevant stakeholders, including investors and Shariah supervisory boards, to ensure transparency and informed decision-making. (ref: AAOIFI Governance Standard 14: Disclosure and Transparency, and General Shariah Principle: Al-Wuduh (Clarity))",
      "justification": "Added a new subsection detailing the consideration of political risks within the key principles of Istisna'a. Each clause addresses a different aspect of managing and disclosing political risks, with justifications tied to relevant Shariah principles and AAOIFI governance standards. The assessment of political risks is grounded in Sadd al-Dhara'i and Istishab, aligning with Shariah principles of risk mitigation. Disclosure requirements are based on AAOIFI Governance Standard 6, focusing on transparency. Scenario planning utilizes Maslaha and Ihtiyat, emphasizing public interest and precaution in decision-making. Transaction structuring refers to Sadd al-Dhara'i and Ma'alat, blocking means to evil and considering consequences. Disclosure to stakeholders is justified by Al-Wuduh, ensuring clarity. Each addition aims to provide a comprehensive framework for managing political risks in Istisna'a transactions.",
      "section": "Key Principles of Istisna'a",
      "type": "addition"
    },
    {
      "old_paragraph": "## Scope of the Standard",
      "new_paragraph": "## Scope of the Standard\n\nThis standard applies to the accounting and reporting of Istisna’a and Parallel Istisna’a transactions, considering the impact of political risks on the fair value and recoverability of financial assets and liabilities.\n\n*   **Applies to:**",
      "justification": "Modified the introductory paragraph of the Scope section to specifically mention the consideration of political risks affecting the fair value and recoverability of financial assets and liabilities. This aligns the scope of the standard with the new focus on political risk management and clarifies that the standard now encompasses these considerations, linking back to the assessment requirements introduced earlier.",
      "section": "Scope of the Standard",
      "type": "modification"
    },
    {
      "old_paragraph": "## Accounting Treatment by the Islamic Bank",
      "new_paragraph": "## Accounting Treatment by the Islamic Bank\n\n### Impact of Political Risks on Financial Assets and Liabilities\n\n*   **Assessment of Political Events:** An Islamic Financial Institution (IFI) shall assess the impact of significant political events, including the failure of budget reconciliation bills or other fiscal policy changes, and policy changes on the fair value and recoverability of its financial assets and liabilities, including but not limited to Sukuk, Murabaha receivables, and Ijarah assets. This assessment should consider the potential for impairment, changes in fair value, and any impact on the underlying Shariah contracts. This assessment shall be performed at least quarterly, or more frequently if significant political or policy developments occur. (ref: AAOIFI AS 1, para 4.2.1; FAS 5; AAOIFI FAS 30, paragraph 22; IFRS 9, paragraph 5.8.3)\n*   **Impairment Loss Recognition:** If the assessment in FAS10.PoliticalRisk.ACC1 indicates a probable and material adverse impact on the financial position or performance of the IFI or a significant decline in the fair value or recoverability of a financial asset due to political risk, the IFI shall recognize an impairment loss in profit or loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount. The recoverable amount is the higher of the asset's fair value less costs to sell and its value in use, consistent with the requirements for impairment under existing AAOIFI standards. (ref: AAOIFI AS 11; FAS 114; AAOIFI FAS 30, paragraph 45; IFRS 9, paragraph 5.5.17)\n*   **Consideration of Political Risks on Future Cash Flows:** In determining the recoverable amount of financial assets, the IFI shall consider the potential impact of political risks on future cash flows. This includes incorporating scenarios that reflect adverse political or policy changes, such as changes in tax laws, regulations, or government policies that could affect the asset's profitability or cash flow generation. These scenarios should be probability-weighted, reflecting the IFI's assessment of the likelihood of each scenario occurring, and be aligned with the risk disclosures made in accordance with FAS10.SH4. (ref: AAOIFI FAS 30, paragraph 47; IFRS 9, paragraph B5.5.20)\n*   **Disclosure Requirements:** IFIs must disclose in the notes to the financial statements the nature and extent of political risks that could significantly impact the IFI’s operations, including the potential impact of failed budget reconciliation bills or similar events on the fair value or recoverability of assets. This disclosure should include a qualitative description of the risks and, where reasonably estimable, a quantitative estimate of the potential financial impact. An IFI shall disclose the following information related to political risks affecting its financial instruments and transactions: a) The nature and extent of political risks to which the IFI is exposed. b) The methods used to assess and manage these risks, including scenario planning and stress testing. c) The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized. d) A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets. These disclosures are in addition to the Shariah compliance disclosures as per AAOIFI standards. (ref: AAOIFI Governance Standard 6; FAS 5; AAOIFI Governance Standard 14, IFRS 7, paragraph 33)\n*   **Shariah Compliance Assessment:** In assessing the Shariah compliance of investments affected by political risks, IFIs shall consult with their Shariah Supervisory Board (SSB) to determine if the political events have compromised the permissibility of the investment under Shariah principles. Any adjustments required to maintain Shariah compliance should be implemented promptly and disclosed in the financial statements. (ref: AAOIFI Governance Standard 2; FAS 5)\n*   **Accounting Treatment of Contingency Clauses:** If a financial instrument includes clauses allowing for adjustments or termination in the event of specific political events or policy changes (as per FAS10.SH3), the accounting treatment should reflect the economic substance of these clauses. Specifically, the IFI should assess whether these clauses create embedded derivatives that require separation and separate accounting under AAOIFI FAS 34. If separation is not required under AAOIFI FAS 34, the contingency should be factored into the overall recoverability assessment and disclosed. (ref: AAOIFI FAS 34; IFRS 9, paragraph 4.3.3)",
      "justification": "Added a new subsection detailing the impact of political risks on the accounting treatment by Islamic Banks. Each clause explains how political events should be considered in assessing asset values, recognizing impairment losses, planning future cash flows, and disclosing risks. The clauses refer to AAOIFI standards and IFRS, creating a unified framework. The assessment of political events is justified by reference to AAOIFI AS 1, FAS 5, AAOIFI FAS 30, and IFRS 9, emphasizing the importance of regularly monitoring the impact of political events. The impairment loss recognition refers to AAOIFI AS 11, FAS 114, AAOIFI FAS 30, and IFRS 9, providing guidelines for accurately measuring and recording impairment losses. The consideration of political risks on future cash flows refers to AAOIFI FAS 30 and IFRS 9, highlighting the need to integrate political risk scenarios in cash flow projections. The disclosure requirements refer to AAOIFI Governance Standard 6, FAS 5, AAOIFI Governance Standard 14 and IFRS 7, emphasizing the significance of transparency and detailed reporting of political risks.",
      "section": "Accounting Treatment by the Islamic Bank",
      "type": "addition"
    },
    {
      "old_paragraph": "## Disclosure Requirements",
      "new_paragraph": "## Disclosure Requirements\nIn addition to the existing disclosure requirements, the following disclosures related to political risks affecting Istisna'a and Parallel Istisna'a transactions should be included:\n\n*   The nature and extent of political risks to which the IFI is exposed.\n*   The methods used to assess and manage these risks, including scenario planning and stress testing.\n*   The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized.\n*   A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets.",
      "justification": "Extended the disclosure requirements section to include specific disclosures relating to political risks. These additions ensure that stakeholders are informed about the nature, extent, and management of political risks, aligning with the principles of transparency and informed decision-making as described in the reasoning summary. The added clauses specify the need to disclose the nature of political risks, the methods used to assess and manage them, the impact of those risks, and a sensitivity analysis of potential changes.",
      "section": "Disclosure Requirements",
      "type": "modification"
    }
  ],
  "document": "{'fas_number': 'fas 10', 'changes': [{'old_paragraph': \"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\", 'new_paragraph': \"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\\n\\nThis standard is updated to incorporate considerations for political risks and uncertainties that may impact Istisna'a and Parallel Istisna'a transactions, particularly for Islamic Financial Institutions (IFIs).\", 'justification': \"Added a preamble to indicate that the standard is updated to include considerations for political risks, addressing a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments, especially for IFIs. This aligns with the goal of ensuring that IFIs are more aware of and better prepared for political uncertainties. It sets the stage for the subsequent additions regarding political risk assessment, mitigation, and disclosure.\", 'section': 'Overview', 'type': 'addition'}, {'old_paragraph': \"## Key Principles of Istisna'a\", 'new_paragraph': \"## Key Principles of Istisna'a\\n\\n### Consideration of Political Risks in Istisna'a\\n\\n*   **Assessment of Political Risks:** IFIs must conduct a thorough assessment of the political risks associated with fiscal policies and budget reconciliation processes, considering potential impacts on financial instruments and investments, and relevant political risks, including potential changes in legislation, government policy, and geopolitical factors, which may materially impact the instrument's value, risk profile, or Shariah compliance. This assessment should include the likelihood of policy changes, their potential financial effects, and strategies for mitigating adverse outcomes. (ref: General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity), Adapted from AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm))\\n*   **Disclosure of Political Uncertainties:** Financial reporting should disclose the potential impact of political uncertainties, such as the failure of budget reconciliation bills, on the value and Shariah compliance of financial instruments. Such disclosure should allow stakeholders to make informed decisions based on the best available information about political and economic risks. (ref: AAOIFI Governance Standard 6 on Transparency and Disclosure)\\n*   **Scenario Planning:** Investment decisions should incorporate scenario planning that considers various political outcomes and their impact on the permissibility (halal) and profitability of investments, ensuring alignment with Shariah principles under different political circumstances to assess the resilience of financial instruments and transactions under such conditions. (ref: General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha, AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Ihtiyat (Precaution))\\n*   **Transaction Structuring:** Where political risks are deemed significant, IFIs should structure transactions to mitigate potential adverse effects, such as incorporating clauses that allow for adjustments or termination in the event of specific political events or policy changes, subject to Shariah compliance requirements. (ref: General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil) and Consideration of Ma'alat (Consequences of Actions))\\n*   **Disclosure to Stakeholders:** IFIs must disclose material political risks associated with financial instruments and transactions to relevant stakeholders, including investors and Shariah supervisory boards, to ensure transparency and informed decision-making. (ref: AAOIFI Governance Standard 14: Disclosure and Transparency, and General Shariah Principle: Al-Wuduh (Clarity))\", 'justification': \"Added a new subsection detailing the consideration of political risks within the key principles of Istisna'a. Each clause addresses a different aspect of managing and disclosing political risks, with justifications tied to relevant Shariah principles and AAOIFI governance standards. The assessment of political risks is grounded in Sadd al-Dhara'i and Istishab, aligning with Shariah principles of risk mitigation. Disclosure requirements are based on AAOIFI Governance Standard 6, focusing on transparency. Scenario planning utilizes Maslaha and Ihtiyat, emphasizing public interest and precaution in decision-making. Transaction structuring refers to Sadd al-Dhara'i and Ma'alat, blocking means to evil and considering consequences. Disclosure to stakeholders is justified by Al-Wuduh, ensuring clarity. Each addition aims to provide a comprehensive framework for managing political risks in Istisna'a transactions.\", 'section': \"Key Principles of Istisna'a\", 'type': 'addition'}, {'old_paragraph': '## Scope of the Standard', 'new_paragraph': '## Scope of the Standard\\n\\nThis standard applies to the accounting and reporting of Istisna’a and Parallel Istisna’a transactions, considering the impact of political risks on the fair value and recoverability of financial assets and liabilities.\\n\\n*   **Applies to:**', 'justification': 'Modified the introductory paragraph of the Scope section to specifically mention the consideration of political risks affecting the fair value and recoverability of financial assets and liabilities. This aligns the scope of the standard with the new focus on political risk management and clarifies that the standard now encompasses these considerations, linking back to the assessment requirements introduced earlier.', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': '## Accounting Treatment by the Islamic Bank', 'new_paragraph': \"## Accounting Treatment by the Islamic Bank\\n\\n### Impact of Political Risks on Financial Assets and Liabilities\\n\\n*   **Assessment of Political Events:** An Islamic Financial Institution (IFI) shall assess the impact of significant political events, including the failure of budget reconciliation bills or other fiscal policy changes, and policy changes on the fair value and recoverability of its financial assets and liabilities, including but not limited to Sukuk, Murabaha receivables, and Ijarah assets. This assessment should consider the potential for impairment, changes in fair value, and any impact on the underlying Shariah contracts. This assessment shall be performed at least quarterly, or more frequently if significant political or policy developments occur. (ref: AAOIFI AS 1, para 4.2.1; FAS 5; AAOIFI FAS 30, paragraph 22; IFRS 9, paragraph 5.8.3)\\n*   **Impairment Loss Recognition:** If the assessment in FAS10.PoliticalRisk.ACC1 indicates a probable and material adverse impact on the financial position or performance of the IFI or a significant decline in the fair value or recoverability of a financial asset due to political risk, the IFI shall recognize an impairment loss in profit or loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount. The recoverable amount is the higher of the asset's fair value less costs to sell and its value in use, consistent with the requirements for impairment under existing AAOIFI standards. (ref: AAOIFI AS 11; FAS 114; AAOIFI FAS 30, paragraph 45; IFRS 9, paragraph 5.5.17)\\n*   **Consideration of Political Risks on Future Cash Flows:** In determining the recoverable amount of financial assets, the IFI shall consider the potential impact of political risks on future cash flows. This includes incorporating scenarios that reflect adverse political or policy changes, such as changes in tax laws, regulations, or government policies that could affect the asset's profitability or cash flow generation. These scenarios should be probability-weighted, reflecting the IFI's assessment of the likelihood of each scenario occurring, and be aligned with the risk disclosures made in accordance with FAS10.SH4. (ref: AAOIFI FAS 30, paragraph 47; IFRS 9, paragraph B5.5.20)\\n*   **Disclosure Requirements:** IFIs must disclose in the notes to the financial statements the nature and extent of political risks that could significantly impact the IFI’s operations, including the potential impact of failed budget reconciliation bills or similar events on the fair value or recoverability of assets. This disclosure should include a qualitative description of the risks and, where reasonably estimable, a quantitative estimate of the potential financial impact. An IFI shall disclose the following information related to political risks affecting its financial instruments and transactions: a) The nature and extent of political risks to which the IFI is exposed. b) The methods used to assess and manage these risks, including scenario planning and stress testing. c) The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized. d) A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets. These disclosures are in addition to the Shariah compliance disclosures as per AAOIFI standards. (ref: AAOIFI Governance Standard 6; FAS 5; AAOIFI Governance Standard 14, IFRS 7, paragraph 33)\\n*   **Shariah Compliance Assessment:** In assessing the Shariah compliance of investments affected by political risks, IFIs shall consult with their Shariah Supervisory Board (SSB) to determine if the political events have compromised the permissibility of the investment under Shariah principles. Any adjustments required to maintain Shariah compliance should be implemented promptly and disclosed in the financial statements. (ref: AAOIFI Governance Standard 2; FAS 5)\\n*   **Accounting Treatment of Contingency Clauses:** If a financial instrument includes clauses allowing for adjustments or termination in the event of specific political events or policy changes (as per FAS10.SH3), the accounting treatment should reflect the economic substance of these clauses. Specifically, the IFI should assess whether these clauses create embedded derivatives that require separation and separate accounting under AAOIFI FAS 34. If separation is not required under AAOIFI FAS 34, the contingency should be factored into the overall recoverability assessment and disclosed. (ref: AAOIFI FAS 34; IFRS 9, paragraph 4.3.3)\", 'justification': 'Added a new subsection detailing the impact of political risks on the accounting treatment by Islamic Banks. Each clause explains how political events should be considered in assessing asset values, recognizing impairment losses, planning future cash flows, and disclosing risks. The clauses refer to AAOIFI standards and IFRS, creating a unified framework. The assessment of political events is justified by reference to AAOIFI AS 1, FAS 5, AAOIFI FAS 30, and IFRS 9, emphasizing the importance of regularly monitoring the impact of political events. The impairment loss recognition refers to AAOIFI AS 11, FAS 114, AAOIFI FAS 30, and IFRS 9, providing guidelines for accurately measuring and recording impairment losses. The consideration of political risks on future cash flows refers to AAOIFI FAS 30 and IFRS 9, highlighting the need to integrate political risk scenarios in cash flow projections. The disclosure requirements refer to AAOIFI Governance Standard 6, FAS 5, AAOIFI Governance Standard 14 and IFRS 7, emphasizing the significance of transparency and detailed reporting of political risks.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '## Disclosure Requirements', 'new_paragraph': \"## Disclosure Requirements\\nIn addition to the existing disclosure requirements, the following disclosures related to political risks affecting Istisna'a and Parallel Istisna'a transactions should be included:\\n\\n*   The nature and extent of political risks to which the IFI is exposed.\\n*   The methods used to assess and manage these risks, including scenario planning and stress testing.\\n*   The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized.\\n*   A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets.\", 'justification': 'Extended the disclosure requirements section to include specific disclosures relating to political risks. These additions ensure that stakeholders are informed about the nature, extent, and management of political risks, aligning with the principles of transparency and informed decision-making as described in the reasoning summary. The added clauses specify the need to disclose the nature of political risks, the methods used to assess and manage them, the impact of those risks, and a sensitivity analysis of potential changes.', 'section': 'Disclosure Requirements', 'type': 'modification'}], 'document': FASDiffOutput(changes=[ChangeRecord(old_text=\"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\", new_text=\"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\\n\\nThis standard is updated to incorporate considerations for political risks and uncertainties that may impact Istisna'a and Parallel Istisna'a transactions, particularly for Islamic Financial Institutions (IFIs).\", justification=\"Added a preamble to indicate that the standard is updated to include considerations for political risks, addressing a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments, especially for IFIs. This aligns with the goal of ensuring that IFIs are more aware of and better prepared for political uncertainties. It sets the stage for the subsequent additions regarding political risk assessment, mitigation, and disclosure.\", section_id='Overview', change_type='addition'), ChangeRecord(old_text=\"## Key Principles of Istisna'a\", new_text=\"## Key Principles of Istisna'a\\n\\n### Consideration of Political Risks in Istisna'a\\n\\n*   **Assessment of Political Risks:** IFIs must conduct a thorough assessment of the political risks associated with fiscal policies and budget reconciliation processes, considering potential impacts on financial instruments and investments, and relevant political risks, including potential changes in legislation, government policy, and geopolitical factors, which may materially impact the instrument's value, risk profile, or Shariah compliance. This assessment should include the likelihood of policy changes, their potential financial effects, and strategies for mitigating adverse outcomes. (ref: General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity), Adapted from AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm))\\n*   **Disclosure of Political Uncertainties:** Financial reporting should disclose the potential impact of political uncertainties, such as the failure of budget reconciliation bills, on the value and Shariah compliance of financial instruments. Such disclosure should allow stakeholders to make informed decisions based on the best available information about political and economic risks. (ref: AAOIFI Governance Standard 6 on Transparency and Disclosure)\\n*   **Scenario Planning:** Investment decisions should incorporate scenario planning that considers various political outcomes and their impact on the permissibility (halal) and profitability of investments, ensuring alignment with Shariah principles under different political circumstances to assess the resilience of financial instruments and transactions under such conditions. (ref: General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha, AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Ihtiyat (Precaution))\\n*   **Transaction Structuring:** Where political risks are deemed significant, IFIs should structure transactions to mitigate potential adverse effects, such as incorporating clauses that allow for adjustments or termination in the event of specific political events or policy changes, subject to Shariah compliance requirements. (ref: General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil) and Consideration of Ma'alat (Consequences of Actions))\\n*   **Disclosure to Stakeholders:** IFIs must disclose material political risks associated with financial instruments and transactions to relevant stakeholders, including investors and Shariah supervisory boards, to ensure transparency and informed decision-making. (ref: AAOIFI Governance Standard 14: Disclosure and Transparency, and General Shariah Principle: Al-Wuduh (Clarity))\", justification=\"Added a new subsection detailing the consideration of political risks within the key principles of Istisna'a. Each clause addresses a different aspect of managing and disclosing political risks, with justifications tied to relevant Shariah principles and AAOIFI governance standards. The assessment of political risks is grounded in Sadd al-Dhara'i and Istishab, aligning with Shariah principles of risk mitigation. Disclosure requirements are based on AAOIFI Governance Standard 6, focusing on transparency. Scenario planning utilizes Maslaha and Ihtiyat, emphasizing public interest and precaution in decision-making. Transaction structuring refers to Sadd al-Dhara'i and Ma'alat, blocking means to evil and considering consequences. Disclosure to stakeholders is justified by Al-Wuduh, ensuring clarity. Each addition aims to provide a comprehensive framework for managing political risks in Istisna'a transactions.\", section_id=\"Key Principles of Istisna'a\", change_type='addition'), ChangeRecord(old_text='## Scope of the Standard', new_text='## Scope of the Standard\\n\\nThis standard applies to the accounting and reporting of Istisna’a and Parallel Istisna’a transactions, considering the impact of political risks on the fair value and recoverability of financial assets and liabilities.\\n\\n*   **Applies to:**', justification='Modified the introductory paragraph of the Scope section to specifically mention the consideration of political risks affecting the fair value and recoverability of financial assets and liabilities. This aligns the scope of the standard with the new focus on political risk management and clarifies that the standard now encompasses these considerations, linking back to the assessment requirements introduced earlier.', section_id='Scope of the Standard', change_type='modification'), ChangeRecord(old_text='## Accounting Treatment by the Islamic Bank', new_text=\"## Accounting Treatment by the Islamic Bank\\n\\n### Impact of Political Risks on Financial Assets and Liabilities\\n\\n*   **Assessment of Political Events:** An Islamic Financial Institution (IFI) shall assess the impact of significant political events, including the failure of budget reconciliation bills or other fiscal policy changes, and policy changes on the fair value and recoverability of its financial assets and liabilities, including but not limited to Sukuk, Murabaha receivables, and Ijarah assets. This assessment should consider the potential for impairment, changes in fair value, and any impact on the underlying Shariah contracts. This assessment shall be performed at least quarterly, or more frequently if significant political or policy developments occur. (ref: AAOIFI AS 1, para 4.2.1; FAS 5; AAOIFI FAS 30, paragraph 22; IFRS 9, paragraph 5.8.3)\\n*   **Impairment Loss Recognition:** If the assessment in FAS10.PoliticalRisk.ACC1 indicates a probable and material adverse impact on the financial position or performance of the IFI or a significant decline in the fair value or recoverability of a financial asset due to political risk, the IFI shall recognize an impairment loss in profit or loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount. The recoverable amount is the higher of the asset's fair value less costs to sell and its value in use, consistent with the requirements for impairment under existing AAOIFI standards. (ref: AAOIFI AS 11; FAS 114; AAOIFI FAS 30, paragraph 45; IFRS 9, paragraph 5.5.17)\\n*   **Consideration of Political Risks on Future Cash Flows:** In determining the recoverable amount of financial assets, the IFI shall consider the potential impact of political risks on future cash flows. This includes incorporating scenarios that reflect adverse political or policy changes, such as changes in tax laws, regulations, or government policies that could affect the asset's profitability or cash flow generation. These scenarios should be probability-weighted, reflecting the IFI's assessment of the likelihood of each scenario occurring, and be aligned with the risk disclosures made in accordance with FAS10.SH4. (ref: AAOIFI FAS 30, paragraph 47; IFRS 9, paragraph B5.5.20)\\n*   **Disclosure Requirements:** IFIs must disclose in the notes to the financial statements the nature and extent of political risks that could significantly impact the IFI’s operations, including the potential impact of failed budget reconciliation bills or similar events on the fair value or recoverability of assets. This disclosure should include a qualitative description of the risks and, where reasonably estimable, a quantitative estimate of the potential financial impact. An IFI shall disclose the following information related to political risks affecting its financial instruments and transactions: a) The nature and extent of political risks to which the IFI is exposed. b) The methods used to assess and manage these risks, including scenario planning and stress testing. c) The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized. d) A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets. These disclosures are in addition to the Shariah compliance disclosures as per AAOIFI standards. (ref: AAOIFI Governance Standard 6; FAS 5; AAOIFI Governance Standard 14, IFRS 7, paragraph 33)\\n*   **Shariah Compliance Assessment:** In assessing the Shariah compliance of investments affected by political risks, IFIs shall consult with their Shariah Supervisory Board (SSB) to determine if the political events have compromised the permissibility of the investment under Shariah principles. Any adjustments required to maintain Shariah compliance should be implemented promptly and disclosed in the financial statements. (ref: AAOIFI Governance Standard 2; FAS 5)\\n*   **Accounting Treatment of Contingency Clauses:** If a financial instrument includes clauses allowing for adjustments or termination in the event of specific political events or policy changes (as per FAS10.SH3), the accounting treatment should reflect the economic substance of these clauses. Specifically, the IFI should assess whether these clauses create embedded derivatives that require separation and separate accounting under AAOIFI FAS 34. If separation is not required under AAOIFI FAS 34, the contingency should be factored into the overall recoverability assessment and disclosed. (ref: AAOIFI FAS 34; IFRS 9, paragraph 4.3.3)\", justification='Added a new subsection detailing the impact of political risks on the accounting treatment by Islamic Banks. Each clause explains how political events should be considered in assessing asset values, recognizing impairment losses, planning future cash flows, and disclosing risks. The clauses refer to AAOIFI standards and IFRS, creating a unified framework. The assessment of political events is justified by reference to AAOIFI AS 1, FAS 5, AAOIFI FAS 30, and IFRS 9, emphasizing the importance of regularly monitoring the impact of political events. The impairment loss recognition refers to AAOIFI AS 11, FAS 114, AAOIFI FAS 30, and IFRS 9, providing guidelines for accurately measuring and recording impairment losses. The consideration of political risks on future cash flows refers to AAOIFI FAS 30 and IFRS 9, highlighting the need to integrate political risk scenarios in cash flow projections. The disclosure requirements refer to AAOIFI Governance Standard 6, FAS 5, AAOIFI Governance Standard 14 and IFRS 7, emphasizing the significance of transparency and detailed reporting of political risks.', section_id='Accounting Treatment by the Islamic Bank', change_type='addition'), ChangeRecord(old_text='## Disclosure Requirements', new_text=\"## Disclosure Requirements\\nIn addition to the existing disclosure requirements, the following disclosures related to political risks affecting Istisna'a and Parallel Istisna'a transactions should be included:\\n\\n*   The nature and extent of political risks to which the IFI is exposed.\\n*   The methods used to assess and manage these risks, including scenario planning and stress testing.\\n*   The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized.\\n*   A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets.\", justification='Extended the disclosure requirements section to include specific disclosures relating to political risks. These additions ensure that stakeholders are informed about the nature, extent, and management of political risks, aligning with the principles of transparency and informed decision-making as described in the reasoning summary. The added clauses specify the need to disclose the nature of political risks, the methods used to assess and manage them, the impact of those risks, and a sensitivity analysis of potential changes.', section_id='Disclosure Requirements', change_type='modification')], key_changes_summary=\"The AAOIFI Financial Accounting Standard No. (10) has been updated to include guidance on the treatment of political risks in Istisna'a and Parallel Istisna'a transactions, especially for Islamic Financial Institutions (IFIs). These updates include:\\n\\n*   **Introduction of Political Risk Considerations:** New sections address the need to assess, mitigate, and disclose political risks that can affect the value and Shariah compliance of financial instruments.\\n*   **Enhanced Disclosure Requirements:** The disclosure requirements are expanded to include the nature and extent of political risks, the methods used to manage them, their impact on the financial position of the IFI, and sensitivity analyses.\\n*   **Integration with Existing Standards:** The updates integrate with existing AAOIFI and IFRS standards, providing a comprehensive framework for managing and accounting for political risks in Islamic finance.\\n*   **Emphasis on Shariah Compliance:** The updates emphasize the importance of consulting with Shariah Supervisory Boards to ensure that investments remain Shariah-compliant in the face of political events.\\n\\nThese changes address a previous gap in the standard, enhancing the ability of IFIs to manage political uncertainties and maintain Shariah compliance.\", change_statistics={'additions': 3, 'deletions': 0, 'modifications': 2}), 'change_summary': \"Okay, here's the summary of the changes to FAS 10:\\n\\nWe've updated FAS 10 to include guidance on how Islamic Financial Institutions (IFIs) should handle political risks, especially those arising from things like the failure of budget reconciliation bills or changes in government policy.\\n\\n**Here's what's new:**\\n\\n*   **Risk Assessment:** IFIs must now assess how political events and policy changes could impact the value and Shariah compliance of their financial assets (like Sukuk or Murabaha). This includes considering the likelihood of policy changes and planning for different scenarios.\\n*   **Impairment:** If political risks cause a significant decline in the value of an asset, the IFI needs to recognize an impairment loss.\\n*   **Disclosure:** IFIs need to disclose the nature and extent of political risks they face, including how they manage those risks and the potential financial impact.\\n*   **Shariah Compliance:** IFIs must consult with their Shariah Supervisory Board (SSB) to ensure investments remain Shariah-compliant, even when affected by political events. Any necessary adjustments must be made and disclosed.\\n*   **Transaction Structuring:** Where political risks are high, IFIs should structure transactions to minimize potential negative effects. This might involve including clauses that allow for adjustments or termination if specific political events occur.\\n*   **Scenario Planning:** Investment decisions must take into account various political outcomes and their impact on the permissibility and profitability of investments.\\n*   **Contingency Clauses:** If financial instruments have clauses that allow for adjustments or termination due to political events, the accounting treatment should reflect the economic substance of those clauses, including assessing whether they create embedded derivatives.\\n\\n**Why were these changes made?**\\n\\nThe changes address a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments. By adding these guidelines, we aim to ensure that IFIs are more aware of, and better prepared for, political uncertainties, which is crucial for making sound financial decisions and maintaining Shariah compliance. The changes incorporate principles of risk assessment and mitigation, transparency, and consideration of consequences, all of which are important in Islamic finance.\", 'reasoning_trace': {'fas_gaps': {'overall_verdict': {'fas_to_update': ['fas_10'], 'need_new_fas': False, 'overall_justification': 'The analysis revealed that while most FAS do not align with the context of the budget reconciliation bill, FAS 10 has a notable gap concerning the political implications of fiscal policy that it does not address. However, no new FAS is required as the existing standards can be updated to cover this gap.', 'overall_chain_of_thought': '1. Reviewed the context of the budget reconciliation bill and its implications on fiscal policy. 2. Analyzed each FAS for relevance to the context. 3. Identified that FAS 10 has a gap regarding the political aspects of budget policies. 4. Concluded that while an update to FAS 10 is necessary, the other FAS do not require updates or the introduction of new standards.', 'overall_referenced_gaps': ['The context discusses political challenges and implications of federal budget policies that are not addressed by FAS 10.'], 'overall_referenced_similarities': []}, 'updated_fas_details': [{'fas_id': 'fas_10', 'justification': 'FAS 10 needs an update to address the political implications of fiscal policy and budget reconciliation processes, which are significant in understanding the broader context of financial instruments.', 'chain_of_thought': '1. Identified that FAS 10 focuses on financial instruments without considering the political context. 2. Recognized that the failure of budget reconciliation bills can impact financial reporting and investment decisions. 3. Concluded that updating FAS 10 to include guidance on the political implications of fiscal policies would enhance its relevance.', 'referenced_gaps': ['The context discusses political challenges and implications of federal budget policies that are not addressed by FAS 10.'], 'referenced_similarities': []}], 'new_fas_details': None}, 'board_proposals': [{'llm': 'gemini', 'content': {'shariah_solution': 'To address the gap in FAS 10 regarding the political implications of fiscal policy, the standard should be updated to include considerations of political risks and their potential impact on financial instruments and reporting. This update should incorporate principles of risk assessment and mitigation, emphasizing the importance of due diligence in understanding the political landscape and its effects on investment decisions within the framework of Shariah compliance. The solution involves adding clauses that require IFIs to assess political risks and their potential impact on the viability and Shariah compliance of financial instruments.', 'updated_shariah_clauses': [{'clause_id': 'FAS10.SH1', 'text': \"IFI's must conduct a comprehensive assessment of the political risks associated with fiscal policies and budget reconciliation processes, considering potential impacts on financial instruments and investments. This assessment should include the likelihood of policy changes, their potential financial effects, and strategies for mitigating adverse outcomes.\", 'reference': \"General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity)\"}, {'clause_id': 'FAS10.SH2', 'text': 'Financial reporting should disclose the potential impact of political uncertainties, such as the failure of budget reconciliation bills, on the value and Shariah compliance of financial instruments. Such disclosure should allow stakeholders to make informed decisions based on the best available information about political and economic risks.', 'reference': 'AAOIFI Governance Standard 6 on Transparency and Disclosure'}, {'clause_id': 'FAS10.SH3', 'text': 'Investment decisions should incorporate scenario planning that considers various political outcomes and their impact on the permissibility (halal) and profitability of investments, ensuring alignment with Shariah principles under different political circumstances.', 'reference': 'General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha'}], 'accounting_rationale': \"The proposed accounting clauses address the Shariah update's requirement for IFIs to consider political risks, specifically related to fiscal policy changes like failed budget reconciliation bills. \\n\\nFAS10.PoliticalRisk.ACC1 requires an assessment of the impact of such events on assets and liabilities. This directly implements FAS10.SH1 by mandating a comprehensive assessment. It aligns with AAOIFI AS 1, para 4.2.1, which requires assets to be stated at a value to fairly reflect their real condition at the balance sheet date, which political uncertainty can affect. FAS 5 (Contingencies) is referenced as its conceptual approach to possible losses is used.\\n\\nFAS10.PoliticalRisk.ACC2 focuses on impairment recognition, in line with FAS10.SH1's risk mitigation strategy. It draws from AAOIFI AS 11 on Impairment which provides the rules of the assessment of the impairment to assets, and FAS 114 on accounting for loan impairment. \\n\\nFAS10.PoliticalRisk.ACC3 necessitates disclosure of political risks, mirroring FAS10.SH2's emphasis on transparency. It's consistent with AAOIFI Governance Standard 6 on Transparency and Disclosure and also FAS 5, which require disclosure of significant uncertainties. The clause requires a qualitative and, if possible, a quantitative assessment, providing users with a comprehensive view of the risks. \\n\\nFAS10.PoliticalRisk.ACC4 addresses the Shariah compliance aspect highlighted in FAS10.SH3. It emphasizes the importance of consulting with the SSB to ensure investments remain permissible under Shariah, which is crucial for IFIs. This aligns with AAOIFI Governance Standard 2, and FAS 5. This emphasizes the unique aspect of Islamic finance requiring Shariah compliance alongside financial prudence.\", 'updated_accounting_clauses': [{'clause_id': 'FAS10.PoliticalRisk.ACC1', 'text': 'An Islamic Financial Institution (IFI) shall assess the impact of significant political events, including the failure of budget reconciliation bills or other fiscal policy changes, on the carrying value and Shariah compliance of its financial assets and liabilities. This assessment should consider the potential for impairment, changes in fair value, and any impact on the underlying Shariah contracts.', 'reference': 'AAOIFI AS 1, para 4.2.1; FAS 5'}, {'clause_id': 'FAS10.PoliticalRisk.ACC2', 'text': \"If the assessment in FAS10.PoliticalRisk.ACC1 indicates a probable and material adverse impact on the financial position or performance of the IFI, the IFI shall recognize an impairment loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount, consistent with the requirements for impairment under existing AAOIFI standards.\", 'reference': 'AAOIFI AS 11; FAS 114'}, {'clause_id': 'FAS10.PoliticalRisk.ACC3', 'text': 'IFIs must disclose in the notes to the financial statements the nature and extent of political risks that could significantly impact the IFI’s operations, including the potential impact of failed budget reconciliation bills or similar events on the fair value or recoverability of assets. This disclosure should include a qualitative description of the risks and, where reasonably estimable, a quantitative estimate of the potential financial impact.', 'reference': 'AAOIFI Governance Standard 6; FAS 5'}, {'clause_id': 'FAS10.PoliticalRisk.ACC4', 'text': 'In assessing the Shariah compliance of investments affected by political risks, IFIs shall consult with their Shariah Supervisory Board (SSB) to determine if the political events have compromised the permissibility of the investment under Shariah principles. Any adjustments required to maintain Shariah compliance should be implemented promptly and disclosed in the financial statements.', 'reference': 'AAOIFI Governance Standard 2; FAS 5'}], 'references': ['AAOIFI Governance Standard 6', \"General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity)\", 'AAOIFI Governance Standard 2', 'AAOIFI AS 11', 'AAOIFI AS 1', 'FAS 5', 'FAS 10', 'General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha', 'FAS 114', 'AAOIFI Governance Standard 6 on Transparency and Disclosure']}}, {'llm': 'gpt', 'content': {'shariah_solution': 'To address the identified gap in FAS 10 regarding the political implications of fiscal policy, the proposed solution involves adding a clause that requires Islamic Financial Institutions (IFIs) to consider the potential impact of political events and government policies on the value and performance of financial instruments. This includes assessing the risks associated with policy changes, political instability, and regulatory uncertainty. The assessment should include consultation with experts in political and economic analysis to ensure a comprehensive understanding of the potential risks. Furthermore, IFIs must disclose any significant political risks associated with their investments to stakeholders.', 'updated_shariah_clauses': [{'clause_id': 'FAS10.SH1', 'text': 'IFIs must assess and disclose the potential impact of political events, governmental policies (including fiscal policies subject to political debate and uncertainty such as budget reconciliation bills), and regulatory changes on the value and performance of financial instruments. This assessment should include the consideration of scenarios where proposed policies are not enacted or are significantly altered.', 'reference': 'General Shariah principle of risk management (tahassun min al-mukhatar) and disclosure (ifsaah) to avoid gharar (excessive uncertainty).'}, {'clause_id': 'FAS10.SH2', 'text': \"The assessment of political risks should involve consultation with experts in political and economic analysis, especially concerning governmental fiscal policies. Documentation of expert consultations should be maintained as part of the IFI's risk management process.\", 'reference': \"Shariah requirement for seeking expert advice in specialized areas to ensure sound decision-making, mirroring the principle of 'ahl al-dhikr' (people of knowledge) mentioned in the Quran (16:43).\"}, {'clause_id': 'FAS10.SH3', 'text': 'IFIs shall disclose significant political risks and uncertainties related to fiscal policies associated with their investments to stakeholders, including depositors, shareholders, and other relevant parties. This disclosure should be clear, concise, and readily understandable.', 'reference': 'AAOIFI Governance Standard on Disclosure and Transparency, and the general principle of avoiding gharar (excessive uncertainty) by providing sufficient information for informed decision-making.'}], 'accounting_rationale': 'The updated accounting clauses aim to address the Shariah update regarding the impact of political events and governmental policies, especially fiscal policies, on financial instruments held by IFIs. \\n\\nFAS10.POL1.ACC1 establishes the requirement for IFIs to assess the potential impact of political events and governmental policies on the fair value and impairment of their financial instruments. This directly implements the Shariah principle of risk management (tahassun min al-mukhatar) by mandating a formal assessment of political risks. It also reflects the requirement for continuous monitoring of investments according to Shariah.\\n\\nFAS10.POL1.ACC2 elaborates on the assessment process, requiring IFIs to consider the likelihood of policy changes and their potential financial impacts. This clause enhances the quality and reliability of the risk assessment, facilitating more informed decision-making. It aims to improve decision making under uncertainty. \\n\\nFAS10.POL1.ACC3 addresses the recognition of financial effects resulting from the political risk assessment. This clause clarifies that adjustments should be made in the financial statements to reflect the impact of political events and governmental policies on asset values, ensuring that financial statements accurately reflect the economic realities faced by IFIs.\\n\\nFAS10.POL1.ACC4 focuses on disclosure requirements. This ensures that stakeholders are informed about the political risks and uncertainties faced by IFIs, fostering transparency and accountability. Disclosure is a critical element in Islamic finance, as it helps to avoid gharar (excessive uncertainty).\\n\\nFAS10.POL1.ACC5 mandates documentation of expert consultations. This is crucial for ensuring that the risk assessment process is robust and well-informed, consistent with the Shariah requirement for seeking expert advice. It also ensures auditability and accountability of the risk assessment process.\\n\\nThese clauses are consistent with existing FAS and AAOIFI standards by referencing established accounting principles for fair value measurement, impairment, and disclosure. Specifically, they draw on FAS 115 for guidance on accounting for investments, AAOIFI AS 1 for general presentation and disclosure requirements, and impairment standards. The inclusion of references to IFRS 9 provides further support, particularly in relation to forward-looking information and expected credit losses, where applicable and not in conflict with Shariah principles.', 'updated_accounting_clauses': [{'clause_id': 'FAS10.POL1.ACC1', 'text': 'An Islamic Financial Institution (IFI) shall assess the potential impact of political events and governmental policies, particularly fiscal policies subject to political debate and uncertainty (such as budget reconciliation bills), on the fair value and impairment of its financial instruments. This assessment shall be performed at each reporting date and whenever significant political or policy changes occur.', 'reference': 'FAS 115, Paragraph 12 (Accounting for Certain Investments in Debt and Equity Securities); AAOIFI AS 1 (Presentation and Disclosure of Financial Statements of Islamic Financial Institutions), Paragraph 41'}, {'clause_id': 'FAS10.POL1.ACC2', 'text': 'When assessing the impact of political events and governmental policies, as required by FAS10.POL1.ACC1, IFIs shall consider the likelihood of policy enactment, amendment, or repeal, and the potential financial impact of each scenario. This assessment should include quantitative estimates, where possible, and qualitative descriptions of potential impacts on asset values, revenue streams, and liabilities.', 'reference': 'AAOIFI AS 1 (Presentation and Disclosure of Financial Statements of Islamic Financial Institutions), Paragraph 42 (Disclosure of uncertainties); IFRS 9, Paragraph 5.5.17 (Impairment – Forward Looking Information)'}, {'clause_id': 'FAS10.POL1.ACC3', 'text': 'If the assessment required by FAS10.POL1.ACC1 indicates that political events or governmental policies have had a significant impact on the fair value or impairment of financial instruments, the IFI shall recognize an adjustment in the financial statements. Fair value adjustments shall be recognized in accordance with FAS 115 (or successor standards). Impairment losses shall be recognized in accordance with AAOIFI standards on impairment, considering expected credit losses.', 'reference': \"FAS 115, Paragraph 15 (Changes in Fair Value); AAOIFI AS relevant to Impairment (e.g., for Murabaha or Istisna'a)\"}, {'clause_id': 'FAS10.POL1.ACC4', 'text': 'IFIs shall disclose the nature and extent of political risks and uncertainties related to fiscal policies that could significantly affect their financial position, financial performance, or cash flows. This disclosure shall include a description of the political events or governmental policies considered, the potential financial impact of these events or policies, and any significant assumptions used in the assessment.', 'reference': 'AAOIFI AS 1 (Presentation and Disclosure of Financial Statements of Islamic Financial Institutions), Paragraphs 41-47 (Disclosure of uncertainties and assumptions); IFRS 7, Paragraph 31 (Disclosure of significant risks)'}, {'clause_id': 'FAS10.POL1.ACC5', 'text': \"IFIs shall document the consultation with experts in political and economic analysis regarding governmental fiscal policies, as required by FAS10.SH2. This documentation should include the expert's credentials, the scope of their analysis, and the key findings and recommendations.\", 'reference': 'AAOIFI Governance Standards on Internal Controls and Risk Management'}], 'references': ['IFRS 9 (Conceptual Alignment)', 'AAOIFI Governance Standard on Disclosure and Transparency.', \"AAOIFI Standards on Impairment (e.g., for Murabaha or Istisna'a)\", 'General Shariah principle of risk management (tahassun min al-mukhatar) and disclosure (ifsaah) to avoid gharar (excessive uncertainty).', 'IFRS 7 (Financial Instruments: Disclosures)', 'FAS 115 (Accounting for Certain Investments in Debt and Equity Securities)', 'AAOIFI AS 1 (Presentation and Disclosure of Financial Statements of Islamic Financial Institutions)', 'AAOIFI Governance Standards on Internal Controls and Risk Management', \"Shariah requirement for seeking expert advice in specialized areas to ensure sound decision-making, mirroring the principle of 'ahl al-dhikr' (people of knowledge) mentioned in the Quran (16:43).\"]}}, {'llm': 'deepseek', 'content': {'shariah_solution': 'To address the identified gap in FAS 10 regarding the political implications of fiscal policy, the standard should be updated to include considerations of political risks and uncertainties that may affect financial instruments and transactions. This includes assessing the potential impact of political gridlock, legislative changes, and government policy shifts on the value, risk profile, and Shariah compliance of investments. The updated FAS 10 should emphasize the importance of incorporating political risk analysis in due diligence processes and scenario planning for Islamic financial institutions (IFIs). Furthermore, it should provide guidance on how to structure transactions to mitigate potential adverse effects arising from political instability or policy reversals. The solution aims to ensure that IFIs are better equipped to make informed decisions that are not only financially sound and Shariah-compliant but also resilient to political uncertainties.', 'updated_shariah_clauses': [{'clause_id': 'FAS10.SH1', 'text': \"When evaluating financial instruments or transactions, IFIs must conduct a thorough assessment of relevant political risks, including potential changes in legislation, government policy, and geopolitical factors, which may materially impact the instrument's value, risk profile, or Shariah compliance.\", 'reference': 'Adapted from AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm)'}, {'clause_id': 'FAS10.SH2', 'text': 'IFIs should incorporate scenario planning and stress testing that considers various political scenarios, including adverse policy changes or political instability, to assess the resilience of financial instruments and transactions under such conditions.', 'reference': 'AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Ihtiyat (Precaution)'}, {'clause_id': 'FAS10.SH3', 'text': 'Where political risks are deemed significant, IFIs should structure transactions to mitigate potential adverse effects, such as incorporating clauses that allow for adjustments or termination in the event of specific political events or policy changes, subject to Shariah compliance requirements.', 'reference': \"General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil) and Consideration of Ma'alat (Consequences of Actions)\"}, {'clause_id': 'FAS10.SH4', 'text': 'IFIs must disclose material political risks associated with financial instruments and transactions to relevant stakeholders, including investors and Shariah supervisory boards, to ensure transparency and informed decision-making.', 'reference': 'AAOIFI Governance Standard 14: Disclosure and Transparency, and General Shariah Principle: Al-Wuduh (Clarity)'}], 'accounting_rationale': \"The proposed accounting clauses aim to provide a framework for Islamic Financial Institutions (IFIs) to account for the impact of political risks on their financial instruments, in accordance with the Shariah update to FAS 10. The updated clauses cover the assessment, measurement, presentation, and disclosure of political risks, ensuring that IFIs make informed decisions and provide transparent information to stakeholders. \\n\\nClause FAS10.POL1.ACC1 requires IFIs to assess the impact of political risks on the fair value and recoverability of their financial assets. This aligns with the Shariah principle of 'Ihtiyat' (precaution) and is consistent with AAOIFI FAS 30, which requires regular assessments of impairment. IFRS 9, paragraph 5.8.3, similarly requires assessment of impairment at each reporting date.\\n\\nClause FAS10.POL1.ACC2 addresses the recognition and measurement of impairment losses due to political risk. This clause is consistent with AAOIFI FAS 30, paragraph 45, and IFRS 9, paragraph 5.5.17, which provide guidance on impairment loss recognition. \\n\\nClause FAS10.POL1.ACC3 emphasizes the importance of considering the impact of political risks on future cash flows when determining the recoverable amount of financial assets. This aligns with the Shariah principle of 'Ma'alat' (consequences of actions) and is supported by AAOIFI FAS 30, paragraph 47 and IFRS 9, paragraph B5.5.20, which allows for probability-weighted cash flow estimates.\\n\\nClause FAS10.POL1.ACC4 provides detailed disclosure requirements related to political risks, including the nature and extent of risks, methods of risk management, and the impact on financial position and performance. This clause promotes transparency, consistent with AAOIFI Governance Standard 14 and IFRS 7, paragraph 33.\\n\\nClause FAS10.POL1.ACC5 addresses the accounting treatment of clauses in financial instruments that allow for adjustments or termination in the event of political events. The clause references AAOIFI FAS 34 and IFRS 9, to provide guidance on how to account for embedded derivatives and the related contingencies in the case of political events.\\n\\nThese clauses are designed to be practically applicable for IFIs, taking into consideration the specific characteristics of Shariah-compliant financial instruments and transactions. By incorporating these clauses into FAS 10, IFIs will be better equipped to manage political risks and make informed decisions that are both financially sound and Shariah-compliant.\", 'updated_accounting_clauses': [{'clause_id': 'FAS10.POL1.ACC1', 'text': 'An Islamic Financial Institution (IFI) shall assess the impact of political events and policy changes on the fair value and recoverability of its financial assets, including but not limited to Sukuk, Murabaha receivables, and Ijarah assets. This assessment shall be performed at least quarterly, or more frequently if significant political or policy developments occur.', 'reference': 'AAOIFI FAS 30, paragraph 22; IFRS 9, paragraph 5.8.3'}, {'clause_id': 'FAS10.POL1.ACC2', 'text': \"If the assessment in FAS10.POL1.ACC1 indicates a significant decline in the fair value or recoverability of a financial asset due to political risk, the IFI shall recognize an impairment loss in profit or loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount. The recoverable amount is the higher of the asset's fair value less costs to sell and its value in use.\", 'reference': 'AAOIFI FAS 30, paragraph 45; IFRS 9, paragraph 5.5.17'}, {'clause_id': 'FAS10.POL1.ACC3', 'text': \"In determining the recoverable amount of financial assets, the IFI shall consider the potential impact of political risks on future cash flows. This includes incorporating scenarios that reflect adverse political or policy changes, such as changes in tax laws, regulations, or government policies that could affect the asset's profitability or cash flow generation. These scenarios should be probability-weighted, reflecting the IFI's assessment of the likelihood of each scenario occurring, and be aligned with the risk disclosures made in accordance with FAS10.SH4.\", 'reference': 'AAOIFI FAS 30, paragraph 47; IFRS 9, paragraph B5.5.20'}, {'clause_id': 'FAS10.POL1.ACC4', 'text': \"An IFI shall disclose the following information related to political risks affecting its financial instruments and transactions: a) The nature and extent of political risks to which the IFI is exposed. b) The methods used to assess and manage these risks, including scenario planning and stress testing. c) The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized. d) A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets. These disclosures are in addition to the Shariah compliance disclosures as per AAOIFI standards.\", 'reference': 'AAOIFI Governance Standard 14, IFRS 7, paragraph 33'}, {'clause_id': 'FAS10.POL1.ACC5', 'text': 'If a financial instrument includes clauses allowing for adjustments or termination in the event of specific political events or policy changes (as per FAS10.SH3), the accounting treatment should reflect the economic substance of these clauses. Specifically, the IFI should assess whether these clauses create embedded derivatives that require separation and separate accounting under AAOIFI FAS 34. If separation is not required under AAOIFI FAS 34, the contingency should be factored into the overall recoverability assessment and disclosed.', 'reference': 'AAOIFI FAS 34; IFRS 9, paragraph 4.3.3'}], 'references': ['IFRS 7', 'General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm)', 'AAOIFI Governance Standard 14', 'AAOIFI FAS 34', 'AAOIFI FAS 30', 'AAOIFI Governance Standard 14: Disclosure and Transparency', \"General Shariah Principle: Consideration of Ma'alat (Consequences of Actions)\", 'General Shariah Principle: Al-Wuduh (Clarity)', \"General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil)\", 'AAOIFI Governance Standard 6: Risk Management', 'IFRS 9', 'General Shariah Principle: Ihtiyat (Precaution)']}}], 'change_summary': \"Okay, here's the summary of the changes to FAS 10:\\n\\nWe've updated FAS 10 to include guidance on how Islamic Financial Institutions (IFIs) should handle political risks, especially those arising from things like the failure of budget reconciliation bills or changes in government policy.\\n\\n**Here's what's new:**\\n\\n*   **Risk Assessment:** IFIs must now assess how political events and policy changes could impact the value and Shariah compliance of their financial assets (like Sukuk or Murabaha). This includes considering the likelihood of policy changes and planning for different scenarios.\\n*   **Impairment:** If political risks cause a significant decline in the value of an asset, the IFI needs to recognize an impairment loss.\\n*   **Disclosure:** IFIs need to disclose the nature and extent of political risks they face, including how they manage those risks and the potential financial impact.\\n*   **Shariah Compliance:** IFIs must consult with their Shariah Supervisory Board (SSB) to ensure investments remain Shariah-compliant, even when affected by political events. Any necessary adjustments must be made and disclosed.\\n*   **Transaction Structuring:** Where political risks are high, IFIs should structure transactions to minimize potential negative effects. This might involve including clauses that allow for adjustments or termination if specific political events occur.\\n*   **Scenario Planning:** Investment decisions must take into account various political outcomes and their impact on the permissibility and profitability of investments.\\n*   **Contingency Clauses:** If financial instruments have clauses that allow for adjustments or termination due to political events, the accounting treatment should reflect the economic substance of those clauses, including assessing whether they create embedded derivatives.\\n\\n**Why were these changes made?**\\n\\nThe changes address a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments. By adding these guidelines, we aim to ensure that IFIs are more aware of, and better prepared for, political uncertainties, which is crucial for making sound financial decisions and maintaining Shariah compliance. The changes incorporate principles of risk assessment and mitigation, transparency, and consideration of consequences, all of which are important in Islamic finance.\", 'fas_diff': {'changes': [{'old_paragraph': \"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\", 'new_paragraph': \"# AAOIFI Financial Accounting Standard No. (10): Istisna'a and Parallel Istisna'a - Simplified Overview\\n\\nThis standard is updated to incorporate considerations for political risks and uncertainties that may impact Istisna'a and Parallel Istisna'a transactions, particularly for Islamic Financial Institutions (IFIs).\", 'justification': \"Added a preamble to indicate that the standard is updated to include considerations for political risks, addressing a gap in the original FAS 10, which didn't adequately cover the impact of political risks on financial instruments, especially for IFIs. This aligns with the goal of ensuring that IFIs are more aware of and better prepared for political uncertainties. It sets the stage for the subsequent additions regarding political risk assessment, mitigation, and disclosure.\", 'section': 'Overview', 'type': 'addition'}, {'old_paragraph': \"## Key Principles of Istisna'a\", 'new_paragraph': \"## Key Principles of Istisna'a\\n\\n### Consideration of Political Risks in Istisna'a\\n\\n*   **Assessment of Political Risks:** IFIs must conduct a thorough assessment of the political risks associated with fiscal policies and budget reconciliation processes, considering potential impacts on financial instruments and investments, and relevant political risks, including potential changes in legislation, government policy, and geopolitical factors, which may materially impact the instrument's value, risk profile, or Shariah compliance. This assessment should include the likelihood of policy changes, their potential financial effects, and strategies for mitigating adverse outcomes. (ref: General Shariah principle of risk assessment and mitigation (Sadd al-Dhara'i) and Istishab (presumption of continuity), Adapted from AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Consideration of Maslaha (Public Interest) and Darar (Harm))\\n*   **Disclosure of Political Uncertainties:** Financial reporting should disclose the potential impact of political uncertainties, such as the failure of budget reconciliation bills, on the value and Shariah compliance of financial instruments. Such disclosure should allow stakeholders to make informed decisions based on the best available information about political and economic risks. (ref: AAOIFI Governance Standard 6 on Transparency and Disclosure)\\n*   **Scenario Planning:** Investment decisions should incorporate scenario planning that considers various political outcomes and their impact on the permissibility (halal) and profitability of investments, ensuring alignment with Shariah principles under different political circumstances to assess the resilience of financial instruments and transactions under such conditions. (ref: General Shariah Principle of Maslaha (Public Interest) and AAOIFI Shariah Standard 2 on Murabaha, AAOIFI Governance Standard 6: Risk Management, and General Shariah Principle: Ihtiyat (Precaution))\\n*   **Transaction Structuring:** Where political risks are deemed significant, IFIs should structure transactions to mitigate potential adverse effects, such as incorporating clauses that allow for adjustments or termination in the event of specific political events or policy changes, subject to Shariah compliance requirements. (ref: General Shariah Principle: Sadd al-Dhara'i (Blocking the Means to Evil) and Consideration of Ma'alat (Consequences of Actions))\\n*   **Disclosure to Stakeholders:** IFIs must disclose material political risks associated with financial instruments and transactions to relevant stakeholders, including investors and Shariah supervisory boards, to ensure transparency and informed decision-making. (ref: AAOIFI Governance Standard 14: Disclosure and Transparency, and General Shariah Principle: Al-Wuduh (Clarity))\", 'justification': \"Added a new subsection detailing the consideration of political risks within the key principles of Istisna'a. Each clause addresses a different aspect of managing and disclosing political risks, with justifications tied to relevant Shariah principles and AAOIFI governance standards. The assessment of political risks is grounded in Sadd al-Dhara'i and Istishab, aligning with Shariah principles of risk mitigation. Disclosure requirements are based on AAOIFI Governance Standard 6, focusing on transparency. Scenario planning utilizes Maslaha and Ihtiyat, emphasizing public interest and precaution in decision-making. Transaction structuring refers to Sadd al-Dhara'i and Ma'alat, blocking means to evil and considering consequences. Disclosure to stakeholders is justified by Al-Wuduh, ensuring clarity. Each addition aims to provide a comprehensive framework for managing political risks in Istisna'a transactions.\", 'section': \"Key Principles of Istisna'a\", 'type': 'addition'}, {'old_paragraph': '## Scope of the Standard', 'new_paragraph': '## Scope of the Standard\\n\\nThis standard applies to the accounting and reporting of Istisna’a and Parallel Istisna’a transactions, considering the impact of political risks on the fair value and recoverability of financial assets and liabilities.\\n\\n*   **Applies to:**', 'justification': 'Modified the introductory paragraph of the Scope section to specifically mention the consideration of political risks affecting the fair value and recoverability of financial assets and liabilities. This aligns the scope of the standard with the new focus on political risk management and clarifies that the standard now encompasses these considerations, linking back to the assessment requirements introduced earlier.', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': '## Accounting Treatment by the Islamic Bank', 'new_paragraph': \"## Accounting Treatment by the Islamic Bank\\n\\n### Impact of Political Risks on Financial Assets and Liabilities\\n\\n*   **Assessment of Political Events:** An Islamic Financial Institution (IFI) shall assess the impact of significant political events, including the failure of budget reconciliation bills or other fiscal policy changes, and policy changes on the fair value and recoverability of its financial assets and liabilities, including but not limited to Sukuk, Murabaha receivables, and Ijarah assets. This assessment should consider the potential for impairment, changes in fair value, and any impact on the underlying Shariah contracts. This assessment shall be performed at least quarterly, or more frequently if significant political or policy developments occur. (ref: AAOIFI AS 1, para 4.2.1; FAS 5; AAOIFI FAS 30, paragraph 22; IFRS 9, paragraph 5.8.3)\\n*   **Impairment Loss Recognition:** If the assessment in FAS10.PoliticalRisk.ACC1 indicates a probable and material adverse impact on the financial position or performance of the IFI or a significant decline in the fair value or recoverability of a financial asset due to political risk, the IFI shall recognize an impairment loss in profit or loss. The impairment loss shall be measured as the difference between the asset's carrying amount and its recoverable amount. The recoverable amount is the higher of the asset's fair value less costs to sell and its value in use, consistent with the requirements for impairment under existing AAOIFI standards. (ref: AAOIFI AS 11; FAS 114; AAOIFI FAS 30, paragraph 45; IFRS 9, paragraph 5.5.17)\\n*   **Consideration of Political Risks on Future Cash Flows:** In determining the recoverable amount of financial assets, the IFI shall consider the potential impact of political risks on future cash flows. This includes incorporating scenarios that reflect adverse political or policy changes, such as changes in tax laws, regulations, or government policies that could affect the asset's profitability or cash flow generation. These scenarios should be probability-weighted, reflecting the IFI's assessment of the likelihood of each scenario occurring, and be aligned with the risk disclosures made in accordance with FAS10.SH4. (ref: AAOIFI FAS 30, paragraph 47; IFRS 9, paragraph B5.5.20)\\n*   **Disclosure Requirements:** IFIs must disclose in the notes to the financial statements the nature and extent of political risks that could significantly impact the IFI’s operations, including the potential impact of failed budget reconciliation bills or similar events on the fair value or recoverability of assets. This disclosure should include a qualitative description of the risks and, where reasonably estimable, a quantitative estimate of the potential financial impact. An IFI shall disclose the following information related to political risks affecting its financial instruments and transactions: a) The nature and extent of political risks to which the IFI is exposed. b) The methods used to assess and manage these risks, including scenario planning and stress testing. c) The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized. d) A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets. These disclosures are in addition to the Shariah compliance disclosures as per AAOIFI standards. (ref: AAOIFI Governance Standard 6; FAS 5; AAOIFI Governance Standard 14, IFRS 7, paragraph 33)\\n*   **Shariah Compliance Assessment:** In assessing the Shariah compliance of investments affected by political risks, IFIs shall consult with their Shariah Supervisory Board (SSB) to determine if the political events have compromised the permissibility of the investment under Shariah principles. Any adjustments required to maintain Shariah compliance should be implemented promptly and disclosed in the financial statements. (ref: AAOIFI Governance Standard 2; FAS 5)\\n*   **Accounting Treatment of Contingency Clauses:** If a financial instrument includes clauses allowing for adjustments or termination in the event of specific political events or policy changes (as per FAS10.SH3), the accounting treatment should reflect the economic substance of these clauses. Specifically, the IFI should assess whether these clauses create embedded derivatives that require separation and separate accounting under AAOIFI FAS 34. If separation is not required under AAOIFI FAS 34, the contingency should be factored into the overall recoverability assessment and disclosed. (ref: AAOIFI FAS 34; IFRS 9, paragraph 4.3.3)\", 'justification': 'Added a new subsection detailing the impact of political risks on the accounting treatment by Islamic Banks. Each clause explains how political events should be considered in assessing asset values, recognizing impairment losses, planning future cash flows, and disclosing risks. The clauses refer to AAOIFI standards and IFRS, creating a unified framework. The assessment of political events is justified by reference to AAOIFI AS 1, FAS 5, AAOIFI FAS 30, and IFRS 9, emphasizing the importance of regularly monitoring the impact of political events. The impairment loss recognition refers to AAOIFI AS 11, FAS 114, AAOIFI FAS 30, and IFRS 9, providing guidelines for accurately measuring and recording impairment losses. The consideration of political risks on future cash flows refers to AAOIFI FAS 30 and IFRS 9, highlighting the need to integrate political risk scenarios in cash flow projections. The disclosure requirements refer to AAOIFI Governance Standard 6, FAS 5, AAOIFI Governance Standard 14 and IFRS 7, emphasizing the significance of transparency and detailed reporting of political risks.', 'section': 'Accounting Treatment by the Islamic Bank', 'type': 'addition'}, {'old_paragraph': '## Disclosure Requirements', 'new_paragraph': \"## Disclosure Requirements\\nIn addition to the existing disclosure requirements, the following disclosures related to political risks affecting Istisna'a and Parallel Istisna'a transactions should be included:\\n\\n*   The nature and extent of political risks to which the IFI is exposed.\\n*   The methods used to assess and manage these risks, including scenario planning and stress testing.\\n*   The impact of political risks on the IFI's financial position and performance, including any impairment losses recognized.\\n*   A sensitivity analysis showing the impact of reasonably possible changes in political factors on the fair value and recoverability of financial assets.\", 'justification': 'Extended the disclosure requirements section to include specific disclosures relating to political risks. These additions ensure that stakeholders are informed about the nature, extent, and management of political risks, aligning with the principles of transparency and informed decision-making as described in the reasoning summary. The added clauses specify the need to disclose the nature of political risks, the methods used to assess and manage them, the impact of those risks, and a sensitivity analysis of potential changes.', 'section': 'Disclosure Requirements', 'type': 'modification'}], 'key_changes_summary': \"The AAOIFI Financial Accounting Standard No. (10) has been updated to include guidance on the treatment of political risks in Istisna'a and Parallel Istisna'a transactions, especially for Islamic Financial Institutions (IFIs). These updates include:\\n\\n*   **Introduction of Political Risk Considerations:** New sections address the need to assess, mitigate, and disclose political risks that can affect the value and Shariah compliance of financial instruments.\\n*   **Enhanced Disclosure Requirements:** The disclosure requirements are expanded to include the nature and extent of political risks, the methods used to manage them, their impact on the financial position of the IFI, and sensitivity analyses.\\n*   **Integration with Existing Standards:** The updates integrate with existing AAOIFI and IFRS standards, providing a comprehensive framework for managing and accounting for political risks in Islamic finance.\\n*   **Emphasis on Shariah Compliance:** The updates emphasize the importance of consulting with Shariah Supervisory Boards to ensure that investments remain Shariah-compliant in the face of political events.\\n\\nThese changes address a previous gap in the standard, enhancing the ability of IFIs to manage political uncertainties and maintain Shariah compliance.\", 'change_statistics': {'additions': 3, 'deletions': 0, 'modifications': 2}}}}"