{
  "fas_number": "fas 4",
  "changes": [
    {
      "old_paragraph": "## Scope of the Standard",
      "new_paragraph": "## Scope of the Standard\n\n*   **Applies to:**\n    1.  Musharaka financing transactions by Islamic banks.\n    2.  **Constant Musharaka** (where capital shares remain constant).\n    3.  **Diminishing Musharaka** (where the bank's share is gradually transferred to the other partner).\n    4.  Transactions regardless of whether the bank's share is financed from its own funds, commingled unrestricted investment accounts, or restricted investment accounts.\n    5.  The Islamic bank's share in Musharaka profits or losses.",
      "justification": "This addition introduces a structured list specifying what the accounting standard *applies to* in relation to Musharaka financing, including Constant and Diminishing Musharaka. This ensures greater clarity and granularity in defining the scope, derived from the proposal to address the gaps in accounting for Diminishing Musharaka.",
      "section": "Scope of the Standard",
      "type": "modification"
    },
    {
      "old_paragraph": "*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*",
      "new_paragraph": "*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\n\nFAS4.SH1: Upon the establishment of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution shall be clearly defined in terms of its monetary value or its equivalent in assets and shall be valued at their fair market value at the time of the initial contribution, as determined by a mutually agreed upon and Shariah-compliant valuation method, as determined by an independent valuer acceptable to all partners, or at the market value if available. The nature and valuation method of non-monetary contributions must be documented and agreed upon by all partners at the outset. Contributions may be in the form of cash, assets (including real estate), or usufruct, provided such contribution is permissible according to Shariah principles. Any appreciation or depreciation in value from the contribution date until the reporting date should be reflected in the financial statements, subject to Shariah approval. (ref: AAOIFI Shariah Standard 12, Clause 3/1; AAOIFI Shariah Standard 12 (Musharaka) and general principles of fair valuation in Islamic finance)\n\nFAS4.SH2: The profit and loss sharing ratio must be determined and agreed upon by all partners at the beginning of the Musharaka. This ratio need not be equal to the capital contribution ratio and must be clearly stated in the Musharaka agreement. The distribution of profit should occur periodically as agreed by all partners. The agreement governing the diminishing Musharaka shall clearly define the mechanism for partner exits, ensuring that the exit price is determined based on a pre-agreed, Shariah-compliant methodology that mitigates Gharar (uncertainty) and avoids any element of riba (interest). This may include periodic valuations, profit-sharing arrangements, or other Shariah-approved methods. (ref: AAOIFI Shariah Standard 12, Clause 4/1; AAOIFI Shariah Standard 12 (Musharaka) and principles of Gharar avoidance.)\n\nFAS4.SH3: In the event of a partner's exit from the Diminishing Musharaka, the value of the partnership assets shall be determined based on a fair market valuation conducted by an independent valuer acceptable to all partners, or by a mechanism detailed in the shirkah al-'aqd agreement and agreed to by all partners at inception. The exiting partner is entitled to their share of the asset based on this valuation, minus any outstanding liabilities. The profit distribution mechanism in a diminishing Musharaka shall reflect the changing ownership percentages of the partners as the Musharaka diminishes. The method must be clearly defined in the agreement and be Shariah-compliant. Profit allocation should be based on the agreed ratio, taking into consideration the capital contribution and efforts of each partner. Any profit or loss arising from a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) shall be distributed among the remaining partners and the exiting partner according to the agreed-upon profit and loss sharing ratio stipulated in the Musharaka agreement. This distribution must comply with Shariah principles governing profit sharing in Musharaka contracts. (ref: AAOIFI Shariah Standard 12, Clause 5/2; AAOIFI Shariah Standard 12 (Musharaka) and principles of profit and loss sharing in Islamic finance; AAOIFI Shariah Standard 12, section 2/1)\n\nFAS4.SH4: The Diminishing Musharaka agreement should explicitly detail the process by which the Islamic Financial Institution (IFI) gradually acquires the partner's share of the asset. This process must adhere to Shariah principles, typically involving periodic purchases of portions of the partner's share, ultimately leading to the IFI's full ownership. The final transfer of ownership to the remaining partner(s) in a diminishing Musharaka shall be structured as a sale transaction at an agreed-upon price or through a mechanism compliant with Shariah principles. The method of transfer must be explicitly outlined in the agreement. Diminishing Musharaka agreements and any associated Sukuk issuances must fully comply with the stipulations outlined in AAOIFI Shariah Standard No. 12 concerning Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 pertaining to Investment Sukuk. (ref: AAOIFI Shariah Standard 12, Clause 3/4; AAOIFI Shariah Standard 12 (Musharaka) and principles of Bay' (Sale) in Islamic finance.; AAOIFI Shariah Standard 12 and 23)\n\nFAS4.SH5: Any profits distributed to partners prior to the final liquidation of the Musharaka should be treated as advance profit distribution and will be reconciled against the final valuation upon exit. If the final valuation reveals an overpayment of profit, the exiting partner must return the excess amount unless it is otherwise specified in the agreement that any profit distribution made in good faith will not need to be returned. Such a condition should only be applied if the mechanism for independent valuation is robust and acceptable from a Shariah perspective. Full disclosure of the valuation methodologies used for partner contributions and exits, as well as the profit distribution mechanism, shall be provided to all partners to ensure transparency and mitigate potential disputes. (ref: AAOIFI Shariah Standard 12, Clause 4/3; General principles of transparency and fairness in Islamic finance contracts)\n\nFAS4.SH6: The agreement shall clearly stipulate the mechanisms for resolving disputes among partners, giving preference to amicable solutions through mediation or arbitration in accordance with Shariah principles. It is permissible to agree that any disputes will be settled through a Shariah compliant arbitration center. (ref: Principles of Sulh (Reconciliation) in Islamic Jurisprudence)",
      "justification": "These additions introduce Shariah-specific clauses governing Diminishing Musharaka (Shirkah al-ʿAqd), covering partner contributions (FAS4.SH1), profit and loss sharing (FAS4.SH2), partner exits (FAS4.SH3), gradual acquisition (FAS4.SH4), advance profit distribution (FAS4.SH5) and dispute resolution (FAS4.SH6). This is based on the synthesis of proposals and alignment with AAOIFI standards, ensuring that accounting practices adhere to Shariah principles. The cited AAOIFI standards and Islamic finance principles directly support each clause, addressing the need for Shariah compliance.",
      "section": "Scope of the Standard",
      "type": "addition"
    },
    {
      "old_paragraph": "**4. Disclosure Requirements:**",
      "new_paragraph": "**4. Disclosure Requirements:**\n\nFAS4.Musharaka.ACC6: Islamic Financial Institutions shall disclose the nature and terms of the Diminishing Musharaka (Shirkah al-ʿAqd) agreements, including: a) The profit and loss sharing ratio; b) The valuation method used for contributions and exits; c) Any restrictions on transfer of ownership; d) Dispute resolution mechanisms; e) The carrying amount of the Musharaka investment; f) Significant assumptions used in determining fair value; g) The nature of assets contributed (cash, real estate, or usufruct). Comprehensive disclosures regarding the Diminishing Musharaka shall be provided in the financial statements, including: (a) The nature and purpose of the Musharaka; (b) The terms of the Musharaka agreement, including the profit distribution mechanism and the exit mechanism; (c) The fair market value of the initial contributions and the valuation methods used; (d) The carrying amount of the Musharaka assets; (e) The ownership percentages of the partners; (f) Any significant events or transactions related to the Musharaka, such as impairments or partner exits. The financial statements shall disclose the nature of the Diminishing Musharaka, including the profit and loss sharing ratio, the valuation methodology for in-kind contributions, the mechanism for asset valuation upon exit, the policy for profit distribution, and any significant assumptions used in determining fair values. (ref: FAS 4, paragraph 49; AAOIFI AS 1, paragraph 5; AAOIFI AS 1 (General Presentation and Disclosure) Section 7; AAOIFI AS 1, para 3.1)",
      "justification": "This addition provides comprehensive disclosure requirements for Diminishing Musharaka agreements, aligning with AAOIFI standards and FAS 4 principles. The clauses mandate disclosure of key terms, valuation methods, restrictions, dispute resolution mechanisms, and financial assumptions, enhancing transparency. It directly relates to the proposal's emphasis on transparency and comprehensive disclosures.",
      "section": "Disclosure Requirements",
      "type": "addition"
    },
    {
      "old_paragraph": "**4. Disclosure Requirements:**",
      "new_paragraph": "**4. Disclosure Requirements:**\n\nFAS4.Musharaka.ACC7: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)\nFAS4.Musharaka.ACC8: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)",
      "justification": "This addition emphasizes the need to disclose any disputes arising among partners in relation to Diminishing Musharaka, especially if they involve Shariah-compliant arbitration. It further necessitates accounting for any material impact resulting from such disputes. This is drawn from AAOIFI AS 1, para 3.2, reinforcing the transparency objective.",
      "section": "Disclosure Requirements",
      "type": "addition"
    },
    {
      "old_paragraph": "**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**",
      "new_paragraph": "**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\n\nFAS4.Musharaka.ACC1: Upon the commencement of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution, whether monetary or in-kind, shall be recognized at fair value. In-kind contributions shall be independently valued at the date of contribution, with the valuation methodology disclosed in the financial statements. The difference between the fair value and the carrying amount (if any) of in-kind contributions from the perspective of the contributor should be treated according to existing accounting standards applicable to the contributor. The Islamic Financial Institution (IFI) shall record its share of the Musharaka assets based on its contribution ratio. Initial contributions to a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at fair market value at the time of contribution. If the contribution is in the form of cash, the amount of cash contributed shall be its fair market value. If the contribution is in the form of assets, including real estate or usufruct, an independent valuation, acceptable to all partners, shall be obtained to determine the fair market value. The nature of the contribution (cash, asset, or usufruct) shall be disclosed. Any difference between the carrying amount of assets contributed and their fair market value at the time of contribution shall be recognized as an adjustment to the partners' capital accounts, consistent with the agreed profit and loss sharing ratio and subject to Shariah supervisory board approval. (ref: AAOIFI AS 3, para 3.2; IFRS 3 (Conceptual Alignment); AAOIFI AS 2 (Murabaha Financing) para 3/6 , AAOIFI Shariah Standard 12 (Musharaka); AAOIFI AS 12, section 3/1; AAOIFI AS 1, paragraphs 4.2.3, 4.2.4)",
      "justification": "This addition clarifies the accounting treatment for contributions to Diminishing Musharaka. It emphasizes recognizing contributions at fair value, disclosing valuation methodologies, and addressing the difference between fair value and carrying amount. It aligns with AAOIFI standards and IFRS principles, specifically related to fair value measurement and disclosure.",
      "section": "Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting)",
      "type": "addition"
    },
    {
      "old_paragraph": "**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**",
      "new_paragraph": "**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\n\nFAS4.Musharaka.ACC2: The initial measurement of the Diminishing Musharaka investment by each partner should reflect the fair value of their respective contributions. Subsequent measurement should follow a method that reflects the nature of the underlying assets (e.g., real estate at fair value or cost less depreciation). The chosen method should be consistently applied and disclosed. Subsequent to initial recognition, the carrying amount of the Musharaka assets should be reviewed periodically for impairment in accordance with generally accepted accounting principles. Any impairment loss should be recognized in the income statement and allocated to the partners based on their current ownership percentages at the time of impairment, subject to Shariah approval. Upon a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd), the exiting partner's share shall be derecognized at its fair market value at the time of exit, as determined by the agreed-upon valuation method specified in the Musharaka agreement. Any difference between the carrying amount of the partner's share and the fair market value at exit shall be recognized as a profit or loss and allocated according to the agreed profit/loss sharing ratio. (ref: AAOIFI AS 3, paras 4.1, 4.2; IAS 40 (if real estate); IAS 36 (Impairment of Assets) - Conceptual Alignment for Impairment review.; AAOIFI AS 12, section 4/5; AAOIFI AS 1, paragraph 4.3.2)",
      "justification": "This addition focuses on the subsequent measurement of Diminishing Musharaka investments and the accounting treatment of partner exits. It emphasizes fair value measurement, impairment reviews, and the recognition of profit or loss upon a partner's exit, aligning with AAOIFI standards, IAS 40, and IAS 36. It is directly relevant to the proposals concerning valuation methods and accounting for exits.",
      "section": "Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period)",
      "type": "addition"
    },
    {
      "old_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**",
      "new_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\n\nFAS4.Musharaka.ACC3: Profit and loss sharing shall be accounted for based on the pre-agreed ratio stipulated in the Musharaka agreement. Profit distribution shall be recognized when the right to receive it is established. Losses shall be recognized immediately when they occur, and the carrying amount of the Musharaka investment shall be adjusted accordingly. The profit distribution mechanism shall be clearly defined in the Diminishing Musharaka agreement and shall reflect the changing ownership percentages of the partners. Profit shall be allocated based on the agreed ratio, considering capital contribution, effort, and other relevant factors as per the agreement. The accounting treatment for profit distribution should follow the substance of the agreement, ensuring that the allocation is Shariah-compliant and transparent. Any profit or loss arising from a partner's exit shall be allocated to the remaining partners and the exiting partner based on the pre-agreed profit and loss sharing ratio stipulated in the Diminishing Musharaka agreement. This allocation shall be consistently applied throughout the term of the Musharaka. The method used to determine the fair market value of the exiting partner’s share shall be disclosed. (ref: AAOIFI AS 3, para 5.1; AASB 101; AAOIFI AS 12 (Accounting for investment in Real Estate) Section 5.; AAOIFI AS 12, section 2/1; FAS 4, paragraph 25)",
      "justification": "This addition addresses the accounting for profit and loss sharing in Diminishing Musharaka, emphasizing the pre-agreed ratio, Shariah compliance, and transparency. It clarifies the treatment of profit and loss arising from partner exits, and disclosing the method used to determine fair value. This aligns with AAOIFI standards, AASB 101, and FAS 4 principles.",
      "section": "Recognition of Bank's Share in Musharaka Profits or Losses",
      "type": "addition"
    },
    {
      "old_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**",
      "new_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\n\nFAS4.Musharaka.ACC4: When a partner exits the Diminishing Musharaka, the valuation of the partnership assets shall be determined based on the fair market value at the date of exit, as determined by an independent valuer or by the mechanism stipulated in the Musharaka agreement at inception. The exiting partner's share of the net assets, based on this valuation, shall be derecognized from the financial statements of the remaining partners. The exit of a partner from a Diminishing Musharaka shall be accounted for as a sale of the exiting partner's ownership interest to the remaining partner(s) or to a third party, as per the pre-agreed, Shariah-compliant exit mechanism defined in the Musharaka agreement. If Investment Sukuk are issued in connection with a Diminishing Musharaka, the accounting treatment of the Sukuk shall comply with AAOIFI Shariah Standard No. 23 on Investment Sukuk and any other relevant AAOIFI Accounting Standards related to Sukuk. The disclosures shall include the nature of the Sukuk, the underlying assets of the Musharaka, and the rights and obligations of the Sukuk holders. (ref: AAOIFI AS 3, para 5.2; IFRS 10 (Conceptual Alignment); AAOIFI AS 3 (Mudarabah Financing) para 4/8; AAOIFI AS 23; AAOIFI AS 11)",
      "justification": "This addition describes the accounting treatment for a partner's exit from a Diminishing Musharaka, focusing on fair market valuation, derecognition of the exiting partner's share, and Shariah-compliant exit mechanisms. It also addresses Sukuk issuances in connection with Diminishing Musharaka, adhering to AAOIFI Shariah Standard No. 23. It directly reflects the need to provide clear and specific guidance on valuation methods and address the accounting treatment of profits/losses arising from exits.",
      "section": "Recognition of Bank's Share in Musharaka Profits or Losses",
      "type": "addition"
    },
    {
      "old_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**",
      "new_paragraph": "**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\n\nFAS4.Musharaka.ACC5: Any difference between the carrying amount of the exiting partner’s share and the consideration paid to them shall be recognized as a gain or loss in the profit or loss statement of the remaining partners. If the Diminishing Musharaka involves the gradual acquisition of the exiting partner's share by the IFI, each periodic purchase shall be treated as a separate acquisition of an asset. The final transfer of ownership in a Diminishing Musharaka shall be recognized when all conditions for the transfer, as outlined in the agreement, have been met. The remaining partner(s) shall recognize the acquired assets at the agreed-upon price or as determined by the Shariah-compliant mechanism outlined in the agreement. Any difference between the fair value of the assets acquired and the price paid should be appropriately accounted for, considering the nature of the transaction and Shariah requirements. Distributions to partners before the final liquidation of the Musharaka shall be accounted for as advance profit distributions. Upon a partner's exit, a reconciliation shall be performed to determine if any overpayment of profit has occurred. Any excess amount shall be treated as a liability to the partnership, unless the agreement stipulates that profit distributions made in good faith are not recoverable, provided that the independent valuation mechanism is robust and Shariah-compliant. (ref: AAOIFI AS 3, para 5.3; IFRS 10 (Conceptual Alignment); AAOIFI AS 12 (Accounting for investment in Real Estate) Section 6.; AAOIFI AS 3, para 4.3)",
      "justification": "This addition details the accounting treatment for differences between the carrying amount and consideration paid to an exiting partner, addressing gradual acquisitions and the final transfer of ownership. It also covers the treatment of advance profit distributions and reconciliations upon exit. This provides specific guidance on accounting for profit/loss arising from exits and aligns with AAOIFI standards and IFRS principles.",
      "section": "Recognition of Bank's Share in Musharaka Profits or Losses",
      "type": "addition"
    }
  ],
  "document": "{'fas_number': 'fas 4', 'changes': [{'old_paragraph': '## Scope of the Standard', 'new_paragraph': \"## Scope of the Standard\\n\\n*   **Applies to:**\\n    1.  Musharaka financing transactions by Islamic banks.\\n    2.  **Constant Musharaka** (where capital shares remain constant).\\n    3.  **Diminishing Musharaka** (where the bank's share is gradually transferred to the other partner).\\n    4.  Transactions regardless of whether the bank's share is financed from its own funds, commingled unrestricted investment accounts, or restricted investment accounts.\\n    5.  The Islamic bank's share in Musharaka profits or losses.\", 'justification': 'This addition introduces a structured list specifying what the accounting standard *applies to* in relation to Musharaka financing, including Constant and Diminishing Musharaka. This ensures greater clarity and granularity in defining the scope, derived from the proposal to address the gaps in accounting for Diminishing Musharaka.', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': \"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\", 'new_paragraph': \"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\\n\\nFAS4.SH1: Upon the establishment of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution shall be clearly defined in terms of its monetary value or its equivalent in assets and shall be valued at their fair market value at the time of the initial contribution, as determined by a mutually agreed upon and Shariah-compliant valuation method, as determined by an independent valuer acceptable to all partners, or at the market value if available. The nature and valuation method of non-monetary contributions must be documented and agreed upon by all partners at the outset. Contributions may be in the form of cash, assets (including real estate), or usufruct, provided such contribution is permissible according to Shariah principles. Any appreciation or depreciation in value from the contribution date until the reporting date should be reflected in the financial statements, subject to Shariah approval. (ref: AAOIFI Shariah Standard 12, Clause 3/1; AAOIFI Shariah Standard 12 (Musharaka) and general principles of fair valuation in Islamic finance)\\n\\nFAS4.SH2: The profit and loss sharing ratio must be determined and agreed upon by all partners at the beginning of the Musharaka. This ratio need not be equal to the capital contribution ratio and must be clearly stated in the Musharaka agreement. The distribution of profit should occur periodically as agreed by all partners. The agreement governing the diminishing Musharaka shall clearly define the mechanism for partner exits, ensuring that the exit price is determined based on a pre-agreed, Shariah-compliant methodology that mitigates Gharar (uncertainty) and avoids any element of riba (interest). This may include periodic valuations, profit-sharing arrangements, or other Shariah-approved methods. (ref: AAOIFI Shariah Standard 12, Clause 4/1; AAOIFI Shariah Standard 12 (Musharaka) and principles of Gharar avoidance.)\\n\\nFAS4.SH3: In the event of a partner's exit from the Diminishing Musharaka, the value of the partnership assets shall be determined based on a fair market valuation conducted by an independent valuer acceptable to all partners, or by a mechanism detailed in the shirkah al-'aqd agreement and agreed to by all partners at inception. The exiting partner is entitled to their share of the asset based on this valuation, minus any outstanding liabilities. The profit distribution mechanism in a diminishing Musharaka shall reflect the changing ownership percentages of the partners as the Musharaka diminishes. The method must be clearly defined in the agreement and be Shariah-compliant. Profit allocation should be based on the agreed ratio, taking into consideration the capital contribution and efforts of each partner. Any profit or loss arising from a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) shall be distributed among the remaining partners and the exiting partner according to the agreed-upon profit and loss sharing ratio stipulated in the Musharaka agreement. This distribution must comply with Shariah principles governing profit sharing in Musharaka contracts. (ref: AAOIFI Shariah Standard 12, Clause 5/2; AAOIFI Shariah Standard 12 (Musharaka) and principles of profit and loss sharing in Islamic finance; AAOIFI Shariah Standard 12, section 2/1)\\n\\nFAS4.SH4: The Diminishing Musharaka agreement should explicitly detail the process by which the Islamic Financial Institution (IFI) gradually acquires the partner's share of the asset. This process must adhere to Shariah principles, typically involving periodic purchases of portions of the partner's share, ultimately leading to the IFI's full ownership. The final transfer of ownership to the remaining partner(s) in a diminishing Musharaka shall be structured as a sale transaction at an agreed-upon price or through a mechanism compliant with Shariah principles. The method of transfer must be explicitly outlined in the agreement. Diminishing Musharaka agreements and any associated Sukuk issuances must fully comply with the stipulations outlined in AAOIFI Shariah Standard No. 12 concerning Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 pertaining to Investment Sukuk. (ref: AAOIFI Shariah Standard 12, Clause 3/4; AAOIFI Shariah Standard 12 (Musharaka) and principles of Bay' (Sale) in Islamic finance.; AAOIFI Shariah Standard 12 and 23)\\n\\nFAS4.SH5: Any profits distributed to partners prior to the final liquidation of the Musharaka should be treated as advance profit distribution and will be reconciled against the final valuation upon exit. If the final valuation reveals an overpayment of profit, the exiting partner must return the excess amount unless it is otherwise specified in the agreement that any profit distribution made in good faith will not need to be returned. Such a condition should only be applied if the mechanism for independent valuation is robust and acceptable from a Shariah perspective. Full disclosure of the valuation methodologies used for partner contributions and exits, as well as the profit distribution mechanism, shall be provided to all partners to ensure transparency and mitigate potential disputes. (ref: AAOIFI Shariah Standard 12, Clause 4/3; General principles of transparency and fairness in Islamic finance contracts)\\n\\nFAS4.SH6: The agreement shall clearly stipulate the mechanisms for resolving disputes among partners, giving preference to amicable solutions through mediation or arbitration in accordance with Shariah principles. It is permissible to agree that any disputes will be settled through a Shariah compliant arbitration center. (ref: Principles of Sulh (Reconciliation) in Islamic Jurisprudence)\", 'justification': 'These additions introduce Shariah-specific clauses governing Diminishing Musharaka (Shirkah al-ʿAqd), covering partner contributions (FAS4.SH1), profit and loss sharing (FAS4.SH2), partner exits (FAS4.SH3), gradual acquisition (FAS4.SH4), advance profit distribution (FAS4.SH5) and dispute resolution (FAS4.SH6). This is based on the synthesis of proposals and alignment with AAOIFI standards, ensuring that accounting practices adhere to Shariah principles. The cited AAOIFI standards and Islamic finance principles directly support each clause, addressing the need for Shariah compliance.', 'section': 'Scope of the Standard', 'type': 'addition'}, {'old_paragraph': '**4. Disclosure Requirements:**', 'new_paragraph': '**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC6: Islamic Financial Institutions shall disclose the nature and terms of the Diminishing Musharaka (Shirkah al-ʿAqd) agreements, including: a) The profit and loss sharing ratio; b) The valuation method used for contributions and exits; c) Any restrictions on transfer of ownership; d) Dispute resolution mechanisms; e) The carrying amount of the Musharaka investment; f) Significant assumptions used in determining fair value; g) The nature of assets contributed (cash, real estate, or usufruct). Comprehensive disclosures regarding the Diminishing Musharaka shall be provided in the financial statements, including: (a) The nature and purpose of the Musharaka; (b) The terms of the Musharaka agreement, including the profit distribution mechanism and the exit mechanism; (c) The fair market value of the initial contributions and the valuation methods used; (d) The carrying amount of the Musharaka assets; (e) The ownership percentages of the partners; (f) Any significant events or transactions related to the Musharaka, such as impairments or partner exits. The financial statements shall disclose the nature of the Diminishing Musharaka, including the profit and loss sharing ratio, the valuation methodology for in-kind contributions, the mechanism for asset valuation upon exit, the policy for profit distribution, and any significant assumptions used in determining fair values. (ref: FAS 4, paragraph 49; AAOIFI AS 1, paragraph 5; AAOIFI AS 1 (General Presentation and Disclosure) Section 7; AAOIFI AS 1, para 3.1)', 'justification': \"This addition provides comprehensive disclosure requirements for Diminishing Musharaka agreements, aligning with AAOIFI standards and FAS 4 principles. The clauses mandate disclosure of key terms, valuation methods, restrictions, dispute resolution mechanisms, and financial assumptions, enhancing transparency. It directly relates to the proposal's emphasis on transparency and comprehensive disclosures.\", 'section': 'Disclosure Requirements', 'type': 'addition'}, {'old_paragraph': '**4. Disclosure Requirements:**', 'new_paragraph': '**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC7: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)\\nFAS4.Musharaka.ACC8: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)', 'justification': 'This addition emphasizes the need to disclose any disputes arising among partners in relation to Diminishing Musharaka, especially if they involve Shariah-compliant arbitration. It further necessitates accounting for any material impact resulting from such disputes. This is drawn from AAOIFI AS 1, para 3.2, reinforcing the transparency objective.', 'section': 'Disclosure Requirements', 'type': 'addition'}, {'old_paragraph': \"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\", 'new_paragraph': \"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\\n\\nFAS4.Musharaka.ACC1: Upon the commencement of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution, whether monetary or in-kind, shall be recognized at fair value. In-kind contributions shall be independently valued at the date of contribution, with the valuation methodology disclosed in the financial statements. The difference between the fair value and the carrying amount (if any) of in-kind contributions from the perspective of the contributor should be treated according to existing accounting standards applicable to the contributor. The Islamic Financial Institution (IFI) shall record its share of the Musharaka assets based on its contribution ratio. Initial contributions to a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at fair market value at the time of contribution. If the contribution is in the form of cash, the amount of cash contributed shall be its fair market value. If the contribution is in the form of assets, including real estate or usufruct, an independent valuation, acceptable to all partners, shall be obtained to determine the fair market value. The nature of the contribution (cash, asset, or usufruct) shall be disclosed. Any difference between the carrying amount of assets contributed and their fair market value at the time of contribution shall be recognized as an adjustment to the partners' capital accounts, consistent with the agreed profit and loss sharing ratio and subject to Shariah supervisory board approval. (ref: AAOIFI AS 3, para 3.2; IFRS 3 (Conceptual Alignment); AAOIFI AS 2 (Murabaha Financing) para 3/6 , AAOIFI Shariah Standard 12 (Musharaka); AAOIFI AS 12, section 3/1; AAOIFI AS 1, paragraphs 4.2.3, 4.2.4)\", 'justification': 'This addition clarifies the accounting treatment for contributions to Diminishing Musharaka. It emphasizes recognizing contributions at fair value, disclosing valuation methodologies, and addressing the difference between fair value and carrying amount. It aligns with AAOIFI standards and IFRS principles, specifically related to fair value measurement and disclosure.', 'section': \"Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting)\", 'type': 'addition'}, {'old_paragraph': \"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\", 'new_paragraph': \"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\\n\\nFAS4.Musharaka.ACC2: The initial measurement of the Diminishing Musharaka investment by each partner should reflect the fair value of their respective contributions. Subsequent measurement should follow a method that reflects the nature of the underlying assets (e.g., real estate at fair value or cost less depreciation). The chosen method should be consistently applied and disclosed. Subsequent to initial recognition, the carrying amount of the Musharaka assets should be reviewed periodically for impairment in accordance with generally accepted accounting principles. Any impairment loss should be recognized in the income statement and allocated to the partners based on their current ownership percentages at the time of impairment, subject to Shariah approval. Upon a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd), the exiting partner's share shall be derecognized at its fair market value at the time of exit, as determined by the agreed-upon valuation method specified in the Musharaka agreement. Any difference between the carrying amount of the partner's share and the fair market value at exit shall be recognized as a profit or loss and allocated according to the agreed profit/loss sharing ratio. (ref: AAOIFI AS 3, paras 4.1, 4.2; IAS 40 (if real estate); IAS 36 (Impairment of Assets) - Conceptual Alignment for Impairment review.; AAOIFI AS 12, section 4/5; AAOIFI AS 1, paragraph 4.3.2)\", 'justification': \"This addition focuses on the subsequent measurement of Diminishing Musharaka investments and the accounting treatment of partner exits. It emphasizes fair value measurement, impairment reviews, and the recognition of profit or loss upon a partner's exit, aligning with AAOIFI standards, IAS 40, and IAS 36. It is directly relevant to the proposals concerning valuation methods and accounting for exits.\", 'section': \"Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period)\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC3: Profit and loss sharing shall be accounted for based on the pre-agreed ratio stipulated in the Musharaka agreement. Profit distribution shall be recognized when the right to receive it is established. Losses shall be recognized immediately when they occur, and the carrying amount of the Musharaka investment shall be adjusted accordingly. The profit distribution mechanism shall be clearly defined in the Diminishing Musharaka agreement and shall reflect the changing ownership percentages of the partners. Profit shall be allocated based on the agreed ratio, considering capital contribution, effort, and other relevant factors as per the agreement. The accounting treatment for profit distribution should follow the substance of the agreement, ensuring that the allocation is Shariah-compliant and transparent. Any profit or loss arising from a partner's exit shall be allocated to the remaining partners and the exiting partner based on the pre-agreed profit and loss sharing ratio stipulated in the Diminishing Musharaka agreement. This allocation shall be consistently applied throughout the term of the Musharaka. The method used to determine the fair market value of the exiting partner’s share shall be disclosed. (ref: AAOIFI AS 3, para 5.1; AASB 101; AAOIFI AS 12 (Accounting for investment in Real Estate) Section 5.; AAOIFI AS 12, section 2/1; FAS 4, paragraph 25)\", 'justification': 'This addition addresses the accounting for profit and loss sharing in Diminishing Musharaka, emphasizing the pre-agreed ratio, Shariah compliance, and transparency. It clarifies the treatment of profit and loss arising from partner exits, and disclosing the method used to determine fair value. This aligns with AAOIFI standards, AASB 101, and FAS 4 principles.', 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC4: When a partner exits the Diminishing Musharaka, the valuation of the partnership assets shall be determined based on the fair market value at the date of exit, as determined by an independent valuer or by the mechanism stipulated in the Musharaka agreement at inception. The exiting partner's share of the net assets, based on this valuation, shall be derecognized from the financial statements of the remaining partners. The exit of a partner from a Diminishing Musharaka shall be accounted for as a sale of the exiting partner's ownership interest to the remaining partner(s) or to a third party, as per the pre-agreed, Shariah-compliant exit mechanism defined in the Musharaka agreement. If Investment Sukuk are issued in connection with a Diminishing Musharaka, the accounting treatment of the Sukuk shall comply with AAOIFI Shariah Standard No. 23 on Investment Sukuk and any other relevant AAOIFI Accounting Standards related to Sukuk. The disclosures shall include the nature of the Sukuk, the underlying assets of the Musharaka, and the rights and obligations of the Sukuk holders. (ref: AAOIFI AS 3, para 5.2; IFRS 10 (Conceptual Alignment); AAOIFI AS 3 (Mudarabah Financing) para 4/8; AAOIFI AS 23; AAOIFI AS 11)\", 'justification': \"This addition describes the accounting treatment for a partner's exit from a Diminishing Musharaka, focusing on fair market valuation, derecognition of the exiting partner's share, and Shariah-compliant exit mechanisms. It also addresses Sukuk issuances in connection with Diminishing Musharaka, adhering to AAOIFI Shariah Standard No. 23. It directly reflects the need to provide clear and specific guidance on valuation methods and address the accounting treatment of profits/losses arising from exits.\", 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC5: Any difference between the carrying amount of the exiting partner’s share and the consideration paid to them shall be recognized as a gain or loss in the profit or loss statement of the remaining partners. If the Diminishing Musharaka involves the gradual acquisition of the exiting partner's share by the IFI, each periodic purchase shall be treated as a separate acquisition of an asset. The final transfer of ownership in a Diminishing Musharaka shall be recognized when all conditions for the transfer, as outlined in the agreement, have been met. The remaining partner(s) shall recognize the acquired assets at the agreed-upon price or as determined by the Shariah-compliant mechanism outlined in the agreement. Any difference between the fair value of the assets acquired and the price paid should be appropriately accounted for, considering the nature of the transaction and Shariah requirements. Distributions to partners before the final liquidation of the Musharaka shall be accounted for as advance profit distributions. Upon a partner's exit, a reconciliation shall be performed to determine if any overpayment of profit has occurred. Any excess amount shall be treated as a liability to the partnership, unless the agreement stipulates that profit distributions made in good faith are not recoverable, provided that the independent valuation mechanism is robust and Shariah-compliant. (ref: AAOIFI AS 3, para 5.3; IFRS 10 (Conceptual Alignment); AAOIFI AS 12 (Accounting for investment in Real Estate) Section 6.; AAOIFI AS 3, para 4.3)\", 'justification': 'This addition details the accounting treatment for differences between the carrying amount and consideration paid to an exiting partner, addressing gradual acquisitions and the final transfer of ownership. It also covers the treatment of advance profit distributions and reconciliations upon exit. This provides specific guidance on accounting for profit/loss arising from exits and aligns with AAOIFI standards and IFRS principles.', 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}], 'document': FASDiffOutput(changes=[ChangeRecord(old_text='## Scope of the Standard', new_text=\"## Scope of the Standard\\n\\n*   **Applies to:**\\n    1.  Musharaka financing transactions by Islamic banks.\\n    2.  **Constant Musharaka** (where capital shares remain constant).\\n    3.  **Diminishing Musharaka** (where the bank's share is gradually transferred to the other partner).\\n    4.  Transactions regardless of whether the bank's share is financed from its own funds, commingled unrestricted investment accounts, or restricted investment accounts.\\n    5.  The Islamic bank's share in Musharaka profits or losses.\", justification='This addition introduces a structured list specifying what the accounting standard *applies to* in relation to Musharaka financing, including Constant and Diminishing Musharaka. This ensures greater clarity and granularity in defining the scope, derived from the proposal to address the gaps in accounting for Diminishing Musharaka.', section_id='Scope of the Standard', change_type='modification'), ChangeRecord(old_text=\"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\", new_text=\"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\\n\\nFAS4.SH1: Upon the establishment of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution shall be clearly defined in terms of its monetary value or its equivalent in assets and shall be valued at their fair market value at the time of the initial contribution, as determined by a mutually agreed upon and Shariah-compliant valuation method, as determined by an independent valuer acceptable to all partners, or at the market value if available. The nature and valuation method of non-monetary contributions must be documented and agreed upon by all partners at the outset. Contributions may be in the form of cash, assets (including real estate), or usufruct, provided such contribution is permissible according to Shariah principles. Any appreciation or depreciation in value from the contribution date until the reporting date should be reflected in the financial statements, subject to Shariah approval. (ref: AAOIFI Shariah Standard 12, Clause 3/1; AAOIFI Shariah Standard 12 (Musharaka) and general principles of fair valuation in Islamic finance)\\n\\nFAS4.SH2: The profit and loss sharing ratio must be determined and agreed upon by all partners at the beginning of the Musharaka. This ratio need not be equal to the capital contribution ratio and must be clearly stated in the Musharaka agreement. The distribution of profit should occur periodically as agreed by all partners. The agreement governing the diminishing Musharaka shall clearly define the mechanism for partner exits, ensuring that the exit price is determined based on a pre-agreed, Shariah-compliant methodology that mitigates Gharar (uncertainty) and avoids any element of riba (interest). This may include periodic valuations, profit-sharing arrangements, or other Shariah-approved methods. (ref: AAOIFI Shariah Standard 12, Clause 4/1; AAOIFI Shariah Standard 12 (Musharaka) and principles of Gharar avoidance.)\\n\\nFAS4.SH3: In the event of a partner's exit from the Diminishing Musharaka, the value of the partnership assets shall be determined based on a fair market valuation conducted by an independent valuer acceptable to all partners, or by a mechanism detailed in the shirkah al-'aqd agreement and agreed to by all partners at inception. The exiting partner is entitled to their share of the asset based on this valuation, minus any outstanding liabilities. The profit distribution mechanism in a diminishing Musharaka shall reflect the changing ownership percentages of the partners as the Musharaka diminishes. The method must be clearly defined in the agreement and be Shariah-compliant. Profit allocation should be based on the agreed ratio, taking into consideration the capital contribution and efforts of each partner. Any profit or loss arising from a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) shall be distributed among the remaining partners and the exiting partner according to the agreed-upon profit and loss sharing ratio stipulated in the Musharaka agreement. This distribution must comply with Shariah principles governing profit sharing in Musharaka contracts. (ref: AAOIFI Shariah Standard 12, Clause 5/2; AAOIFI Shariah Standard 12 (Musharaka) and principles of profit and loss sharing in Islamic finance; AAOIFI Shariah Standard 12, section 2/1)\\n\\nFAS4.SH4: The Diminishing Musharaka agreement should explicitly detail the process by which the Islamic Financial Institution (IFI) gradually acquires the partner's share of the asset. This process must adhere to Shariah principles, typically involving periodic purchases of portions of the partner's share, ultimately leading to the IFI's full ownership. The final transfer of ownership to the remaining partner(s) in a diminishing Musharaka shall be structured as a sale transaction at an agreed-upon price or through a mechanism compliant with Shariah principles. The method of transfer must be explicitly outlined in the agreement. Diminishing Musharaka agreements and any associated Sukuk issuances must fully comply with the stipulations outlined in AAOIFI Shariah Standard No. 12 concerning Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 pertaining to Investment Sukuk. (ref: AAOIFI Shariah Standard 12, Clause 3/4; AAOIFI Shariah Standard 12 (Musharaka) and principles of Bay' (Sale) in Islamic finance.; AAOIFI Shariah Standard 12 and 23)\\n\\nFAS4.SH5: Any profits distributed to partners prior to the final liquidation of the Musharaka should be treated as advance profit distribution and will be reconciled against the final valuation upon exit. If the final valuation reveals an overpayment of profit, the exiting partner must return the excess amount unless it is otherwise specified in the agreement that any profit distribution made in good faith will not need to be returned. Such a condition should only be applied if the mechanism for independent valuation is robust and acceptable from a Shariah perspective. Full disclosure of the valuation methodologies used for partner contributions and exits, as well as the profit distribution mechanism, shall be provided to all partners to ensure transparency and mitigate potential disputes. (ref: AAOIFI Shariah Standard 12, Clause 4/3; General principles of transparency and fairness in Islamic finance contracts)\\n\\nFAS4.SH6: The agreement shall clearly stipulate the mechanisms for resolving disputes among partners, giving preference to amicable solutions through mediation or arbitration in accordance with Shariah principles. It is permissible to agree that any disputes will be settled through a Shariah compliant arbitration center. (ref: Principles of Sulh (Reconciliation) in Islamic Jurisprudence)\", justification='These additions introduce Shariah-specific clauses governing Diminishing Musharaka (Shirkah al-ʿAqd), covering partner contributions (FAS4.SH1), profit and loss sharing (FAS4.SH2), partner exits (FAS4.SH3), gradual acquisition (FAS4.SH4), advance profit distribution (FAS4.SH5) and dispute resolution (FAS4.SH6). This is based on the synthesis of proposals and alignment with AAOIFI standards, ensuring that accounting practices adhere to Shariah principles. The cited AAOIFI standards and Islamic finance principles directly support each clause, addressing the need for Shariah compliance.', section_id='Scope of the Standard', change_type='addition'), ChangeRecord(old_text='**4. Disclosure Requirements:**', new_text='**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC6: Islamic Financial Institutions shall disclose the nature and terms of the Diminishing Musharaka (Shirkah al-ʿAqd) agreements, including: a) The profit and loss sharing ratio; b) The valuation method used for contributions and exits; c) Any restrictions on transfer of ownership; d) Dispute resolution mechanisms; e) The carrying amount of the Musharaka investment; f) Significant assumptions used in determining fair value; g) The nature of assets contributed (cash, real estate, or usufruct). Comprehensive disclosures regarding the Diminishing Musharaka shall be provided in the financial statements, including: (a) The nature and purpose of the Musharaka; (b) The terms of the Musharaka agreement, including the profit distribution mechanism and the exit mechanism; (c) The fair market value of the initial contributions and the valuation methods used; (d) The carrying amount of the Musharaka assets; (e) The ownership percentages of the partners; (f) Any significant events or transactions related to the Musharaka, such as impairments or partner exits. The financial statements shall disclose the nature of the Diminishing Musharaka, including the profit and loss sharing ratio, the valuation methodology for in-kind contributions, the mechanism for asset valuation upon exit, the policy for profit distribution, and any significant assumptions used in determining fair values. (ref: FAS 4, paragraph 49; AAOIFI AS 1, paragraph 5; AAOIFI AS 1 (General Presentation and Disclosure) Section 7; AAOIFI AS 1, para 3.1)', justification=\"This addition provides comprehensive disclosure requirements for Diminishing Musharaka agreements, aligning with AAOIFI standards and FAS 4 principles. The clauses mandate disclosure of key terms, valuation methods, restrictions, dispute resolution mechanisms, and financial assumptions, enhancing transparency. It directly relates to the proposal's emphasis on transparency and comprehensive disclosures.\", section_id='Disclosure Requirements', change_type='addition'), ChangeRecord(old_text='**4. Disclosure Requirements:**', new_text='**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC7: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)\\nFAS4.Musharaka.ACC8: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)', justification='This addition emphasizes the need to disclose any disputes arising among partners in relation to Diminishing Musharaka, especially if they involve Shariah-compliant arbitration. It further necessitates accounting for any material impact resulting from such disputes. This is drawn from AAOIFI AS 1, para 3.2, reinforcing the transparency objective.', section_id='Disclosure Requirements', change_type='addition'), ChangeRecord(old_text=\"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\", new_text=\"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\\n\\nFAS4.Musharaka.ACC1: Upon the commencement of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution, whether monetary or in-kind, shall be recognized at fair value. In-kind contributions shall be independently valued at the date of contribution, with the valuation methodology disclosed in the financial statements. The difference between the fair value and the carrying amount (if any) of in-kind contributions from the perspective of the contributor should be treated according to existing accounting standards applicable to the contributor. The Islamic Financial Institution (IFI) shall record its share of the Musharaka assets based on its contribution ratio. Initial contributions to a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at fair market value at the time of contribution. If the contribution is in the form of cash, the amount of cash contributed shall be its fair market value. If the contribution is in the form of assets, including real estate or usufruct, an independent valuation, acceptable to all partners, shall be obtained to determine the fair market value. The nature of the contribution (cash, asset, or usufruct) shall be disclosed. Any difference between the carrying amount of assets contributed and their fair market value at the time of contribution shall be recognized as an adjustment to the partners' capital accounts, consistent with the agreed profit and loss sharing ratio and subject to Shariah supervisory board approval. (ref: AAOIFI AS 3, para 3.2; IFRS 3 (Conceptual Alignment); AAOIFI AS 2 (Murabaha Financing) para 3/6 , AAOIFI Shariah Standard 12 (Musharaka); AAOIFI AS 12, section 3/1; AAOIFI AS 1, paragraphs 4.2.3, 4.2.4)\", justification='This addition clarifies the accounting treatment for contributions to Diminishing Musharaka. It emphasizes recognizing contributions at fair value, disclosing valuation methodologies, and addressing the difference between fair value and carrying amount. It aligns with AAOIFI standards and IFRS principles, specifically related to fair value measurement and disclosure.', section_id=\"Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting)\", change_type='addition'), ChangeRecord(old_text=\"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\", new_text=\"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\\n\\nFAS4.Musharaka.ACC2: The initial measurement of the Diminishing Musharaka investment by each partner should reflect the fair value of their respective contributions. Subsequent measurement should follow a method that reflects the nature of the underlying assets (e.g., real estate at fair value or cost less depreciation). The chosen method should be consistently applied and disclosed. Subsequent to initial recognition, the carrying amount of the Musharaka assets should be reviewed periodically for impairment in accordance with generally accepted accounting principles. Any impairment loss should be recognized in the income statement and allocated to the partners based on their current ownership percentages at the time of impairment, subject to Shariah approval. Upon a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd), the exiting partner's share shall be derecognized at its fair market value at the time of exit, as determined by the agreed-upon valuation method specified in the Musharaka agreement. Any difference between the carrying amount of the partner's share and the fair market value at exit shall be recognized as a profit or loss and allocated according to the agreed profit/loss sharing ratio. (ref: AAOIFI AS 3, paras 4.1, 4.2; IAS 40 (if real estate); IAS 36 (Impairment of Assets) - Conceptual Alignment for Impairment review.; AAOIFI AS 12, section 4/5; AAOIFI AS 1, paragraph 4.3.2)\", justification=\"This addition focuses on the subsequent measurement of Diminishing Musharaka investments and the accounting treatment of partner exits. It emphasizes fair value measurement, impairment reviews, and the recognition of profit or loss upon a partner's exit, aligning with AAOIFI standards, IAS 40, and IAS 36. It is directly relevant to the proposals concerning valuation methods and accounting for exits.\", section_id=\"Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period)\", change_type='addition'), ChangeRecord(old_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", new_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC3: Profit and loss sharing shall be accounted for based on the pre-agreed ratio stipulated in the Musharaka agreement. Profit distribution shall be recognized when the right to receive it is established. Losses shall be recognized immediately when they occur, and the carrying amount of the Musharaka investment shall be adjusted accordingly. The profit distribution mechanism shall be clearly defined in the Diminishing Musharaka agreement and shall reflect the changing ownership percentages of the partners. Profit shall be allocated based on the agreed ratio, considering capital contribution, effort, and other relevant factors as per the agreement. The accounting treatment for profit distribution should follow the substance of the agreement, ensuring that the allocation is Shariah-compliant and transparent. Any profit or loss arising from a partner's exit shall be allocated to the remaining partners and the exiting partner based on the pre-agreed profit and loss sharing ratio stipulated in the Diminishing Musharaka agreement. This allocation shall be consistently applied throughout the term of the Musharaka. The method used to determine the fair market value of the exiting partner’s share shall be disclosed. (ref: AAOIFI AS 3, para 5.1; AASB 101; AAOIFI AS 12 (Accounting for investment in Real Estate) Section 5.; AAOIFI AS 12, section 2/1; FAS 4, paragraph 25)\", justification='This addition addresses the accounting for profit and loss sharing in Diminishing Musharaka, emphasizing the pre-agreed ratio, Shariah compliance, and transparency. It clarifies the treatment of profit and loss arising from partner exits, and disclosing the method used to determine fair value. This aligns with AAOIFI standards, AASB 101, and FAS 4 principles.', section_id=\"Recognition of Bank's Share in Musharaka Profits or Losses\", change_type='addition'), ChangeRecord(old_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", new_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC4: When a partner exits the Diminishing Musharaka, the valuation of the partnership assets shall be determined based on the fair market value at the date of exit, as determined by an independent valuer or by the mechanism stipulated in the Musharaka agreement at inception. The exiting partner's share of the net assets, based on this valuation, shall be derecognized from the financial statements of the remaining partners. The exit of a partner from a Diminishing Musharaka shall be accounted for as a sale of the exiting partner's ownership interest to the remaining partner(s) or to a third party, as per the pre-agreed, Shariah-compliant exit mechanism defined in the Musharaka agreement. If Investment Sukuk are issued in connection with a Diminishing Musharaka, the accounting treatment of the Sukuk shall comply with AAOIFI Shariah Standard No. 23 on Investment Sukuk and any other relevant AAOIFI Accounting Standards related to Sukuk. The disclosures shall include the nature of the Sukuk, the underlying assets of the Musharaka, and the rights and obligations of the Sukuk holders. (ref: AAOIFI AS 3, para 5.2; IFRS 10 (Conceptual Alignment); AAOIFI AS 3 (Mudarabah Financing) para 4/8; AAOIFI AS 23; AAOIFI AS 11)\", justification=\"This addition describes the accounting treatment for a partner's exit from a Diminishing Musharaka, focusing on fair market valuation, derecognition of the exiting partner's share, and Shariah-compliant exit mechanisms. It also addresses Sukuk issuances in connection with Diminishing Musharaka, adhering to AAOIFI Shariah Standard No. 23. It directly reflects the need to provide clear and specific guidance on valuation methods and address the accounting treatment of profits/losses arising from exits.\", section_id=\"Recognition of Bank's Share in Musharaka Profits or Losses\", change_type='addition'), ChangeRecord(old_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", new_text=\"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC5: Any difference between the carrying amount of the exiting partner’s share and the consideration paid to them shall be recognized as a gain or loss in the profit or loss statement of the remaining partners. If the Diminishing Musharaka involves the gradual acquisition of the exiting partner's share by the IFI, each periodic purchase shall be treated as a separate acquisition of an asset. The final transfer of ownership in a Diminishing Musharaka shall be recognized when all conditions for the transfer, as outlined in the agreement, have been met. The remaining partner(s) shall recognize the acquired assets at the agreed-upon price or as determined by the Shariah-compliant mechanism outlined in the agreement. Any difference between the fair value of the assets acquired and the price paid should be appropriately accounted for, considering the nature of the transaction and Shariah requirements. Distributions to partners before the final liquidation of the Musharaka shall be accounted for as advance profit distributions. Upon a partner's exit, a reconciliation shall be performed to determine if any overpayment of profit has occurred. Any excess amount shall be treated as a liability to the partnership, unless the agreement stipulates that profit distributions made in good faith are not recoverable, provided that the independent valuation mechanism is robust and Shariah-compliant. (ref: AAOIFI AS 3, para 5.3; IFRS 10 (Conceptual Alignment); AAOIFI AS 12 (Accounting for investment in Real Estate) Section 6.; AAOIFI AS 3, para 4.3)\", justification='This addition details the accounting treatment for differences between the carrying amount and consideration paid to an exiting partner, addressing gradual acquisitions and the final transfer of ownership. It also covers the treatment of advance profit distributions and reconciliations upon exit. This provides specific guidance on accounting for profit/loss arising from exits and aligns with AAOIFI standards and IFRS principles.', section_id=\"Recognition of Bank's Share in Musharaka Profits or Losses\", change_type='addition')], key_changes_summary='FAS 4 has been updated to include detailed accounting guidance for Diminishing Musharaka (Shirkah al-ʿAqd) structures, especially concerning partner contributions and exits. The updates cover:\\n\\n*   **Partner Contributions:** Recognizing contributions at fair value and disclosing valuation methods.\\n*   **Profit and Loss Sharing:** Accounting based on pre-agreed ratios and Shariah compliance.\\n*   **Partner Exits:** Fair market valuation, derecognition of shares, and profit/loss allocation.\\n*   **Sukuk Compliance:** Adherence to AAOIFI Shariah Standards No. 12 and 23.\\n*   **Disclosures:** Comprehensive disclosure requirements for transparency.\\n* **Shariah compliace:** Shariah-specific clauses governing Diminishing Musharaka to ensure compliance with shariah principles\\n\\nThese changes address gaps in the previous FAS 4, providing clearer and more consistent accounting practices aligned with AAOIFI standards and Shariah principles.', change_statistics={'additions': 8, 'deletions': 0, 'modifications': 1}), 'change_summary': \"We've updated FAS 4 to include guidance on how to account for Diminishing Musharaka (Shirkah al-ʿAqd) structures, especially concerning partner contributions and exits, which were previously not well-defined. These changes are important because Diminishing Musharaka is increasingly used in real estate funds.\\n\\nHere's what's new:\\n\\n*   **Partner Contributions:** Each partner's initial contribution (whether cash, assets, or usufruct) must be recognized at fair value, determined by an independent valuer or agreed-upon valuation method. The nature of the contribution must also be disclosed.\\n*   **Profit and Loss Sharing:** The profit and loss sharing ratio must be agreed upon upfront and clearly stated in the Musharaka agreement. Profit distribution should happen periodically as agreed.\\n*   **Partner Exits:** When a partner exits, the value of partnership assets should be based on a fair market valuation by an independent valuer or a mechanism agreed to at the start. The exiting partner gets their share based on this valuation, minus liabilities. Any profit or loss from the exit is shared according to the agreed profit/loss ratio.\\n*   **Gradual Acquisition:** The agreement must detail how the Islamic Financial Institution (IFI) gradually buys the partner's share, complying with Shariah principles.\\n*   **Advance Profit Distribution:** Profits given to partners before the final liquidation are treated as advance distributions and reconciled upon exit.\\n*   **Sukuk Compliance:** If Sukuk are involved, they must comply with AAOIFI Shariah Standards No. 12 and 23.\\n*   **Disclosures:** Full transparency is key. The nature and terms of the Musharaka, profit/loss sharing ratio, valuation methods, restrictions on ownership transfer, dispute resolution, and the carrying amount of the investment need to be disclosed.\\n*   **Dispute Resolution:** Mechanisms for resolving disputes should be clearly stated, favoring amicable solutions following Shariah principles.\\n\\nThese changes ensure that accounting for Diminishing Musharaka is Shariah-compliant, transparent, and consistent with AAOIFI standards. They clarify how to handle partner contributions, exits, and profit/loss sharing, addressing the gaps in the previous FAS 4.\", 'reasoning_trace': {'fas_gaps': {'overall_verdict': {'fas_to_update': ['fas_4', 'fas_8', 'fas_16', 'fas_7', 'fas_10', 'fas_28', 'fas_32'], 'need_new_fas': False, 'overall_justification': 'The analyses indicate a significant gap in the existing FAS regarding the treatment of partner contributions and exits in diminishing Musharaka structures. All relevant FAS identified share this gap, necessitating updates to provide clear guidance.', 'overall_chain_of_thought': '1. Reviewed multiple FAS analyses regarding diminishing Musharaka. 2. Identified a consistent gap across all analyses related to partner contributions and exits. 3. Concluded that the existing FAS do not adequately address these issues. 4. Determined that updating the existing FAS is necessary to provide clarity and consistency in accounting practices.', 'overall_referenced_gaps': ['FAS 4 does not provide guidance on the treatment of partner contributions and exits in diminishing Musharaka structures.', 'Lack of coverage for shirkah al-ʿaqd structures in FAS 4 leads to ambiguity.'], 'overall_referenced_similarities': []}, 'updated_fas_details': [{'fas_id': 'fas_4', 'justification': 'FAS 4 lacks guidance on the treatment of partner contributions and exits in diminishing Musharaka structures, which is critical for accurate financial reporting.', 'chain_of_thought': '1. Identified the absence of specific guidance in FAS 4 regarding diminishing Musharaka. 2. Noted the implications for partner contributions and exits. 3. Concluded that this gap necessitates an update to FAS 4.', 'referenced_gaps': ['FAS 4 does not provide guidance on the treatment of partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_8', 'justification': 'Similar to FAS 4, FAS 8 does not adequately address the treatment of partner contributions and exits in diminishing Musharaka structures.', 'chain_of_thought': '1. Analyzed the context and identified the same gap as in FAS 4. 2. Concluded that FAS 8 also requires an update to address these issues.', 'referenced_gaps': ['FAS 4 does not adequately address the treatment of partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_16', 'justification': 'FAS 16 also lacks guidance on diminishing Musharaka structures, particularly regarding partner contributions and exits.', 'chain_of_thought': '1. Reviewed the analysis and noted the same gap present in FAS 4. 2. Concluded that FAS 16 needs to be updated to provide necessary guidance.', 'referenced_gaps': ['The context indicates a lack of coverage in FAS 4 regarding the treatment of partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_7', 'justification': 'FAS 7 does not address the treatment of partner contributions and exits in diminishing Musharaka structures, creating ambiguity.', 'chain_of_thought': '1. Identified the same gap in FAS 7 as in previous analyses. 2. Concluded that an update is necessary for clarity.', 'referenced_gaps': ['FAS 4 does not address the treatment of partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_10', 'justification': 'FAS 10 lacks specific guidance on diminishing Musharaka structures, particularly for partner contributions and exits.', 'chain_of_thought': '1. Analyzed the context and identified the same gap as in FAS 4. 2. Concluded that FAS 10 requires an update.', 'referenced_gaps': ['FAS 4 lacks specific guidance on the treatment of partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_28', 'justification': 'FAS 28 does not provide guidance on partner contributions and exits in diminishing Musharaka structures, leading to ambiguity.', 'chain_of_thought': '1. Noted the same gaps present in FAS 4. 2. Concluded that FAS 28 needs to be updated.', 'referenced_gaps': ['FAS 4 lacks guidance on the treatment of partner contributions in diminishing Musharaka structures.'], 'referenced_similarities': []}, {'fas_id': 'fas_32', 'justification': 'FAS 32 fails to address the specific accounting treatment for partner contributions and exits in diminishing Musharaka structures.', 'chain_of_thought': '1. Identified the same gap as in FAS 4. 2. Concluded that FAS 32 requires an update to provide necessary guidance.', 'referenced_gaps': ['FAS 4 does not address the specific accounting treatment for partner contributions and exits in diminishing Musharaka structures.'], 'referenced_similarities': []}], 'new_fas_details': None}, 'board_proposals': [{'llm': 'gemini', 'content': {'shariah_solution': \"To address the gap in FAS 4 regarding partner contributions and exits in diminishing Musharaka structures (specifically Shirkah al-ʿAqd), the following principles should be applied: All contributions should be valued according to market value at the time of the contribution or fair valuation assessed by an independent valuer accepted to all partners. Contributions can be in the form of cash, assets, or usufruct. Partner exits should adhere to the agreed-upon terms within the Musharaka contract and be valued at fair market value at the time of exit. The agreement should specify the method of valuation, dispute resolution mechanisms, and any restrictions on transfer of ownership. Any profit or loss realized upon the partner's exit shall be distributed according to the agreed profit/loss sharing ratio. Furthermore, the Diminishing Musharaka agreement must comply with AAOIFI Shariah Standard No. 12 regarding Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 on Investment Sukuk if Sukuk are issued in connection with the Musharaka.\", 'updated_shariah_clauses': [{'clause_id': 'FAS4.SH1', 'text': 'Partner contributions in a Diminishing Musharaka (Shirkah al-ʿAqd) shall be valued at fair market value at the time of contribution, as determined by an independent valuer acceptable to all partners, or at the market value if available. Contributions may be in the form of cash, assets (including real estate), or usufruct, provided such contribution is permissible according to Shariah principles.', 'reference': 'AAOIFI Shariah Standard 12, section 3/1'}, {'clause_id': 'FAS4.SH2', 'text': \"The terms governing a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) must be clearly defined within the Musharaka agreement. The exit value shall be determined based on the fair market value of the partner's share at the time of exit, subject to the agreed-upon valuation method. The agreement should also specify mechanisms for dispute resolution and any restrictions on transfer of ownership.\", 'reference': 'AAOIFI Shariah Standard 12, section 4/5'}, {'clause_id': 'FAS4.SH3', 'text': \"Any profit or loss arising from a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) shall be distributed among the remaining partners and the exiting partner according to the agreed-upon profit and loss sharing ratio stipulated in the Musharaka agreement. This distribution must comply with Shariah principles governing profit sharing in Musharaka contracts.\", 'reference': 'AAOIFI Shariah Standard 12, section 2/1'}, {'clause_id': 'FAS4.SH4', 'text': 'Diminishing Musharaka agreements and any associated Sukuk issuances must fully comply with the stipulations outlined in AAOIFI Shariah Standard No. 12 concerning Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 pertaining to Investment Sukuk.', 'reference': 'AAOIFI Shariah Standard 12 and 23'}], 'accounting_rationale': \"The proposed accounting clauses aim to provide specific guidance for accounting for partner contributions and exits in Diminishing Musharaka (Shirkah al-ʿAqd) structures, which are currently not explicitly addressed in FAS 4. The rules are designed to be Shariah-compliant, consistent with existing AAOIFI standards, and practically applicable for IFIs. Clause FAS4.Musharaka.ACC1 ensures that initial contributions are recognized at fair market value, aligning with the principle of 'adl (justice) in Islamic finance. This clause considers different forms of contributions (cash, assets, or usufruct), specifying valuation requirements for each. It is based on AAOIFI AS 12, section 3/1, which discusses contributions in Musharaka and AAOIFI AS 1 that provides a framework to deal with this kind of issue. Clause FAS4.Musharaka.ACC2 addresses the accounting treatment upon a partner's exit, requiring derecognition at fair market value and recognition of any profit or loss arising from the exit. This is aligned with AAOIFI AS 12, section 4/5, and aims to reflect the economic substance of the transaction. Clause FAS4.Musharaka.ACC3 focuses on the allocation of profit or loss resulting from a partner's exit. The allocation must be based on the pre-agreed profit and loss sharing ratio, which aligns with the principle of risk and reward sharing in Islamic finance. It also considers FAS 4 paragraph 25 which covers the accounting for profits in partnerships. Clause FAS4.Musharaka.ACC4 addresses situations where Investment Sukuk are issued in connection with a Diminishing Musharaka. It mandates compliance with AAOIFI Shariah Standard No. 23 and other relevant AAOIFI Accounting Standards, ensuring consistent accounting treatment for Sukuk. Clause FAS4.Musharaka.ACC5 specifies the disclosure requirements for Diminishing Musharaka agreements, including details about the profit and loss sharing ratio, valuation methods, restrictions on transfer of ownership, dispute resolution mechanisms, carrying amount of the investment, significant assumptions used in fair value determination, and the nature of assets contributed. These disclosures are important for providing transparency and enabling users of financial statements to understand the risks and returns associated with Diminishing Musharaka investments and aligns with the general disclosure principles in FAS 4 and AAOIFI AS 1. The suggested additions align with the user's requirements in that they are accounting rules for Diminishing Musharaka structures, which are a type of Shirkah al-ʿAqd, and detail the accounting for partner contributions and exits.\", 'updated_accounting_clauses': [{'clause_id': 'FAS4.Musharaka.ACC1', 'text': 'Initial contributions to a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at fair market value at the time of contribution. If the contribution is in the form of cash, the amount of cash contributed shall be its fair market value. If the contribution is in the form of assets, including real estate or usufruct, an independent valuation, acceptable to all partners, shall be obtained to determine the fair market value. The nature of the contribution (cash, asset, or usufruct) shall be disclosed.', 'reference': 'AAOIFI AS 12, section 3/1; AAOIFI AS 1, paragraphs 4.2.3, 4.2.4'}, {'clause_id': 'FAS4.Musharaka.ACC2', 'text': \"Upon a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd), the exiting partner's share shall be derecognized at its fair market value at the time of exit, as determined by the agreed-upon valuation method specified in the Musharaka agreement. Any difference between the carrying amount of the partner's share and the fair market value at exit shall be recognized as a profit or loss and allocated according to the agreed profit/loss sharing ratio.\", 'reference': 'AAOIFI AS 12, section 4/5; AAOIFI AS 1, paragraph 4.3.2'}, {'clause_id': 'FAS4.Musharaka.ACC3', 'text': \"Any profit or loss arising from a partner's exit shall be allocated to the remaining partners and the exiting partner based on the pre-agreed profit and loss sharing ratio stipulated in the Diminishing Musharaka agreement. This allocation shall be consistently applied throughout the term of the Musharaka. The method used to determine the fair market value of the exiting partner’s share shall be disclosed.\", 'reference': 'AAOIFI AS 12, section 2/1; FAS 4, paragraph 25'}, {'clause_id': 'FAS4.Musharaka.ACC4', 'text': 'If Investment Sukuk are issued in connection with a Diminishing Musharaka, the accounting treatment of the Sukuk shall comply with AAOIFI Shariah Standard No. 23 on Investment Sukuk and any other relevant AAOIFI Accounting Standards related to Sukuk. The disclosures shall include the nature of the Sukuk, the underlying assets of the Musharaka, and the rights and obligations of the Sukuk holders.', 'reference': 'AAOIFI AS 23; AAOIFI AS 11'}, {'clause_id': 'FAS4.Musharaka.ACC5', 'text': 'Islamic Financial Institutions shall disclose the nature and terms of the Diminishing Musharaka (Shirkah al-ʿAqd) agreements, including: a) The profit and loss sharing ratio; b) The valuation method used for contributions and exits; c) Any restrictions on transfer of ownership; d) Dispute resolution mechanisms; e) The carrying amount of the Musharaka investment; f) Significant assumptions used in determining fair value; g) The nature of assets contributed (cash, real estate, or usufruct).', 'reference': 'FAS 4, paragraph 49; AAOIFI AS 1, paragraph 5'}], 'references': ['AAOIFI AS 23', 'AAOIFI Shariah Standard 12', 'AAOIFI Shariah Standard 23', 'AAOIFI AS 12', 'AAOIFI AS 1', 'AAOIFI AS 11', 'FAS 4']}}, {'llm': 'gpt', 'content': {'shariah_solution': 'To address the gap in FAS 4 regarding the treatment of partner contributions and exits in diminishing Musharaka structures, specifically Shirkah al-ʿAqd, the following principles and clauses should be incorporated. These clauses clarify the rights and obligations of partners regarding contributions, valuations, and exit strategies, ensuring compliance with Shariah principles of fairness, transparency, and avoidance of riba. The proposed solution clarifies the process of profit distribution, asset valuation at the time of exit, and mechanisms for handling disputes, all within the framework of Shariah-compliant partnership.', 'updated_shariah_clauses': [{'clause_id': 'FAS4.SH1', 'text': \"Upon the establishment of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution shall be clearly defined in terms of its monetary value or its equivalent in assets. The nature and valuation method of non-monetary contributions must be documented and agreed upon by all partners at the outset.\", 'reference': 'AAOIFI Shariah Standard 12, Clause 3/1'}, {'clause_id': 'FAS4.SH2', 'text': 'The profit and loss sharing ratio must be determined and agreed upon by all partners at the beginning of the Musharaka. This ratio need not be equal to the capital contribution ratio and must be clearly stated in the Musharaka agreement. The distribution of profit should occur periodically as agreed by all partners.', 'reference': 'AAOIFI Shariah Standard 12, Clause 4/1'}, {'clause_id': 'FAS4.SH3', 'text': \"In the event of a partner's exit from the Diminishing Musharaka, the value of the partnership assets shall be determined based on a fair market valuation conducted by an independent valuer acceptable to all partners, or by a mechanism detailed in the shirkah al-'aqd agreement and agreed to by all partners at inception. The exiting partner is entitled to their share of the asset based on this valuation, minus any outstanding liabilities.\", 'reference': 'AAOIFI Shariah Standard 12, Clause 5/2'}, {'clause_id': 'FAS4.SH4', 'text': \"The Diminishing Musharaka agreement should explicitly detail the process by which the Islamic Financial Institution (IFI) gradually acquires the partner's share of the asset. This process must adhere to Shariah principles, typically involving periodic purchases of portions of the partner's share, ultimately leading to the IFI's full ownership.\", 'reference': 'AAOIFI Shariah Standard 12, Clause 3/4'}, {'clause_id': 'FAS4.SH5', 'text': 'Any profits distributed to partners prior to the final liquidation of the Musharaka should be treated as advance profit distribution and will be reconciled against the final valuation upon exit. If the final valuation reveals an overpayment of profit, the exiting partner must return the excess amount unless it is otherwise specified in the agreement that any profit distribution made in good faith will not need to be returned. Such a condition should only be applied if the mechanism for independent valuation is robust and acceptable from a Shariah perspective.', 'reference': 'AAOIFI Shariah Standard 12, Clause 4/3'}, {'clause_id': 'FAS4.SH6', 'text': 'The agreement shall clearly stipulate the mechanisms for resolving disputes among partners, giving preference to amicable solutions through mediation or arbitration in accordance with Shariah principles. It is permissible to agree that any disputes will be settled through a Shariah compliant arbitration center.', 'reference': 'Principles of Sulh (Reconciliation) in Islamic Jurisprudence'}], 'accounting_rationale': \"The proposed accounting clauses aim to address the accounting gaps in FAS 4 regarding Diminishing Musharaka (Shirkah al-ʿAqd) structures, specifically focusing on partner contributions and exits. These clauses are based on Shariah principles of fairness, transparency, and avoidance of riba, as outlined in the provided Shariah update and AAOIFI Shariah Standard 12. \\n\\n*   **FAS4.Musharaka.ACC1** addresses the initial recognition of partner contributions, emphasizing fair value measurement, and providing guidance on in-kind contributions. This aligns with AAOIFI AS 3, paragraph 3.2, and conceptually aligns with IFRS 3 (Business Combinations) regarding the valuation of assets contributed to a joint venture. It is a critical addition as FAS 4 did not specify how the initial contributions should be valued and recorded.\\n*   **FAS4.Musharaka.ACC2** provides guidance on the subsequent measurement of the Diminishing Musharaka investment, ensuring consistency and disclosure of the chosen method. It aligns with AAOIFI AS 3, paragraphs 4.1 and 4.2, and IAS 40 (Investment Property) if the underlying asset is real estate. FAS 4 lacked specifications on subsequent measurements, leaving room for inconsistent applications.\\n*   **FAS4.Musharaka.ACC3** details the accounting for profit and loss sharing based on the pre-agreed ratio, in line with AAOIFI AS 3, paragraph 5.1, and AASB 101 (Presentation of Financial Statements). FAS 4 needed a clearer treatment for profit sharing in these structures.\\n*   **FAS4.Musharaka.ACC4** focuses on the accounting treatment when a partner exits the Musharaka, emphasizing fair market valuation and derecognition of the exiting partner's share, consistent with AAOIFI AS 3, paragraph 5.2, and IFRS 10 (Consolidated Financial Statements) for conceptual alignment on derecognition.\\n*   **FAS4.Musharaka.ACC5** clarifies the recognition of gains or losses arising from a partner's exit and the treatment of gradual acquisitions, based on AAOIFI AS 3, paragraph 5.3, and IFRS 10 (Consolidated Financial Statements) conceptually.\\n*   **FAS4.Musharaka.ACC6** addresses the accounting for advance profit distributions and the reconciliation process upon a partner's exit, drawing from AAOIFI AS 3, paragraph 4.3. Without this, it would be unclear how to handle interim profit distributions.\\n*   **FAS4.Musharaka.ACC7** mandates specific disclosures related to the Diminishing Musharaka, ensuring transparency in financial reporting, aligning with AAOIFI AS 1, paragraph 3.1.\\n*   **FAS4.Musharaka.ACC8** requires disclosure of disputes and their resolution mechanisms, enhancing transparency, and based on AAOIFI AS 1, paragraph 3.2.\\n\\nThese clauses provide practical guidance for IFIs and address the user's concern about the lack of coverage for Shirkah al-ʿAqd structures in FAS 4. The rationale for each clause explicitly links the accounting treatment to the Shariah principles and the need for consistency with existing accounting frameworks. Practical considerations for IFIs are also addressed, ensuring the applicability of the proposed rules.\", 'updated_accounting_clauses': [{'clause_id': 'FAS4.Musharaka.ACC1', 'text': \"Upon the commencement of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution, whether monetary or in-kind, shall be recognized at fair value. In-kind contributions shall be independently valued at the date of contribution, with the valuation methodology disclosed in the financial statements. The difference between the fair value and the carrying amount (if any) of in-kind contributions from the perspective of the contributor should be treated according to existing accounting standards applicable to the contributor. The Islamic Financial Institution (IFI) shall record its share of the Musharaka assets based on its contribution ratio.\", 'reference': 'AAOIFI AS 3, para 3.2; IFRS 3 (Conceptual Alignment)'}, {'clause_id': 'FAS4.Musharaka.ACC2', 'text': 'The initial measurement of the Diminishing Musharaka investment by each partner should reflect the fair value of their respective contributions. Subsequent measurement should follow a method that reflects the nature of the underlying assets (e.g., real estate at fair value or cost less depreciation). The chosen method should be consistently applied and disclosed.', 'reference': 'AAOIFI AS 3, paras 4.1, 4.2; IAS 40 (if real estate)'}, {'clause_id': 'FAS4.Musharaka.ACC3', 'text': 'Profit and loss sharing shall be accounted for based on the pre-agreed ratio stipulated in the Musharaka agreement. Profit distribution shall be recognized when the right to receive it is established. Losses shall be recognized immediately when they occur, and the carrying amount of the Musharaka investment shall be adjusted accordingly.', 'reference': 'AAOIFI AS 3, para 5.1; AASB 101'}, {'clause_id': 'FAS4.Musharaka.ACC4', 'text': \"When a partner exits the Diminishing Musharaka, the valuation of the partnership assets shall be determined based on the fair market value at the date of exit, as determined by an independent valuer or by the mechanism stipulated in the Musharaka agreement at inception. The exiting partner's share of the net assets, based on this valuation, shall be derecognized from the financial statements of the remaining partners.\", 'reference': 'AAOIFI AS 3, para 5.2; IFRS 10 (Conceptual Alignment)'}, {'clause_id': 'FAS4.Musharaka.ACC5', 'text': \"Any difference between the carrying amount of the exiting partner’s share and the consideration paid to them shall be recognized as a gain or loss in the profit or loss statement of the remaining partners. If the Diminishing Musharaka involves the gradual acquisition of the exiting partner's share by the IFI, each periodic purchase shall be treated as a separate acquisition of an asset.\", 'reference': 'AAOIFI AS 3, para 5.3; IFRS 10 (Conceptual Alignment)'}, {'clause_id': 'FAS4.Musharaka.ACC6', 'text': \"Distributions to partners before the final liquidation of the Musharaka shall be accounted for as advance profit distributions. Upon a partner's exit, a reconciliation shall be performed to determine if any overpayment of profit has occurred. Any excess amount shall be treated as a liability to the partnership, unless the agreement stipulates that profit distributions made in good faith are not recoverable, provided that the independent valuation mechanism is robust and Shariah-compliant.\", 'reference': 'AAOIFI AS 3, para 4.3'}, {'clause_id': 'FAS4.Musharaka.ACC7', 'text': 'The financial statements shall disclose the nature of the Diminishing Musharaka, including the profit and loss sharing ratio, the valuation methodology for in-kind contributions, the mechanism for asset valuation upon exit, the policy for profit distribution, and any significant assumptions used in determining fair values.', 'reference': 'AAOIFI AS 1, para 3.1'}, {'clause_id': 'FAS4.Musharaka.ACC8', 'text': 'Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for.', 'reference': 'AAOIFI AS 1, para 3.2'}], 'references': ['IFRS 3 (Business Combinations) - Conceptual Alignment', 'AAOIFI Shariah Standard 12', 'IAS 40 (Investment Property)', 'AAOIFI AS 1 (Presentation and Disclosure in Financial Statements of Islamic Financial Institutions)', 'AAOIFI Shariah Standard 12 (Sharika (Musharaka) and Modern Applications)', 'AASB 101 (Presentation of Financial Statements)', 'AAOIFI AS 3 (Investments)', 'Principles of Sulh (Reconciliation) in Islamic Jurisprudence', 'IFRS 10 (Consolidated Financial Statements) - Conceptual Alignment', 'FAS 4']}}, {'llm': 'deepseek', 'content': {'shariah_solution': 'To address the gap in FAS 4 regarding the treatment of partner contributions and exits in diminishing Musharaka (specifically Shirkah al-ʿAqd) structures, the following principles should be applied. Partner contributions should be valued at fair market value at the time of contribution. Exits should be governed by a pre-agreed mechanism that ensures fairness and avoids Gharar (uncertainty) and riba (interest). The diminishing nature of the Musharaka should be reflected in the profit distribution and asset transfer mechanism, and the final transfer of ownership should comply with Shariah principles. The solution also emphasizes transparency and full disclosure to all partners regarding valuation and exit mechanisms.', 'updated_shariah_clauses': [{'clause_id': 'FAS4.SH1', 'text': 'Partner contributions in a diminishing Musharaka (Shirkah al-ʿAqd) shall be valued at their fair market value at the time of the initial contribution, as determined by a mutually agreed upon and Shariah-compliant valuation method. Any appreciation or depreciation in value from the contribution date until the reporting date should be reflected in the financial statements, subject to Shariah approval.', 'reference': 'AAOIFI Shariah Standard 12 (Musharaka) and general principles of fair valuation in Islamic finance'}, {'clause_id': 'FAS4.SH2', 'text': 'The agreement governing the diminishing Musharaka shall clearly define the mechanism for partner exits, ensuring that the exit price is determined based on a pre-agreed, Shariah-compliant methodology that mitigates Gharar (uncertainty) and avoids any element of riba (interest). This may include periodic valuations, profit-sharing arrangements, or other Shariah-approved methods.', 'reference': 'AAOIFI Shariah Standard 12 (Musharaka) and principles of Gharar avoidance.'}, {'clause_id': 'FAS4.SH3', 'text': 'The profit distribution mechanism in a diminishing Musharaka shall reflect the changing ownership percentages of the partners as the Musharaka diminishes. The method must be clearly defined in the agreement and be Shariah-compliant. Profit allocation should be based on the agreed ratio, taking into consideration the capital contribution and efforts of each partner.', 'reference': 'AAOIFI Shariah Standard 12 (Musharaka) and principles of profit and loss sharing in Islamic finance'}, {'clause_id': 'FAS4.SH4', 'text': 'The final transfer of ownership to the remaining partner(s) in a diminishing Musharaka shall be structured as a sale transaction at an agreed-upon price or through a mechanism compliant with Shariah principles. The method of transfer must be explicitly outlined in the agreement.', 'reference': \"AAOIFI Shariah Standard 12 (Musharaka) and principles of Bay' (Sale) in Islamic finance.\"}, {'clause_id': 'FAS4.SH5', 'text': 'Full disclosure of the valuation methodologies used for partner contributions and exits, as well as the profit distribution mechanism, shall be provided to all partners to ensure transparency and mitigate potential disputes.', 'reference': 'General principles of transparency and fairness in Islamic finance contracts'}], 'accounting_rationale': \"The proposed accounting clauses address the accounting gaps in FAS 4 related to Diminishing Musharaka (Shirkah al-ʿAqd) structures, specifically concerning partner contributions and exits. \\n\\n*   **FAS4.Musharaka.ACC1:** This clause directly implements the Shariah principle of valuing contributions at fair market value (FAS4.SH1). This aligns with AAOIFI AS 2, which emphasizes fair valuation in Murabaha and provides a basis for determining the initial carrying amount. The adjustment to partners' capital accounts ensures consistency with partnership accounting principles while adhering to Shariah requirements.\\n*   **FAS4.Musharaka.ACC2:** While not directly mandated by Shariah, this clause reflects the need for prudence and asset valuation in Islamic finance. Aligning conceptually with IAS 36, this rule ensures impairment losses are recognized and allocated based on ownership percentages, reflecting the diminishing nature of the Musharaka and the changing risk profile of each partner.\\n*   **FAS4.Musharaka.ACC3:** This clause implements the Shariah principle of profit distribution based on the agreed ratio (FAS4.SH3). It provides that the accounting treatment aligns with the agreement and emphasizes transparency, consistent with both Shariah and general accounting principles. It aligns with AAOIFI AS 12 by ensuring appropriate accounting for the agreed profit-sharing arrangements in the real estate fund.\\n*   **FAS4.Musharaka.ACC4:** This clause addresses the accounting treatment for partner exits (FAS4.SH2). It aligns with the Shariah principle of structuring exits as sales transactions to avoid Gharar and Riba. AAOIFI AS 3 provides a suitable model for accounting for the sale of ownership interests.\\n*   **FAS4.Musharaka.ACC5:** This clause covers the final transfer of ownership (FAS4.SH4). It ensures that the assets are recognized at the agreed-upon price, aligning with the sale transaction principles. AAOIFI AS 12 provides guidance on accounting for the final transfer in Real Estate investments.\\n*   **FAS4.Musharaka.ACC6:** This clause emphasizes transparency and disclosure, consistent with Shariah principles and AAOIFI AS 1 (FAS4.SH5). Comprehensive disclosures are required to provide users of financial statements with a clear understanding of the Musharaka arrangement.\\n\\nThese proposed rules are practically applicable for IFIs as they provide a clear framework for accounting for Diminishing Musharaka structures, consistent with both Shariah principles and established accounting standards.\", 'updated_accounting_clauses': [{'clause_id': 'FAS4.Musharaka.ACC1', 'text': \"Initial contributions by partners in a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at their fair market value at the date of contribution. The fair market value should be determined using a mutually agreed-upon and Shariah-compliant valuation method. Any difference between the carrying amount of assets contributed and their fair market value at the time of contribution shall be recognized as an adjustment to the partners' capital accounts, consistent with the agreed profit and loss sharing ratio and subject to Shariah supervisory board approval.\", 'reference': 'AAOIFI AS 2 (Murabaha Financing) para 3/6 , AAOIFI Shariah Standard 12 (Musharaka)'}, {'clause_id': 'FAS4.Musharaka.ACC2', 'text': 'Subsequent to initial recognition, the carrying amount of the Musharaka assets should be reviewed periodically for impairment in accordance with generally accepted accounting principles. Any impairment loss should be recognized in the income statement and allocated to the partners based on their current ownership percentages at the time of impairment, subject to Shariah approval.', 'reference': 'IAS 36 (Impairment of Assets) - Conceptual Alignment for Impairment review.'}, {'clause_id': 'FAS4.Musharaka.ACC3', 'text': 'The profit distribution mechanism shall be clearly defined in the Diminishing Musharaka agreement and shall reflect the changing ownership percentages of the partners. Profit shall be allocated based on the agreed ratio, considering capital contribution, effort, and other relevant factors as per the agreement. The accounting treatment for profit distribution should follow the substance of the agreement, ensuring that the allocation is Shariah-compliant and transparent.', 'reference': 'AAOIFI AS 12 (Accounting for investment in Real Estate) Section 5.'}, {'clause_id': 'FAS4.Musharaka.ACC4', 'text': \"The exit of a partner from a Diminishing Musharaka shall be accounted for as a sale of the exiting partner's ownership interest to the remaining partner(s) or to a third party, as per the pre-agreed, Shariah-compliant exit mechanism defined in the Musharaka agreement. The difference between the consideration received by the exiting partner and the carrying amount of their ownership interest shall be recognized as a gain or loss in the income statement of the exiting partner. For the remaining partner(s), the acquisition of the exiting partner's share shall be accounted for as an increase in their capital account, at the price paid.\", 'reference': 'AAOIFI AS 3 (Mudarabah Financing) para 4/8'}, {'clause_id': 'FAS4.Musharaka.ACC5', 'text': 'The final transfer of ownership in a Diminishing Musharaka shall be recognized when all conditions for the transfer, as outlined in the agreement, have been met. The remaining partner(s) shall recognize the acquired assets at the agreed-upon price or as determined by the Shariah-compliant mechanism outlined in the agreement. Any difference between the fair value of the assets acquired and the price paid should be appropriately accounted for, considering the nature of the transaction and Shariah requirements.', 'reference': 'AAOIFI AS 12 (Accounting for investment in Real Estate) Section 6.'}, {'clause_id': 'FAS4.Musharaka.ACC6', 'text': 'Comprehensive disclosures regarding the Diminishing Musharaka shall be provided in the financial statements, including: (a) The nature and purpose of the Musharaka; (b) The terms of the Musharaka agreement, including the profit distribution mechanism and the exit mechanism; (c) The fair market value of the initial contributions and the valuation methods used; (d) The carrying amount of the Musharaka assets; (e) The ownership percentages of the partners; (f) Any significant events or transactions related to the Musharaka, such as impairments or partner exits.', 'reference': 'AAOIFI AS 1 (General Presentation and Disclosure) Section 7'}], 'references': ['Principles of Gharar avoidance.', 'General principles of fair valuation in Islamic finance', 'IAS 36 (Impairment of Assets)', 'AAOIFI AS 3 (Mudarabah Financing)', 'AAOIFI Shariah Standard 12 (Musharaka)', 'General principles of transparency and fairness in Islamic finance contracts', 'AAOIFI AS 2 (Murabaha Financing)', 'AAOIFI AS 12 (Accounting for investment in Real Estate)', 'Principles of profit and loss sharing in Islamic finance', \"Principles of Bay' (Sale) in Islamic finance\", 'AAOIFI AS 1 (General Presentation and Disclosure)']}}], 'change_summary': \"We've updated FAS 4 to include guidance on how to account for Diminishing Musharaka (Shirkah al-ʿAqd) structures, especially concerning partner contributions and exits, which were previously not well-defined. These changes are important because Diminishing Musharaka is increasingly used in real estate funds.\\n\\nHere's what's new:\\n\\n*   **Partner Contributions:** Each partner's initial contribution (whether cash, assets, or usufruct) must be recognized at fair value, determined by an independent valuer or agreed-upon valuation method. The nature of the contribution must also be disclosed.\\n*   **Profit and Loss Sharing:** The profit and loss sharing ratio must be agreed upon upfront and clearly stated in the Musharaka agreement. Profit distribution should happen periodically as agreed.\\n*   **Partner Exits:** When a partner exits, the value of partnership assets should be based on a fair market valuation by an independent valuer or a mechanism agreed to at the start. The exiting partner gets their share based on this valuation, minus liabilities. Any profit or loss from the exit is shared according to the agreed profit/loss ratio.\\n*   **Gradual Acquisition:** The agreement must detail how the Islamic Financial Institution (IFI) gradually buys the partner's share, complying with Shariah principles.\\n*   **Advance Profit Distribution:** Profits given to partners before the final liquidation are treated as advance distributions and reconciled upon exit.\\n*   **Sukuk Compliance:** If Sukuk are involved, they must comply with AAOIFI Shariah Standards No. 12 and 23.\\n*   **Disclosures:** Full transparency is key. The nature and terms of the Musharaka, profit/loss sharing ratio, valuation methods, restrictions on ownership transfer, dispute resolution, and the carrying amount of the investment need to be disclosed.\\n*   **Dispute Resolution:** Mechanisms for resolving disputes should be clearly stated, favoring amicable solutions following Shariah principles.\\n\\nThese changes ensure that accounting for Diminishing Musharaka is Shariah-compliant, transparent, and consistent with AAOIFI standards. They clarify how to handle partner contributions, exits, and profit/loss sharing, addressing the gaps in the previous FAS 4.\", 'fas_diff': {'changes': [{'old_paragraph': '## Scope of the Standard', 'new_paragraph': \"## Scope of the Standard\\n\\n*   **Applies to:**\\n    1.  Musharaka financing transactions by Islamic banks.\\n    2.  **Constant Musharaka** (where capital shares remain constant).\\n    3.  **Diminishing Musharaka** (where the bank's share is gradually transferred to the other partner).\\n    4.  Transactions regardless of whether the bank's share is financed from its own funds, commingled unrestricted investment accounts, or restricted investment accounts.\\n    5.  The Islamic bank's share in Musharaka profits or losses.\", 'justification': 'This addition introduces a structured list specifying what the accounting standard *applies to* in relation to Musharaka financing, including Constant and Diminishing Musharaka. This ensures greater clarity and granularity in defining the scope, derived from the proposal to address the gaps in accounting for Diminishing Musharaka.', 'section': 'Scope of the Standard', 'type': 'modification'}, {'old_paragraph': \"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\", 'new_paragraph': \"*Note: If the standard's requirements contradict the Islamic bank's charter or local laws, this contradiction should be disclosed.*\\n\\nFAS4.SH1: Upon the establishment of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution shall be clearly defined in terms of its monetary value or its equivalent in assets and shall be valued at their fair market value at the time of the initial contribution, as determined by a mutually agreed upon and Shariah-compliant valuation method, as determined by an independent valuer acceptable to all partners, or at the market value if available. The nature and valuation method of non-monetary contributions must be documented and agreed upon by all partners at the outset. Contributions may be in the form of cash, assets (including real estate), or usufruct, provided such contribution is permissible according to Shariah principles. Any appreciation or depreciation in value from the contribution date until the reporting date should be reflected in the financial statements, subject to Shariah approval. (ref: AAOIFI Shariah Standard 12, Clause 3/1; AAOIFI Shariah Standard 12 (Musharaka) and general principles of fair valuation in Islamic finance)\\n\\nFAS4.SH2: The profit and loss sharing ratio must be determined and agreed upon by all partners at the beginning of the Musharaka. This ratio need not be equal to the capital contribution ratio and must be clearly stated in the Musharaka agreement. The distribution of profit should occur periodically as agreed by all partners. The agreement governing the diminishing Musharaka shall clearly define the mechanism for partner exits, ensuring that the exit price is determined based on a pre-agreed, Shariah-compliant methodology that mitigates Gharar (uncertainty) and avoids any element of riba (interest). This may include periodic valuations, profit-sharing arrangements, or other Shariah-approved methods. (ref: AAOIFI Shariah Standard 12, Clause 4/1; AAOIFI Shariah Standard 12 (Musharaka) and principles of Gharar avoidance.)\\n\\nFAS4.SH3: In the event of a partner's exit from the Diminishing Musharaka, the value of the partnership assets shall be determined based on a fair market valuation conducted by an independent valuer acceptable to all partners, or by a mechanism detailed in the shirkah al-'aqd agreement and agreed to by all partners at inception. The exiting partner is entitled to their share of the asset based on this valuation, minus any outstanding liabilities. The profit distribution mechanism in a diminishing Musharaka shall reflect the changing ownership percentages of the partners as the Musharaka diminishes. The method must be clearly defined in the agreement and be Shariah-compliant. Profit allocation should be based on the agreed ratio, taking into consideration the capital contribution and efforts of each partner. Any profit or loss arising from a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd) shall be distributed among the remaining partners and the exiting partner according to the agreed-upon profit and loss sharing ratio stipulated in the Musharaka agreement. This distribution must comply with Shariah principles governing profit sharing in Musharaka contracts. (ref: AAOIFI Shariah Standard 12, Clause 5/2; AAOIFI Shariah Standard 12 (Musharaka) and principles of profit and loss sharing in Islamic finance; AAOIFI Shariah Standard 12, section 2/1)\\n\\nFAS4.SH4: The Diminishing Musharaka agreement should explicitly detail the process by which the Islamic Financial Institution (IFI) gradually acquires the partner's share of the asset. This process must adhere to Shariah principles, typically involving periodic purchases of portions of the partner's share, ultimately leading to the IFI's full ownership. The final transfer of ownership to the remaining partner(s) in a diminishing Musharaka shall be structured as a sale transaction at an agreed-upon price or through a mechanism compliant with Shariah principles. The method of transfer must be explicitly outlined in the agreement. Diminishing Musharaka agreements and any associated Sukuk issuances must fully comply with the stipulations outlined in AAOIFI Shariah Standard No. 12 concerning Shirkah (Musharakah) and AAOIFI Shariah Standard No. 23 pertaining to Investment Sukuk. (ref: AAOIFI Shariah Standard 12, Clause 3/4; AAOIFI Shariah Standard 12 (Musharaka) and principles of Bay' (Sale) in Islamic finance.; AAOIFI Shariah Standard 12 and 23)\\n\\nFAS4.SH5: Any profits distributed to partners prior to the final liquidation of the Musharaka should be treated as advance profit distribution and will be reconciled against the final valuation upon exit. If the final valuation reveals an overpayment of profit, the exiting partner must return the excess amount unless it is otherwise specified in the agreement that any profit distribution made in good faith will not need to be returned. Such a condition should only be applied if the mechanism for independent valuation is robust and acceptable from a Shariah perspective. Full disclosure of the valuation methodologies used for partner contributions and exits, as well as the profit distribution mechanism, shall be provided to all partners to ensure transparency and mitigate potential disputes. (ref: AAOIFI Shariah Standard 12, Clause 4/3; General principles of transparency and fairness in Islamic finance contracts)\\n\\nFAS4.SH6: The agreement shall clearly stipulate the mechanisms for resolving disputes among partners, giving preference to amicable solutions through mediation or arbitration in accordance with Shariah principles. It is permissible to agree that any disputes will be settled through a Shariah compliant arbitration center. (ref: Principles of Sulh (Reconciliation) in Islamic Jurisprudence)\", 'justification': 'These additions introduce Shariah-specific clauses governing Diminishing Musharaka (Shirkah al-ʿAqd), covering partner contributions (FAS4.SH1), profit and loss sharing (FAS4.SH2), partner exits (FAS4.SH3), gradual acquisition (FAS4.SH4), advance profit distribution (FAS4.SH5) and dispute resolution (FAS4.SH6). This is based on the synthesis of proposals and alignment with AAOIFI standards, ensuring that accounting practices adhere to Shariah principles. The cited AAOIFI standards and Islamic finance principles directly support each clause, addressing the need for Shariah compliance.', 'section': 'Scope of the Standard', 'type': 'addition'}, {'old_paragraph': '**4. Disclosure Requirements:**', 'new_paragraph': '**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC6: Islamic Financial Institutions shall disclose the nature and terms of the Diminishing Musharaka (Shirkah al-ʿAqd) agreements, including: a) The profit and loss sharing ratio; b) The valuation method used for contributions and exits; c) Any restrictions on transfer of ownership; d) Dispute resolution mechanisms; e) The carrying amount of the Musharaka investment; f) Significant assumptions used in determining fair value; g) The nature of assets contributed (cash, real estate, or usufruct). Comprehensive disclosures regarding the Diminishing Musharaka shall be provided in the financial statements, including: (a) The nature and purpose of the Musharaka; (b) The terms of the Musharaka agreement, including the profit distribution mechanism and the exit mechanism; (c) The fair market value of the initial contributions and the valuation methods used; (d) The carrying amount of the Musharaka assets; (e) The ownership percentages of the partners; (f) Any significant events or transactions related to the Musharaka, such as impairments or partner exits. The financial statements shall disclose the nature of the Diminishing Musharaka, including the profit and loss sharing ratio, the valuation methodology for in-kind contributions, the mechanism for asset valuation upon exit, the policy for profit distribution, and any significant assumptions used in determining fair values. (ref: FAS 4, paragraph 49; AAOIFI AS 1, paragraph 5; AAOIFI AS 1 (General Presentation and Disclosure) Section 7; AAOIFI AS 1, para 3.1)', 'justification': \"This addition provides comprehensive disclosure requirements for Diminishing Musharaka agreements, aligning with AAOIFI standards and FAS 4 principles. The clauses mandate disclosure of key terms, valuation methods, restrictions, dispute resolution mechanisms, and financial assumptions, enhancing transparency. It directly relates to the proposal's emphasis on transparency and comprehensive disclosures.\", 'section': 'Disclosure Requirements', 'type': 'addition'}, {'old_paragraph': '**4. Disclosure Requirements:**', 'new_paragraph': '**4. Disclosure Requirements:**\\n\\nFAS4.Musharaka.ACC7: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)\\nFAS4.Musharaka.ACC8: Any disputes arising among partners in relation to the Diminishing Musharaka should be disclosed in the financial statements, along with the mechanisms for resolving such disputes, particularly if they involve Shariah-compliant arbitration. Any material impact from such disputes should be appropriately accounted for. (ref: AAOIFI AS 1, para 3.2)', 'justification': 'This addition emphasizes the need to disclose any disputes arising among partners in relation to Diminishing Musharaka, especially if they involve Shariah-compliant arbitration. It further necessitates accounting for any material impact resulting from such disputes. This is drawn from AAOIFI AS 1, para 3.2, reinforcing the transparency objective.', 'section': 'Disclosure Requirements', 'type': 'addition'}, {'old_paragraph': \"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\", 'new_paragraph': \"**1. Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting):**\\n\\nFAS4.Musharaka.ACC1: Upon the commencement of a Diminishing Musharaka (Shirkah al-ʿAqd), each partner's contribution, whether monetary or in-kind, shall be recognized at fair value. In-kind contributions shall be independently valued at the date of contribution, with the valuation methodology disclosed in the financial statements. The difference between the fair value and the carrying amount (if any) of in-kind contributions from the perspective of the contributor should be treated according to existing accounting standards applicable to the contributor. The Islamic Financial Institution (IFI) shall record its share of the Musharaka assets based on its contribution ratio. Initial contributions to a Diminishing Musharaka (Shirkah al-ʿAqd) shall be recognized at fair market value at the time of contribution. If the contribution is in the form of cash, the amount of cash contributed shall be its fair market value. If the contribution is in the form of assets, including real estate or usufruct, an independent valuation, acceptable to all partners, shall be obtained to determine the fair market value. The nature of the contribution (cash, asset, or usufruct) shall be disclosed. Any difference between the carrying amount of assets contributed and their fair market value at the time of contribution shall be recognized as an adjustment to the partners' capital accounts, consistent with the agreed profit and loss sharing ratio and subject to Shariah supervisory board approval. (ref: AAOIFI AS 3, para 3.2; IFRS 3 (Conceptual Alignment); AAOIFI AS 2 (Murabaha Financing) para 3/6 , AAOIFI Shariah Standard 12 (Musharaka); AAOIFI AS 12, section 3/1; AAOIFI AS 1, paragraphs 4.2.3, 4.2.4)\", 'justification': 'This addition clarifies the accounting treatment for contributions to Diminishing Musharaka. It emphasizes recognizing contributions at fair value, disclosing valuation methodologies, and addressing the difference between fair value and carrying amount. It aligns with AAOIFI standards and IFRS principles, specifically related to fair value measurement and disclosure.', 'section': \"Recognition & Measurement of Bank's Share in Musharaka Capital (At time of contracting)\", 'type': 'addition'}, {'old_paragraph': \"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\", 'new_paragraph': \"**2. Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period):**\\n\\nFAS4.Musharaka.ACC2: The initial measurement of the Diminishing Musharaka investment by each partner should reflect the fair value of their respective contributions. Subsequent measurement should follow a method that reflects the nature of the underlying assets (e.g., real estate at fair value or cost less depreciation). The chosen method should be consistently applied and disclosed. Subsequent to initial recognition, the carrying amount of the Musharaka assets should be reviewed periodically for impairment in accordance with generally accepted accounting principles. Any impairment loss should be recognized in the income statement and allocated to the partners based on their current ownership percentages at the time of impairment, subject to Shariah approval. Upon a partner's exit from a Diminishing Musharaka (Shirkah al-ʿAqd), the exiting partner's share shall be derecognized at its fair market value at the time of exit, as determined by the agreed-upon valuation method specified in the Musharaka agreement. Any difference between the carrying amount of the partner's share and the fair market value at exit shall be recognized as a profit or loss and allocated according to the agreed profit/loss sharing ratio. (ref: AAOIFI AS 3, paras 4.1, 4.2; IAS 40 (if real estate); IAS 36 (Impairment of Assets) - Conceptual Alignment for Impairment review.; AAOIFI AS 12, section 4/5; AAOIFI AS 1, paragraph 4.3.2)\", 'justification': \"This addition focuses on the subsequent measurement of Diminishing Musharaka investments and the accounting treatment of partner exits. It emphasizes fair value measurement, impairment reviews, and the recognition of profit or loss upon a partner's exit, aligning with AAOIFI standards, IAS 40, and IAS 36. It is directly relevant to the proposals concerning valuation methods and accounting for exits.\", 'section': \"Measurement of Bank's Share in Musharaka Capital (After contracting, at the end of a financial period)\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC3: Profit and loss sharing shall be accounted for based on the pre-agreed ratio stipulated in the Musharaka agreement. Profit distribution shall be recognized when the right to receive it is established. Losses shall be recognized immediately when they occur, and the carrying amount of the Musharaka investment shall be adjusted accordingly. The profit distribution mechanism shall be clearly defined in the Diminishing Musharaka agreement and shall reflect the changing ownership percentages of the partners. Profit shall be allocated based on the agreed ratio, considering capital contribution, effort, and other relevant factors as per the agreement. The accounting treatment for profit distribution should follow the substance of the agreement, ensuring that the allocation is Shariah-compliant and transparent. Any profit or loss arising from a partner's exit shall be allocated to the remaining partners and the exiting partner based on the pre-agreed profit and loss sharing ratio stipulated in the Diminishing Musharaka agreement. This allocation shall be consistently applied throughout the term of the Musharaka. The method used to determine the fair market value of the exiting partner’s share shall be disclosed. (ref: AAOIFI AS 3, para 5.1; AASB 101; AAOIFI AS 12 (Accounting for investment in Real Estate) Section 5.; AAOIFI AS 12, section 2/1; FAS 4, paragraph 25)\", 'justification': 'This addition addresses the accounting for profit and loss sharing in Diminishing Musharaka, emphasizing the pre-agreed ratio, Shariah compliance, and transparency. It clarifies the treatment of profit and loss arising from partner exits, and disclosing the method used to determine fair value. This aligns with AAOIFI standards, AASB 101, and FAS 4 principles.', 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC4: When a partner exits the Diminishing Musharaka, the valuation of the partnership assets shall be determined based on the fair market value at the date of exit, as determined by an independent valuer or by the mechanism stipulated in the Musharaka agreement at inception. The exiting partner's share of the net assets, based on this valuation, shall be derecognized from the financial statements of the remaining partners. The exit of a partner from a Diminishing Musharaka shall be accounted for as a sale of the exiting partner's ownership interest to the remaining partner(s) or to a third party, as per the pre-agreed, Shariah-compliant exit mechanism defined in the Musharaka agreement. If Investment Sukuk are issued in connection with a Diminishing Musharaka, the accounting treatment of the Sukuk shall comply with AAOIFI Shariah Standard No. 23 on Investment Sukuk and any other relevant AAOIFI Accounting Standards related to Sukuk. The disclosures shall include the nature of the Sukuk, the underlying assets of the Musharaka, and the rights and obligations of the Sukuk holders. (ref: AAOIFI AS 3, para 5.2; IFRS 10 (Conceptual Alignment); AAOIFI AS 3 (Mudarabah Financing) para 4/8; AAOIFI AS 23; AAOIFI AS 11)\", 'justification': \"This addition describes the accounting treatment for a partner's exit from a Diminishing Musharaka, focusing on fair market valuation, derecognition of the exiting partner's share, and Shariah-compliant exit mechanisms. It also addresses Sukuk issuances in connection with Diminishing Musharaka, adhering to AAOIFI Shariah Standard No. 23. It directly reflects the need to provide clear and specific guidance on valuation methods and address the accounting treatment of profits/losses arising from exits.\", 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}, {'old_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\", 'new_paragraph': \"**3. Recognition of Bank's Share in Musharaka Profits or Losses:**\\n\\nFAS4.Musharaka.ACC5: Any difference between the carrying amount of the exiting partner’s share and the consideration paid to them shall be recognized as a gain or loss in the profit or loss statement of the remaining partners. If the Diminishing Musharaka involves the gradual acquisition of the exiting partner's share by the IFI, each periodic purchase shall be treated as a separate acquisition of an asset. The final transfer of ownership in a Diminishing Musharaka shall be recognized when all conditions for the transfer, as outlined in the agreement, have been met. The remaining partner(s) shall recognize the acquired assets at the agreed-upon price or as determined by the Shariah-compliant mechanism outlined in the agreement. Any difference between the fair value of the assets acquired and the price paid should be appropriately accounted for, considering the nature of the transaction and Shariah requirements. Distributions to partners before the final liquidation of the Musharaka shall be accounted for as advance profit distributions. Upon a partner's exit, a reconciliation shall be performed to determine if any overpayment of profit has occurred. Any excess amount shall be treated as a liability to the partnership, unless the agreement stipulates that profit distributions made in good faith are not recoverable, provided that the independent valuation mechanism is robust and Shariah-compliant. (ref: AAOIFI AS 3, para 5.3; IFRS 10 (Conceptual Alignment); AAOIFI AS 12 (Accounting for investment in Real Estate) Section 6.; AAOIFI AS 3, para 4.3)\", 'justification': 'This addition details the accounting treatment for differences between the carrying amount and consideration paid to an exiting partner, addressing gradual acquisitions and the final transfer of ownership. It also covers the treatment of advance profit distributions and reconciliations upon exit. This provides specific guidance on accounting for profit/loss arising from exits and aligns with AAOIFI standards and IFRS principles.', 'section': \"Recognition of Bank's Share in Musharaka Profits or Losses\", 'type': 'addition'}], 'key_changes_summary': 'FAS 4 has been updated to include detailed accounting guidance for Diminishing Musharaka (Shirkah al-ʿAqd) structures, especially concerning partner contributions and exits. The updates cover:\\n\\n*   **Partner Contributions:** Recognizing contributions at fair value and disclosing valuation methods.\\n*   **Profit and Loss Sharing:** Accounting based on pre-agreed ratios and Shariah compliance.\\n*   **Partner Exits:** Fair market valuation, derecognition of shares, and profit/loss allocation.\\n*   **Sukuk Compliance:** Adherence to AAOIFI Shariah Standards No. 12 and 23.\\n*   **Disclosures:** Comprehensive disclosure requirements for transparency.\\n* **Shariah compliace:** Shariah-specific clauses governing Diminishing Musharaka to ensure compliance with shariah principles\\n\\nThese changes address gaps in the previous FAS 4, providing clearer and more consistent accounting practices aligned with AAOIFI standards and Shariah principles.', 'change_statistics': {'additions': 8, 'deletions': 0, 'modifications': 1}}}}"