{
  "fas_number": "fas 8",
  "changes": [
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "Financial Accounting Standard 8 (FAS 8): Accounting for the Impact of Political Dynamics on Islamic Financial Institutions (IFIs)",
      "justification": "Added a title to formally introduce the scope of FAS 8 in light of the new guidelines regarding political impacts, risk assessment, and Shariah adherence. This serves as a starting point for organizing and structuring the forthcoming clauses. This is needed to establish the context of the new clauses.",
      "section": "Title",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC1: An Islamic Financial Institution (IFI) shall disclose in its financial statements the nature and extent of significant risks arising from political dynamics, including legislative gridlock, potential government shutdowns, and changes in fiscal and tax policies, that could reasonably be expected to affect the IFI's financial position, financial performance, or cash flows. This disclosure shall include a qualitative assessment of the potential impact on the IFI's ability to comply with Shariah principles. (ref: AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements))",
      "justification": "Added new clause FAS8.POL1.ACC1 to address the gap in transparency concerning political risks affecting IFIs, reflecting the need for better disclosure. This integrates accounting standards with Shariah principles by including a qualitative assessment of the impact on Shariah compliance, as highlighted in the 'reasoning_summary'. The references given are AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements)",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC2: For IFIs with significant exposure to sectors or activities directly affected by political or governmental actions (e.g., government contracts, infrastructure projects, or specific tax incentives), the IFI shall disclose a sensitivity analysis illustrating the potential impact of reasonably possible adverse changes in political or governmental policies on the carrying amount of related assets and liabilities. This analysis should explicitly consider the impact on expected returns and Shariah compliance. (ref: AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis))",
      "justification": "Added new clause FAS8.POL1.ACC2 to mandate sensitivity analysis for IFIs heavily exposed to politically sensitive sectors. This addresses the need for IFIs to assess risks related to changes in political policies and their effects on asset and liability values, incorporating Shariah compliance, derived from proposal 1. The references given are AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC3: IFIs shall incorporate political and governmental risks into their scenario planning and stress testing processes. These scenarios should consider a range of plausible political and economic outcomes, including scenarios where governmental policies are delayed, modified, or terminated. The results of these stress tests, including the impact on the IFI's capital adequacy and Shariah compliance, shall be disclosed to the Shariah Supervisory Board and senior management. (ref: AAOIFI Governance Standard 14 on Risk Management)",
      "justification": "Added new clause FAS8.POL1.ACC3, derived from Proposal 1, requiring political and governmental risks to be integrated into scenario planning and stress testing. This ensures a proactive approach to risk management by considering various potential political outcomes and assessing their impacts on capital adequacy and Shariah compliance, and the results are disclosed. The reference is AAOIFI Governance Standard 14 on Risk Management.",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC4: When political or governmental actions result in a significant impairment of an asset or a significant increase in a liability, the IFI shall recognize the impairment loss or the increase in the liability in the period in which the political or governmental action occurs and it becomes probable that the carrying value of the asset is impaired or a liability has been incurred. The determination of impairment and measurement of the loss shall be subject to review and approval by the Shariah Supervisory Board to ensure compliance with Shariah principles. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets))",
      "justification": "Added new clause FAS8.POL1.ACC4 to define the accounting treatment of impairments and liabilities arising from political events, emphasizing Shariah compliance through Shariah Supervisory Board review. This clause addresses the gap by making a direct link between political action and accounting recognition of impairments, from proposal 1. The references are: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets).",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC5: In cases where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or a violation of Shariah principles (such as riba or gharar), the IFI shall disclose the nature of the alteration, the potential impact on Shariah compliance, and the measures taken to ensure fairness ('adl) and avoid exploitation. This may include renegotiation of contract terms, alternative solutions, or seeking guidance from the Shariah Supervisory Board. (ref: AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance)",
      "justification": "Added new clause FAS8.POL1.ACC5 to address contractual alterations and ensure fairness ('adl) in alignment with Shariah principles when political actions impact contract outcomes. The new clause incorporates proposal 1 and incorporates the Shariah concern by adding the importance of fairness and adherence to the principles. The references given are AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance).",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC6: If an IFI has entered into contracts or commitments whose performance is contingent upon the passage of specific legislation or government action that is rendered uncertain due to political events, the IFI shall disclose the nature of these contracts or commitments, the associated risks, and the potential financial impact if the legislation or action fails to materialize. The IFI shall also disclose any risk mitigation strategies adopted to manage these risks. (ref: AAOIFI AS 1, paragraphs 43-45 (Contingencies))",
      "justification": "Added clause FAS8.POL1.ACC6 to address the disclosures for contingent contracts affected by political uncertainty. This addition directly responds to the identification of the gap and provides a framework for the accounting procedures by enhancing risk mitigation disclosure. The reference is AAOIFI AS 1, paragraphs 43-45 (Contingencies).",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.POL1.ACC7: In the event of significant volatility in the market caused by political events, the IFI should provide additional sensitivity analysis in the notes to the financial statements, illustrating the potential impact of a range of possible outcomes on key financial metrics. This should explicitly disclose assumptions used in assessing sensitivities. (ref: AAOIFI AS 1, paragraph 46 (Sensitivity Analysis))",
      "justification": "Added clause FAS8.POL1.ACC7 that mandates additional sensitivity analysis during political volatility, with explicit disclosure of assumptions used, to address the identified gap in accounting for political events' impact. This clause integrates the need for better sensitivity analysis to market changes. The reference given is AAOIFI AS 1, paragraph 46 (Sensitivity Analysis).",
      "section": "Accounting Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH1: IFIs must disclose potential material impacts of political events, including legislative changes or failures such as budget reconciliation, on their financial position and performance. This disclosure should include a qualitative assessment of the event's potential influence on asset values, project viability, and overall financial stability. (ref: AAOIFI Governance Standard 2 on Transparency and Disclosure)",
      "justification": "Added new clause FAS8.SH1 to introduce the Shariah-compliant disclosure requirements related to political events impacting IFIs, grounded in Shariah principles. This clause addresses the need for transparency and disclosure and ensures a Shariah-compliant approach to assessing these impacts, derived from proposal 3 and the 'reasoning_summary'. The reference is AAOIFI Governance Standard 2 on Transparency and Disclosure.",
      "section": "Shariah Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH2: IFIs shall conduct scenario planning and stress testing that incorporate potential adverse political and economic scenarios. These tests must assess the IFI's ability to maintain solvency, fulfill its obligations, and comply with Shariah principles under such conditions. (ref: General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management)",
      "justification": "Added new clause FAS8.SH2 to mandate Shariah-compliant scenario planning and stress testing, derived from the reasoning. This integrates Shariah principles by requiring the assessment of compliance under adverse political and economic scenarios. The references are General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management.",
      "section": "Shariah Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH3: IFIs must establish internal Shariah review mechanisms to assess the impact of political events and fiscal policy changes on the Shariah compliance of their operations and products. This includes identifying potential risks to existing contracts and investments and developing mitigation strategies. (ref: AAOIFI Governance Standard 2 on Shariah Supervisory Board)",
      "justification": "Added new clause FAS8.SH3 to necessitate the establishment of internal Shariah review mechanisms, drawing from proposal 3, to ensure compliance during political events and policy changes. This clause requires IFIs to monitor and mitigate Shariah-related risks to their operations. The reference given is AAOIFI Governance Standard 2 on Shariah Supervisory Board.",
      "section": "Shariah Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH4: In instances where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or violation of Shariah principles (such as riba or gharar), the IFI should implement measures to ensure fairness ('adl) and avoid exploitation, potentially including renegotiation of contract terms or alternative solutions that align with Shariah principles. All alterations should be approved by the Shariah Supervisory Board. (ref: Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah)",
      "justification": "Added new clause FAS8.SH4 to ensure fairness ('adl) and prevent exploitation in contracts when political actions cause significant alterations. This clause demands adherence to Shariah principles, as described in the 'reasoning_summary', and approval from the Shariah Supervisory Board. The references are Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah.",
      "section": "Shariah Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH5: Where political instability or specific political events significantly increase the risk profile of an IFI's investments or operations, the IFI should implement and disclose risk mitigation strategies compliant with Shariah principles. These strategies may include, but are not limited to, diversification, hedging (where Shariah-compliant), and enhanced due diligence on affected assets. (ref: AAOIFI Shariah Standard 23 on Hedging in Islamic Finance)",
      "justification": "Added new clause FAS8.SH5 to provide guidance on Shariah-compliant risk mitigation strategies during political instability. This ensures that IFIs take steps to reduce risks while adhering to Shariah principles, addressing identified gaps in existing frameworks. The reference given is AAOIFI Shariah Standard 23 on Hedging in Islamic Finance.",
      "section": "Shariah Clauses",
      "type": "addition"
    },
    {
      "old_paragraph": "No original FAS document available.",
      "new_paragraph": "FAS8.SH6: In cases where political dynamics create uncertainty regarding the enforceability of contracts or the realization of expected returns, IFIs should apply a conservative approach to asset valuation, reflecting the increased risk. Such valuation adjustments must be clearly documented and justified based on Shariah-accepted principles of fair value and impairment. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure)",
      "justification": "Added new clause FAS8.SH6 to implement a conservative approach to asset valuation when political factors create uncertainty in contract enforceability or returns realization. This requirement guarantees an increased application of asset valuation according to Shariah-accepted principles. The reference given is AAOIFI Accounting Standard 1 on General Presentation and Disclosure.",
      "section": "Shariah Clauses",
      "type": "addition"
    }
  ],
  "document": "{'fas_number': 'fas 8', 'changes': [{'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'Financial Accounting Standard 8 (FAS 8): Accounting for the Impact of Political Dynamics on Islamic Financial Institutions (IFIs)', 'justification': 'Added a title to formally introduce the scope of FAS 8 in light of the new guidelines regarding political impacts, risk assessment, and Shariah adherence. This serves as a starting point for organizing and structuring the forthcoming clauses. This is needed to establish the context of the new clauses.', 'section': 'Title', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC1: An Islamic Financial Institution (IFI) shall disclose in its financial statements the nature and extent of significant risks arising from political dynamics, including legislative gridlock, potential government shutdowns, and changes in fiscal and tax policies, that could reasonably be expected to affect the IFI's financial position, financial performance, or cash flows. This disclosure shall include a qualitative assessment of the potential impact on the IFI's ability to comply with Shariah principles. (ref: AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements))\", 'justification': \"Added new clause FAS8.POL1.ACC1 to address the gap in transparency concerning political risks affecting IFIs, reflecting the need for better disclosure. This integrates accounting standards with Shariah principles by including a qualitative assessment of the impact on Shariah compliance, as highlighted in the 'reasoning_summary'. The references given are AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements)\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC2: For IFIs with significant exposure to sectors or activities directly affected by political or governmental actions (e.g., government contracts, infrastructure projects, or specific tax incentives), the IFI shall disclose a sensitivity analysis illustrating the potential impact of reasonably possible adverse changes in political or governmental policies on the carrying amount of related assets and liabilities. This analysis should explicitly consider the impact on expected returns and Shariah compliance. (ref: AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis))', 'justification': 'Added new clause FAS8.POL1.ACC2 to mandate sensitivity analysis for IFIs heavily exposed to politically sensitive sectors. This addresses the need for IFIs to assess risks related to changes in political policies and their effects on asset and liability values, incorporating Shariah compliance, derived from proposal 1. The references given are AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC3: IFIs shall incorporate political and governmental risks into their scenario planning and stress testing processes. These scenarios should consider a range of plausible political and economic outcomes, including scenarios where governmental policies are delayed, modified, or terminated. The results of these stress tests, including the impact on the IFI's capital adequacy and Shariah compliance, shall be disclosed to the Shariah Supervisory Board and senior management. (ref: AAOIFI Governance Standard 14 on Risk Management)\", 'justification': 'Added new clause FAS8.POL1.ACC3, derived from Proposal 1, requiring political and governmental risks to be integrated into scenario planning and stress testing. This ensures a proactive approach to risk management by considering various potential political outcomes and assessing their impacts on capital adequacy and Shariah compliance, and the results are disclosed. The reference is AAOIFI Governance Standard 14 on Risk Management.', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC4: When political or governmental actions result in a significant impairment of an asset or a significant increase in a liability, the IFI shall recognize the impairment loss or the increase in the liability in the period in which the political or governmental action occurs and it becomes probable that the carrying value of the asset is impaired or a liability has been incurred. The determination of impairment and measurement of the loss shall be subject to review and approval by the Shariah Supervisory Board to ensure compliance with Shariah principles. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets))', 'justification': 'Added new clause FAS8.POL1.ACC4 to define the accounting treatment of impairments and liabilities arising from political events, emphasizing Shariah compliance through Shariah Supervisory Board review. This clause addresses the gap by making a direct link between political action and accounting recognition of impairments, from proposal 1. The references are: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets).', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC5: In cases where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or a violation of Shariah principles (such as riba or gharar), the IFI shall disclose the nature of the alteration, the potential impact on Shariah compliance, and the measures taken to ensure fairness ('adl) and avoid exploitation. This may include renegotiation of contract terms, alternative solutions, or seeking guidance from the Shariah Supervisory Board. (ref: AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance)\", 'justification': \"Added new clause FAS8.POL1.ACC5 to address contractual alterations and ensure fairness ('adl) in alignment with Shariah principles when political actions impact contract outcomes. The new clause incorporates proposal 1 and incorporates the Shariah concern by adding the importance of fairness and adherence to the principles. The references given are AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance).\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC6: If an IFI has entered into contracts or commitments whose performance is contingent upon the passage of specific legislation or government action that is rendered uncertain due to political events, the IFI shall disclose the nature of these contracts or commitments, the associated risks, and the potential financial impact if the legislation or action fails to materialize. The IFI shall also disclose any risk mitigation strategies adopted to manage these risks. (ref: AAOIFI AS 1, paragraphs 43-45 (Contingencies))', 'justification': 'Added clause FAS8.POL1.ACC6 to address the disclosures for contingent contracts affected by political uncertainty. This addition directly responds to the identification of the gap and provides a framework for the accounting procedures by enhancing risk mitigation disclosure. The reference is AAOIFI AS 1, paragraphs 43-45 (Contingencies).', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC7: In the event of significant volatility in the market caused by political events, the IFI should provide additional sensitivity analysis in the notes to the financial statements, illustrating the potential impact of a range of possible outcomes on key financial metrics. This should explicitly disclose assumptions used in assessing sensitivities. (ref: AAOIFI AS 1, paragraph 46 (Sensitivity Analysis))', 'justification': \"Added clause FAS8.POL1.ACC7 that mandates additional sensitivity analysis during political volatility, with explicit disclosure of assumptions used, to address the identified gap in accounting for political events' impact. This clause integrates the need for better sensitivity analysis to market changes. The reference given is AAOIFI AS 1, paragraph 46 (Sensitivity Analysis).\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH1: IFIs must disclose potential material impacts of political events, including legislative changes or failures such as budget reconciliation, on their financial position and performance. This disclosure should include a qualitative assessment of the event's potential influence on asset values, project viability, and overall financial stability. (ref: AAOIFI Governance Standard 2 on Transparency and Disclosure)\", 'justification': \"Added new clause FAS8.SH1 to introduce the Shariah-compliant disclosure requirements related to political events impacting IFIs, grounded in Shariah principles. This clause addresses the need for transparency and disclosure and ensures a Shariah-compliant approach to assessing these impacts, derived from proposal 3 and the 'reasoning_summary'. The reference is AAOIFI Governance Standard 2 on Transparency and Disclosure.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH2: IFIs shall conduct scenario planning and stress testing that incorporate potential adverse political and economic scenarios. These tests must assess the IFI's ability to maintain solvency, fulfill its obligations, and comply with Shariah principles under such conditions. (ref: General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management)\", 'justification': \"Added new clause FAS8.SH2 to mandate Shariah-compliant scenario planning and stress testing, derived from the reasoning. This integrates Shariah principles by requiring the assessment of compliance under adverse political and economic scenarios. The references are General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.SH3: IFIs must establish internal Shariah review mechanisms to assess the impact of political events and fiscal policy changes on the Shariah compliance of their operations and products. This includes identifying potential risks to existing contracts and investments and developing mitigation strategies. (ref: AAOIFI Governance Standard 2 on Shariah Supervisory Board)', 'justification': 'Added new clause FAS8.SH3 to necessitate the establishment of internal Shariah review mechanisms, drawing from proposal 3, to ensure compliance during political events and policy changes. This clause requires IFIs to monitor and mitigate Shariah-related risks to their operations. The reference given is AAOIFI Governance Standard 2 on Shariah Supervisory Board.', 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH4: In instances where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or violation of Shariah principles (such as riba or gharar), the IFI should implement measures to ensure fairness ('adl) and avoid exploitation, potentially including renegotiation of contract terms or alternative solutions that align with Shariah principles. All alterations should be approved by the Shariah Supervisory Board. (ref: Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah)\", 'justification': \"Added new clause FAS8.SH4 to ensure fairness ('adl) and prevent exploitation in contracts when political actions cause significant alterations. This clause demands adherence to Shariah principles, as described in the 'reasoning_summary', and approval from the Shariah Supervisory Board. The references are Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH5: Where political instability or specific political events significantly increase the risk profile of an IFI's investments or operations, the IFI should implement and disclose risk mitigation strategies compliant with Shariah principles. These strategies may include, but are not limited to, diversification, hedging (where Shariah-compliant), and enhanced due diligence on affected assets. (ref: AAOIFI Shariah Standard 23 on Hedging in Islamic Finance)\", 'justification': 'Added new clause FAS8.SH5 to provide guidance on Shariah-compliant risk mitigation strategies during political instability. This ensures that IFIs take steps to reduce risks while adhering to Shariah principles, addressing identified gaps in existing frameworks. The reference given is AAOIFI Shariah Standard 23 on Hedging in Islamic Finance.', 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.SH6: In cases where political dynamics create uncertainty regarding the enforceability of contracts or the realization of expected returns, IFIs should apply a conservative approach to asset valuation, reflecting the increased risk. Such valuation adjustments must be clearly documented and justified based on Shariah-accepted principles of fair value and impairment. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure)', 'justification': 'Added new clause FAS8.SH6 to implement a conservative approach to asset valuation when political factors create uncertainty in contract enforceability or returns realization. This requirement guarantees an increased application of asset valuation according to Shariah-accepted principles. The reference given is AAOIFI Accounting Standard 1 on General Presentation and Disclosure.', 'section': 'Shariah Clauses', 'type': 'addition'}], 'document': FASDiffOutput(changes=[ChangeRecord(old_text='No original FAS document available.', new_text='Financial Accounting Standard 8 (FAS 8): Accounting for the Impact of Political Dynamics on Islamic Financial Institutions (IFIs)', justification='Added a title to formally introduce the scope of FAS 8 in light of the new guidelines regarding political impacts, risk assessment, and Shariah adherence. This serves as a starting point for organizing and structuring the forthcoming clauses. This is needed to establish the context of the new clauses.', section_id='Title', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.POL1.ACC1: An Islamic Financial Institution (IFI) shall disclose in its financial statements the nature and extent of significant risks arising from political dynamics, including legislative gridlock, potential government shutdowns, and changes in fiscal and tax policies, that could reasonably be expected to affect the IFI's financial position, financial performance, or cash flows. This disclosure shall include a qualitative assessment of the potential impact on the IFI's ability to comply with Shariah principles. (ref: AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements))\", justification=\"Added new clause FAS8.POL1.ACC1 to address the gap in transparency concerning political risks affecting IFIs, reflecting the need for better disclosure. This integrates accounting standards with Shariah principles by including a qualitative assessment of the impact on Shariah compliance, as highlighted in the 'reasoning_summary'. The references given are AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements)\", section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.POL1.ACC2: For IFIs with significant exposure to sectors or activities directly affected by political or governmental actions (e.g., government contracts, infrastructure projects, or specific tax incentives), the IFI shall disclose a sensitivity analysis illustrating the potential impact of reasonably possible adverse changes in political or governmental policies on the carrying amount of related assets and liabilities. This analysis should explicitly consider the impact on expected returns and Shariah compliance. (ref: AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis))', justification='Added new clause FAS8.POL1.ACC2 to mandate sensitivity analysis for IFIs heavily exposed to politically sensitive sectors. This addresses the need for IFIs to assess risks related to changes in political policies and their effects on asset and liability values, incorporating Shariah compliance, derived from proposal 1. The references given are AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)', section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.POL1.ACC3: IFIs shall incorporate political and governmental risks into their scenario planning and stress testing processes. These scenarios should consider a range of plausible political and economic outcomes, including scenarios where governmental policies are delayed, modified, or terminated. The results of these stress tests, including the impact on the IFI's capital adequacy and Shariah compliance, shall be disclosed to the Shariah Supervisory Board and senior management. (ref: AAOIFI Governance Standard 14 on Risk Management)\", justification='Added new clause FAS8.POL1.ACC3, derived from Proposal 1, requiring political and governmental risks to be integrated into scenario planning and stress testing. This ensures a proactive approach to risk management by considering various potential political outcomes and assessing their impacts on capital adequacy and Shariah compliance, and the results are disclosed. The reference is AAOIFI Governance Standard 14 on Risk Management.', section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.POL1.ACC4: When political or governmental actions result in a significant impairment of an asset or a significant increase in a liability, the IFI shall recognize the impairment loss or the increase in the liability in the period in which the political or governmental action occurs and it becomes probable that the carrying value of the asset is impaired or a liability has been incurred. The determination of impairment and measurement of the loss shall be subject to review and approval by the Shariah Supervisory Board to ensure compliance with Shariah principles. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets))', justification='Added new clause FAS8.POL1.ACC4 to define the accounting treatment of impairments and liabilities arising from political events, emphasizing Shariah compliance through Shariah Supervisory Board review. This clause addresses the gap by making a direct link between political action and accounting recognition of impairments, from proposal 1. The references are: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets).', section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.POL1.ACC5: In cases where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or a violation of Shariah principles (such as riba or gharar), the IFI shall disclose the nature of the alteration, the potential impact on Shariah compliance, and the measures taken to ensure fairness ('adl) and avoid exploitation. This may include renegotiation of contract terms, alternative solutions, or seeking guidance from the Shariah Supervisory Board. (ref: AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance)\", justification=\"Added new clause FAS8.POL1.ACC5 to address contractual alterations and ensure fairness ('adl) in alignment with Shariah principles when political actions impact contract outcomes. The new clause incorporates proposal 1 and incorporates the Shariah concern by adding the importance of fairness and adherence to the principles. The references given are AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance).\", section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.POL1.ACC6: If an IFI has entered into contracts or commitments whose performance is contingent upon the passage of specific legislation or government action that is rendered uncertain due to political events, the IFI shall disclose the nature of these contracts or commitments, the associated risks, and the potential financial impact if the legislation or action fails to materialize. The IFI shall also disclose any risk mitigation strategies adopted to manage these risks. (ref: AAOIFI AS 1, paragraphs 43-45 (Contingencies))', justification='Added clause FAS8.POL1.ACC6 to address the disclosures for contingent contracts affected by political uncertainty. This addition directly responds to the identification of the gap and provides a framework for the accounting procedures by enhancing risk mitigation disclosure. The reference is AAOIFI AS 1, paragraphs 43-45 (Contingencies).', section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.POL1.ACC7: In the event of significant volatility in the market caused by political events, the IFI should provide additional sensitivity analysis in the notes to the financial statements, illustrating the potential impact of a range of possible outcomes on key financial metrics. This should explicitly disclose assumptions used in assessing sensitivities. (ref: AAOIFI AS 1, paragraph 46 (Sensitivity Analysis))', justification=\"Added clause FAS8.POL1.ACC7 that mandates additional sensitivity analysis during political volatility, with explicit disclosure of assumptions used, to address the identified gap in accounting for political events' impact. This clause integrates the need for better sensitivity analysis to market changes. The reference given is AAOIFI AS 1, paragraph 46 (Sensitivity Analysis).\", section_id='Accounting Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.SH1: IFIs must disclose potential material impacts of political events, including legislative changes or failures such as budget reconciliation, on their financial position and performance. This disclosure should include a qualitative assessment of the event's potential influence on asset values, project viability, and overall financial stability. (ref: AAOIFI Governance Standard 2 on Transparency and Disclosure)\", justification=\"Added new clause FAS8.SH1 to introduce the Shariah-compliant disclosure requirements related to political events impacting IFIs, grounded in Shariah principles. This clause addresses the need for transparency and disclosure and ensures a Shariah-compliant approach to assessing these impacts, derived from proposal 3 and the 'reasoning_summary'. The reference is AAOIFI Governance Standard 2 on Transparency and Disclosure.\", section_id='Shariah Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.SH2: IFIs shall conduct scenario planning and stress testing that incorporate potential adverse political and economic scenarios. These tests must assess the IFI's ability to maintain solvency, fulfill its obligations, and comply with Shariah principles under such conditions. (ref: General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management)\", justification=\"Added new clause FAS8.SH2 to mandate Shariah-compliant scenario planning and stress testing, derived from the reasoning. This integrates Shariah principles by requiring the assessment of compliance under adverse political and economic scenarios. The references are General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management.\", section_id='Shariah Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.SH3: IFIs must establish internal Shariah review mechanisms to assess the impact of political events and fiscal policy changes on the Shariah compliance of their operations and products. This includes identifying potential risks to existing contracts and investments and developing mitigation strategies. (ref: AAOIFI Governance Standard 2 on Shariah Supervisory Board)', justification='Added new clause FAS8.SH3 to necessitate the establishment of internal Shariah review mechanisms, drawing from proposal 3, to ensure compliance during political events and policy changes. This clause requires IFIs to monitor and mitigate Shariah-related risks to their operations. The reference given is AAOIFI Governance Standard 2 on Shariah Supervisory Board.', section_id='Shariah Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.SH4: In instances where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or violation of Shariah principles (such as riba or gharar), the IFI should implement measures to ensure fairness ('adl) and avoid exploitation, potentially including renegotiation of contract terms or alternative solutions that align with Shariah principles. All alterations should be approved by the Shariah Supervisory Board. (ref: Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah)\", justification=\"Added new clause FAS8.SH4 to ensure fairness ('adl) and prevent exploitation in contracts when political actions cause significant alterations. This clause demands adherence to Shariah principles, as described in the 'reasoning_summary', and approval from the Shariah Supervisory Board. The references are Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah.\", section_id='Shariah Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text=\"FAS8.SH5: Where political instability or specific political events significantly increase the risk profile of an IFI's investments or operations, the IFI should implement and disclose risk mitigation strategies compliant with Shariah principles. These strategies may include, but are not limited to, diversification, hedging (where Shariah-compliant), and enhanced due diligence on affected assets. (ref: AAOIFI Shariah Standard 23 on Hedging in Islamic Finance)\", justification='Added new clause FAS8.SH5 to provide guidance on Shariah-compliant risk mitigation strategies during political instability. This ensures that IFIs take steps to reduce risks while adhering to Shariah principles, addressing identified gaps in existing frameworks. The reference given is AAOIFI Shariah Standard 23 on Hedging in Islamic Finance.', section_id='Shariah Clauses', change_type='addition'), ChangeRecord(old_text='No original FAS document available.', new_text='FAS8.SH6: In cases where political dynamics create uncertainty regarding the enforceability of contracts or the realization of expected returns, IFIs should apply a conservative approach to asset valuation, reflecting the increased risk. Such valuation adjustments must be clearly documented and justified based on Shariah-accepted principles of fair value and impairment. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure)', justification='Added new clause FAS8.SH6 to implement a conservative approach to asset valuation when political factors create uncertainty in contract enforceability or returns realization. This requirement guarantees an increased application of asset valuation according to Shariah-accepted principles. The reference given is AAOIFI Accounting Standard 1 on General Presentation and Disclosure.', section_id='Shariah Clauses', change_type='addition')], key_changes_summary='The main updates to FAS 8 focus on addressing the impact of political events on Islamic Financial Institutions (IFIs). Key areas updated include:\\n\\n*   **Disclosure of Political Risks (FAS8.POL1.ACC1, FAS8.SH1):** New requirements for disclosing significant risks arising from political dynamics, including impacts on Shariah compliance.\\n*   **Sensitivity Analysis (FAS8.POL1.ACC2, FAS8.POL1.ACC7):** Mandating sensitivity analyses for IFIs exposed to politically sensitive sectors and during market volatility caused by political events.\\n*   **Scenario Planning and Stress Testing (FAS8.POL1.ACC3, FAS8.SH2):** Incorporating political risks into scenario planning and stress testing, with disclosure to the Shariah Supervisory Board.\\n*   **Impairment Recognition (FAS8.POL1.ACC4):** Requirements for recognizing impairment losses or increases in liabilities due to political actions, subject to Shariah Supervisory Board approval.\\n*   **Contractual Alterations and Fairness (FAS8.POL1.ACC5, FAS8.SH4):** Ensuring fairness and Shariah compliance when political actions alter contract outcomes.\\n*   **Risk Mitigation Strategies (FAS8.SH5):** Implementing and disclosing Shariah-compliant risk mitigation strategies during political instability.\\n*   **Conservative Asset Valuation (FAS8.SH6):** Applying a conservative approach to asset valuation when political factors create uncertainty.\\n*   **Contingent Contracts (FAS8.POL1.ACC6):** Disclosure for contracts contingent on uncertain legislation due to political events.\\n\\nThese changes ensure that IFIs provide transparent disclosures, enhance risk management practices, and maintain ethical financial practices consistent with Shariah principles in the face of political uncertainty.', change_statistics={'additions': 14, 'deletions': 0, 'modifications': 0}), 'change_summary': \"The recent failure of the US budget reconciliation bill highlighted a gap in FAS 8 regarding how political events impact Islamic Financial Institutions (IFIs). To address this, we've updated FAS 8 to include new guidance focusing on transparency, risk management, and Shariah compliance.\\n\\nHere's what's changed:\\n\\n*   **Disclosure of Political Risks (FAS8.POL1.ACC1, FAS8.SH1):** IFIs must now disclose significant risks stemming from political events like legislative gridlock, government shutdowns, and tax policy changes. This includes assessing how these events could affect their financial position, performance, and ability to comply with Shariah principles.\\n*   **Sensitivity Analysis (FAS8.POL1.ACC2):** IFIs heavily involved in sectors directly affected by political actions (e.g., government contracts) need to conduct sensitivity analyses. These analyses will illustrate how changes in political policies could impact asset and liability values, considering both expected returns and Shariah compliance.\\n*   **Scenario Planning and Stress Testing (FAS8.POL1.ACC3, FAS8.SH2):** Political risks must be incorporated into scenario planning and stress testing. These scenarios should consider various political and economic outcomes, including delayed or terminated policies. Results, including impact on capital and Shariah compliance, must be disclosed to the Shariah Supervisory Board and senior management.\\n*   **Impairment Recognition (FAS8.POL1.ACC4):** When political events lead to significant asset impairment or increased liabilities, IFIs must recognize these changes in the relevant period. Impairment assessments require Shariah Supervisory Board review and approval.\\n*   **Contractual Alterations and Fairness (FAS8.POL1.ACC5, FAS8.SH4):** If political actions significantly alter contract outcomes, potentially leading to unjust enrichment or Shariah violations (like riba or gharar), IFIs must disclose the alteration, its impact on Shariah compliance, and steps taken to ensure fairness ('adl) and avoid exploitation.\\n*   **Risk Mitigation Strategies (FAS8.SH5):** IFIs should implement and disclose Shariah-compliant risk mitigation strategies when political instability significantly increases investment risk.\\n*   **Conservative Asset Valuation (FAS8.SH6):** In cases of political uncertainty affecting contract enforceability or expected returns, IFIs should use a conservative approach to asset valuation, reflecting the increased risk.\\n*   **Contingent Contracts (FAS8.POL1.ACC6):** Disclosure is required for contracts or commitments contingent on legislation or government action made uncertain by political events, with associated risks and potential impacts.\\n*   **Market Volatility (FAS8.POL1.ACC7):** In times of market volatility due to political events, additional sensitivity analysis illustrating potential impacts on key financial metrics, including disclosed assumptions, should be provided.\\n\\nThese changes ensure IFIs provide transparent disclosures, enhance risk management, and maintain ethical financial practices consistent with both accounting standards and Shariah principles in the face of political uncertainty.\", 'reasoning_trace': {'fas_gaps': {'overall_verdict': {'fas_to_update': ['fas_8'], 'need_new_fas': False, 'overall_justification': 'FAS 8 requires an update to address the gap identified regarding the implications of political dynamics on fiscal policy, which is not currently covered. No new FAS is needed as the existing standards can be adapted to include this aspect.', 'overall_chain_of_thought': '1. Reviewed the context of the budget reconciliation bill and its implications for fiscal policy. 2. Analyzed the existing FAS for relevance to the identified issues. 3. Noted that FAS 8 has a significant gap regarding political influences on financial reporting. 4. Concluded that updating FAS 8 would address this gap without necessitating a new standard.', 'overall_referenced_gaps': ['The context discusses political gridlock and budget reconciliation in a governmental setting, which is not addressed in FAS 8.'], 'overall_referenced_similarities': []}, 'updated_fas_details': [{'fas_id': 'fas_8', 'justification': 'FAS 8 needs an update to incorporate guidance on how political dynamics and budget reconciliation processes can impact financial reporting and disclosures for Islamic financial institutions.', 'chain_of_thought': '1. Identified that FAS 8 currently lacks coverage of political factors affecting fiscal policy. 2. Recognized the importance of including such dynamics in financial reporting standards to enhance relevance. 3. Concluded that an update is necessary to bridge this gap.', 'referenced_gaps': ['The context discusses political gridlock and budget reconciliation in a governmental setting, which is not addressed in FAS 8.'], 'referenced_similarities': []}], 'new_fas_details': None}, 'board_proposals': [{'llm': 'gemini', 'content': {'shariah_solution': \"To address the gap identified in FAS 8 regarding the impact of political dynamics on fiscal policy and financial reporting for Islamic Financial Institutions (IFIs), the standard needs to incorporate principles that emphasize transparency, fairness ('adl), and consideration of broader societal welfare ('maslaha'). Specifically, IFIs should disclose potential risks and impacts arising from political gridlock, budget reconciliation failures, and changes in tax policies. This will ensure stakeholders are aware of the potential effects on the IFI's financial performance and compliance with Shariah principles. The updated standard should emphasize the need for scenario planning and stress testing that include political factors, ensuring resilience and adherence to Shariah principles even under adverse political conditions. The goal is to promote ethical financial practices and ensure that IFIs operate responsibly, considering the broader economic and political context.\", 'updated_shariah_clauses': [{'clause_id': 'FAS8.SH1', 'text': \"IFI financial reports shall disclose significant potential impacts arising from political dynamics, including but not limited to budget reconciliation failures, changes in tax policies, and government regulations, which may affect the IFI's financial performance and its adherence to Shariah principles.\", 'reference': 'AAOIFI Governance Standard 3 on Transparency and Disclosure'}, {'clause_id': 'FAS8.SH2', 'text': \"IFIs shall conduct scenario planning and stress testing that incorporate potential adverse political and economic scenarios. These tests must assess the IFI's ability to maintain solvency, fulfill its obligations, and comply with Shariah principles under such conditions.\", 'reference': \"General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management\"}, {'clause_id': 'FAS8.SH3', 'text': 'IFIs must establish internal Shariah review mechanisms to assess the impact of political events and fiscal policy changes on the Shariah compliance of their operations and products. This includes identifying potential risks to existing contracts and investments and developing mitigation strategies.', 'reference': 'AAOIFI Governance Standard 2 on Shariah Supervisory Board'}, {'clause_id': 'FAS8.SH4', 'text': \"In instances where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or violation of Shariah principles (such as riba or gharar), the IFI should implement measures to ensure fairness ('adl) and avoid exploitation, potentially including renegotiation of contract terms or alternative solutions that align with Shariah principles. All alterations should be approved by the Shariah Supervisory Board.\", 'reference': \"Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah\"}], 'accounting_rationale': \"The updated accounting clauses address the gap identified in FAS 8 regarding the impact of political dynamics on IFIs by incorporating principles of transparency, risk management, and Shariah compliance. \\n\\nClause FAS8.POL1.ACC1 requires IFIs to disclose significant risks arising from political dynamics, aligning with AAOIFI Governance Standard 3 on Transparency and Disclosure and mirroring the disclosure requirements in FAS 5 for contingencies. This ensures stakeholders are aware of potential political risks affecting the IFI. It also calls for the assessment of Shariah compliance to ensure that any political changes don't violate Shariah principles.\\n\\nClause FAS8.POL1.ACC2 addresses the specific risk of political and governmental actions on specific sectors by requiring a sensitivity analysis. This is aligned with AAOIFI Governance Standard 14 on Risk Management and draws from the sensitivity analysis requirements in IFRS 7 for financial instruments. The analysis includes considerations of Shariah compliance.\\n\\nClause FAS8.POL1.ACC3 requires incorporating political risks into scenario planning and stress testing, consistent with AAOIFI Governance Standard 14 on Risk Management. This helps IFIs prepare for adverse political scenarios and ensures their resilience while maintaining Shariah compliance. \\n\\nClause FAS8.POL1.ACC4 addresses the accounting for asset impairments or liability increases resulting from political actions. It references AAOIFI Accounting Standard 1, FAS 5, and IFRS 9 (for impairment concepts) and requires Shariah Supervisory Board approval, ensuring that impairment decisions are consistent with Shariah principles. \\n\\nClause FAS8.POL1.ACC5 addresses situations where political actions alter contract outcomes, potentially leading to Shariah violations. It references AAOIFI Shariah Standards 2 and 3, the principle of 'Adl (Justice), and requires disclosure of the alteration, its impact on Shariah compliance, and the measures taken to ensure fairness. This clause reinforces the importance of ethical financial practices and adherence to Shariah principles.\\n\\nThe proposed clauses aim to provide practical guidance for IFIs to account for political risks in a manner consistent with both accounting standards and Shariah principles. They promote transparency, enhance risk management, and ensure ethical financial practices, addressing the specific needs of IFIs operating in complex political environments.\", 'updated_accounting_clauses': [{'clause_id': 'FAS8.POL1.ACC1', 'text': \"An Islamic Financial Institution (IFI) shall disclose in its financial statements the nature and extent of significant risks arising from political dynamics, including legislative gridlock, potential government shutdowns, and changes in fiscal and tax policies, that could reasonably be expected to affect the IFI's financial position, financial performance, or cash flows. This disclosure shall include a qualitative assessment of the potential impact on the IFI's ability to comply with Shariah principles.\", 'reference': 'AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies'}, {'clause_id': 'FAS8.POL1.ACC2', 'text': 'For IFIs with significant exposure to sectors or activities directly affected by political or governmental actions (e.g., government contracts, infrastructure projects, or specific tax incentives), the IFI shall disclose a sensitivity analysis illustrating the potential impact of reasonably possible adverse changes in political or governmental policies on the carrying amount of related assets and liabilities. This analysis should explicitly consider the impact on expected returns and Shariah compliance.', 'reference': 'AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)'}, {'clause_id': 'FAS8.POL1.ACC3', 'text': \"IFIs shall incorporate political and governmental risks into their scenario planning and stress testing processes. These scenarios should consider a range of plausible political and economic outcomes, including scenarios where governmental policies are delayed, modified, or terminated. The results of these stress tests, including the impact on the IFI's capital adequacy and Shariah compliance, shall be disclosed to the Shariah Supervisory Board and senior management.\", 'reference': 'AAOIFI Governance Standard 14 on Risk Management'}, {'clause_id': 'FAS8.POL1.ACC4', 'text': 'When political or governmental actions result in a significant impairment of an asset or a significant increase in a liability, the IFI shall recognize the impairment loss or the increase in the liability in the period in which the political or governmental action occurs and it becomes probable that the carrying value of the asset is impaired or a liability has been incurred. The determination of impairment and measurement of the loss shall be subject to review and approval by the Shariah Supervisory Board to ensure compliance with Shariah principles.', 'reference': 'AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment)'}, {'clause_id': 'FAS8.POL1.ACC5', 'text': \"In cases where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or a violation of Shariah principles (such as riba or gharar), the IFI shall disclose the nature of the alteration, the potential impact on Shariah compliance, and the measures taken to ensure fairness ('adl) and avoid exploitation. This may include renegotiation of contract terms, alternative solutions, or seeking guidance from the Shariah Supervisory Board.\", 'reference': \"AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance\"}], 'references': ['AAOIFI Accounting Standard 1 on General Presentation and Disclosure', \"Principle of 'Adl (Justice) in Islamic Finance\", 'FAS 5, Accounting for Contingencies', 'AAOIFI Governance Standard 2 on Shariah Supervisory Board', 'AAOIFI Governance Standard 3 on Transparency and Disclosure', \"General principle of risk management in Islamic finance based on 'istikrah' (foreseeability)\", 'AAOIFI Shariah Standard 2 on Murabaha', 'AAOIFI Governance Standard 14 on Risk Management', 'IFRS 9, Financial Instruments (Impairment)', 'AAOIFI Shariah Standard 3 on Mudarabah', 'IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)']}}, {'llm': 'gpt', 'content': {'shariah_solution': 'To ensure the Shariah compliance of financial reporting by Islamic Financial Institutions (IFIs) in the face of political dynamics affecting fiscal policy, an additional layer of disclosure and risk assessment is required. IFIs must evaluate and report on the potential impact of political events like budget reconciliation failures on their assets, liabilities, and overall financial stability. This involves incorporating scenarios reflecting political gridlock and its consequential effects on tax laws, government spending, and macroeconomic indicators.', 'updated_shariah_clauses': [{'clause_id': 'FAS8.SH1', 'text': 'IFIs must disclose the potential impact of significant political events, such as budget reconciliation failures and changes in tax laws, on their financial statements, including a qualitative assessment of the risks and uncertainties involved.', 'reference': 'AAOIFI Governance Standard 2 on Shariah Governance Framework'}, {'clause_id': 'FAS8.SH2', 'text': \"The Shariah Supervisory Board (SSB) should review and approve the IFI's assessment of political risks and their impact on Shariah compliance, ensuring that any potential non-compliance issues arising from these events are adequately addressed.\", 'reference': 'AAOIFI Governance Standard 3 on Shariah Review'}, {'clause_id': 'FAS8.SH3', 'text': 'IFIs shall develop and maintain contingency plans to mitigate potential negative impacts on Shariah-compliant activities resulting from political uncertainties and fiscal policy changes. These plans should be documented and regularly updated.', 'reference': 'General principle of risk management in Islamic finance'}], 'accounting_rationale': \"The proposed accounting clauses address the Shariah update's requirement for IFIs to disclose and assess the impact of political events on their financial statements. Specifically, the clauses ensure that IFIs provide transparent disclosures about the potential effects of events like budget reconciliation failures (as per the user context) on their assets, liabilities, and overall financial stability. \\n\\nFAS8.POL.ACC1 requires a qualitative assessment of the impact of significant political events. This aligns with the Shariah principle of transparency and the need for stakeholders to understand the risks faced by the IFI. The clause is consistent with AAOIFI FAS 1, which emphasizes the importance of providing relevant and reliable information in financial statements. It also draws on the general principles of risk disclosure found in various accounting frameworks. The reference to AAOIFI Governance Standard 2 is to show that such disclosures are important for the overall governance of the IFI.\\n\\nFAS8.POL.ACC2 addresses the accounting recognition of impairment losses or provisions when a political event has a probable and measurable adverse effect. This clause is directly linked to AAOIFI FAS 11 on impairment. While AAOIFI FAS 11 already provides guidance on impairment, FAS8.POL.ACC2 specifically links it to the context of political events. IFRS 9 is referenced for conceptual alignment with the general principles of impairment accounting, although AAOIFI FAS 11 takes precedence.\\n\\nFAS8.POL.ACC3 emphasizes the need for ongoing updates to the disclosures as long as the uncertainty related to the political event persists. This ensures that stakeholders have access to the most current information. The ongoing updates are important because the impacts from these political events will likely change with new developments. AAOIFI FAS 1, para 40, notes the importance of ongoing updates to financial statement disclosures.\\n\\nFAS8.POL.ACC4 addresses the role of the SSB in reviewing and approving the assessment of political risks. This aligns with the Shariah requirement for independent oversight of the IFI's activities and ensures that Shariah compliance is maintained. AAOIFI Governance Standard 3 emphasizes the role of the SSB in reviewing and approving the IFI's Shariah compliance framework.\\n\\nThese clauses, when combined with the Shariah clauses, provide a comprehensive framework for IFIs to address the accounting and Shariah implications of political events. The practical considerations for IFIs include the need to develop expertise in assessing political risks and the need to involve the SSB in the assessment process.\", 'updated_accounting_clauses': [{'clause_id': 'FAS8.POL.ACC1', 'text': 'An Islamic Financial Institution (IFI) shall disclose in its financial statements a qualitative assessment of the impact of significant political events, including but not limited to budget reconciliation failures, government shutdowns, and major tax law changes, on its financial position and performance. This assessment shall consider the potential effects on the fair value of assets, the recoverability of receivables, and the fulfillment of contractual obligations. The disclosure should include scenarios considered and the key assumptions underlying the assessment.', 'reference': 'AAOIFI FAS 1, para 37; AAOIFI Governance Standard 2'}, {'clause_id': 'FAS8.POL.ACC2', 'text': 'Where a significant political event, as described in FAS8.POL.ACC1, is determined to have a probable and measurable adverse effect on the financial position or performance of the IFI, the IFI shall recognize an impairment loss or a provision, as appropriate, in accordance with AAOIFI Financial Accounting Standard 11 (Impairment and Credit Losses). The impairment loss or provision should reflect the best estimate of the likely impact of the event on the related assets or liabilities.', 'reference': 'AAOIFI FAS 11, para 20-25; IFRS 9 (Conceptual Alignment)'}, {'clause_id': 'FAS8.POL.ACC3', 'text': \"The disclosures required by FAS8.POL.ACC1 and FAS8.POL.ACC2 shall be included in the notes to the financial statements and shall be updated in each reporting period until the uncertainty related to the political event is resolved. The update should include a description of any changes in the IFI's assessment of the impact of the event and any changes in the related impairment losses or provisions.\", 'reference': 'AAOIFI FAS 1, para 40'}, {'clause_id': 'FAS8.POL.ACC4', 'text': \"The IFI shall disclose the role of the Shariah Supervisory Board (SSB) in reviewing and approving the assessment of political risks and their impact on Shariah compliance. This disclosure shall include a summary of the SSB's findings and any recommendations made by the SSB regarding the mitigation of potential non-compliance issues.\", 'reference': 'AAOIFI Governance Standard 3'}], 'references': ['AAOIFI Governance Standard 2 on Shariah Governance Framework', 'AAOIFI Governance Standard 3 on Shariah Review', 'AAOIFI Governance Standard 3', 'AAOIFI Governance Standard 2', 'IFRS 9 (Conceptual Alignment)', 'AAOIFI FAS 11', 'AAOIFI FAS 1', 'General principle of risk management in Islamic finance']}}, {'llm': 'deepseek', 'content': {'shariah_solution': \"To ensure Shariah compliance in financial reporting amidst political dynamics, FAS 8 must be updated to include guidance on how political events, such as budget reconciliation failures, impact financial reporting and disclosures for Islamic Financial Institutions (IFIs). This update should emphasize transparency and the use of appropriate risk mitigation strategies to protect stakeholders' interests in scenarios where political uncertainty affects underlying asset values or project viability. The primary Shariah principle guiding this solution is 'Adl (Justice) and Ihsan (Excellence)', ensuring that financial reporting reflects the true economic substance of transactions under Shariah, even when influenced by external political factors. This also includes the principle of 'Gharar' (uncertainty), requiring IFIs to disclose and manage any excessive uncertainty arising from political instability.\", 'updated_shariah_clauses': [{'clause_id': 'FAS8.SH1', 'text': \"IFIs must disclose potential material impacts of political events, including legislative changes or failures such as budget reconciliation, on their financial position and performance. This disclosure should include a qualitative assessment of the event's potential influence on asset values, project viability, and overall financial stability.\", 'reference': 'AAOIFI Governance Standard 2 on Transparency and Disclosure'}, {'clause_id': 'FAS8.SH2', 'text': \"Where political instability or specific political events significantly increase the risk profile of an IFI's investments or operations, the IFI should implement and disclose risk mitigation strategies compliant with Shariah principles. These strategies may include, but are not limited to, diversification, hedging (where Shariah-compliant), and enhanced due diligence on affected assets.\", 'reference': 'AAOIFI Shariah Standard 23 on Hedging in Islamic Finance'}, {'clause_id': 'FAS8.SH3', 'text': 'In cases where political dynamics create uncertainty regarding the enforceability of contracts or the realization of expected returns, IFIs should apply a conservative approach to asset valuation, reflecting the increased risk. Such valuation adjustments must be clearly documented and justified based on Shariah-accepted principles of fair value and impairment.', 'reference': 'AAOIFI Accounting Standard 1 on General Presentation and Disclosure'}], 'accounting_rationale': \"The proposed accounting clauses address the Shariah update's call for enhanced transparency and risk mitigation in the face of political uncertainty, specifically regarding the impact of events like budget reconciliation failures. \\n\\nClause FAS8.POL1.ACC1 directly implements the Shariah principle of 'Adl (Justice)' and 'Ihsan (Excellence)' by requiring IFIs to provide a clear and transparent assessment of how political events affect their financial position. This ensures that stakeholders are informed about the true economic substance of transactions, as per Shariah requirements. It aligns with AAOIFI AS 1, paragraphs 40-42, which mandate comprehensive disclosure requirements for IFIs. Specifically, it expands on the types of events to be disclosed to include significant political events and their impact on the financial position. This clause also helps mitigate 'Gharar' (uncertainty) by providing qualitative assessments.\\n\\nClause FAS8.POL1.ACC2 addresses the accounting gap by providing guidance on how to account for potential impairments resulting from political events. This clause is consistent with AAOIFI AS 12, paragraphs 25-30 on impairment of assets, and it provides specific direction to IFIs to consider the impact of political uncertainty on future cash flows and discount rates when performing impairment assessments. The clause implements the Shariah update's emphasis on conservative asset valuation during political instability.\\n\\nClause FAS8.POL1.ACC3 focuses on the disclosure of contracts or commitments contingent on political events. This is crucial because political events can significantly impact the enforceability or realization of expected returns from these contracts, directly addressing the 'Gharar' (uncertainty) principle. It aligns with AAOIFI AS 1, paragraphs 43-45, concerning disclosure of contingencies and commitments. \\n\\nClause FAS8.POL1.ACC4 addresses the potential for increased market volatility resulting from political events. It requires IFIs to conduct and disclose sensitivity analysis in the financial statements. This goes beyond general disclosures and requires quantitative assessments of potential impact. This provides enhanced transparency for users of financial statements and allows for more informed decision-making, consistent with the principles of 'Adl (Justice)' and 'Ihsan (Excellence)'. This draws from AAOIFI AS 1, paragraph 46, which discusses sensitivity analysis and stresses the importance of providing users of financial statements with information that is not misleading or based on unsubstantiated assumptions. \\n\\nThese clauses are practically applicable for IFIs as they provide specific guidance on how to account for and disclose the impact of political events on their financial statements, without being overly prescriptive or burdensome. They are consistent with existing accounting frameworks and Shariah principles.\", 'updated_accounting_clauses': [{'clause_id': 'FAS8.POL1.ACC1', 'text': 'An Islamic Financial Institution (IFI) shall disclose the nature and extent of the impact of significant political events, including failures of budget reconciliation bills or similar legislative actions, on its financial position and financial performance. This disclosure should include a qualitative assessment of the potential impact on the carrying amounts of assets, liabilities, income, and expenses, particularly those affected by changes in tax laws, government subsidies, or regulatory frameworks.', 'reference': 'AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements)'}, {'clause_id': 'FAS8.POL1.ACC2', 'text': 'Where a political event, such as the failure of a budget reconciliation bill, leads to increased uncertainty regarding the recoverability of an asset, an IFI shall assess the asset for impairment. The impairment assessment should consider the potential impact on future cash flows, discount rates, and the expected holding period. Any impairment loss shall be recognized in the statement of income for the period.', 'reference': 'AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets)'}, {'clause_id': 'FAS8.POL1.ACC3', 'text': 'If an IFI has entered into contracts or commitments whose performance is contingent upon the passage of specific legislation or government action that is rendered uncertain due to political events, the IFI shall disclose the nature of these contracts or commitments, the associated risks, and the potential financial impact if the legislation or action fails to materialize. The IFI shall also disclose any risk mitigation strategies adopted to manage these risks.', 'reference': 'AAOIFI AS 1, paragraphs 43-45 (Contingencies)'}, {'clause_id': 'FAS8.POL1.ACC4', 'text': 'In the event of significant volatility in the market caused by political events, the IFI should provide additional sensitivity analysis in the notes to the financial statements, illustrating the potential impact of a range of possible outcomes on key financial metrics. This should explicitly disclose assumptions used in assessing sensitivities.', 'reference': 'AAOIFI AS 1, paragraph 46 (Sensitivity Analysis)'}], 'references': ['AAOIFI Accounting Standard 1 on General Presentation and Disclosure', 'AAOIFI AS 1 (General Presentation and Disclosure)', 'AAOIFI Shariah Standard 23 on Hedging in Islamic Finance', 'AAOIFI AS 12 (Impairment of Assets)', 'AAOIFI Governance Standard 2 on Transparency and Disclosure']}}], 'change_summary': \"The recent failure of the US budget reconciliation bill highlighted a gap in FAS 8 regarding how political events impact Islamic Financial Institutions (IFIs). To address this, we've updated FAS 8 to include new guidance focusing on transparency, risk management, and Shariah compliance.\\n\\nHere's what's changed:\\n\\n*   **Disclosure of Political Risks (FAS8.POL1.ACC1, FAS8.SH1):** IFIs must now disclose significant risks stemming from political events like legislative gridlock, government shutdowns, and tax policy changes. This includes assessing how these events could affect their financial position, performance, and ability to comply with Shariah principles.\\n*   **Sensitivity Analysis (FAS8.POL1.ACC2):** IFIs heavily involved in sectors directly affected by political actions (e.g., government contracts) need to conduct sensitivity analyses. These analyses will illustrate how changes in political policies could impact asset and liability values, considering both expected returns and Shariah compliance.\\n*   **Scenario Planning and Stress Testing (FAS8.POL1.ACC3, FAS8.SH2):** Political risks must be incorporated into scenario planning and stress testing. These scenarios should consider various political and economic outcomes, including delayed or terminated policies. Results, including impact on capital and Shariah compliance, must be disclosed to the Shariah Supervisory Board and senior management.\\n*   **Impairment Recognition (FAS8.POL1.ACC4):** When political events lead to significant asset impairment or increased liabilities, IFIs must recognize these changes in the relevant period. Impairment assessments require Shariah Supervisory Board review and approval.\\n*   **Contractual Alterations and Fairness (FAS8.POL1.ACC5, FAS8.SH4):** If political actions significantly alter contract outcomes, potentially leading to unjust enrichment or Shariah violations (like riba or gharar), IFIs must disclose the alteration, its impact on Shariah compliance, and steps taken to ensure fairness ('adl) and avoid exploitation.\\n*   **Risk Mitigation Strategies (FAS8.SH5):** IFIs should implement and disclose Shariah-compliant risk mitigation strategies when political instability significantly increases investment risk.\\n*   **Conservative Asset Valuation (FAS8.SH6):** In cases of political uncertainty affecting contract enforceability or expected returns, IFIs should use a conservative approach to asset valuation, reflecting the increased risk.\\n*   **Contingent Contracts (FAS8.POL1.ACC6):** Disclosure is required for contracts or commitments contingent on legislation or government action made uncertain by political events, with associated risks and potential impacts.\\n*   **Market Volatility (FAS8.POL1.ACC7):** In times of market volatility due to political events, additional sensitivity analysis illustrating potential impacts on key financial metrics, including disclosed assumptions, should be provided.\\n\\nThese changes ensure IFIs provide transparent disclosures, enhance risk management, and maintain ethical financial practices consistent with both accounting standards and Shariah principles in the face of political uncertainty.\", 'fas_diff': {'changes': [{'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'Financial Accounting Standard 8 (FAS 8): Accounting for the Impact of Political Dynamics on Islamic Financial Institutions (IFIs)', 'justification': 'Added a title to formally introduce the scope of FAS 8 in light of the new guidelines regarding political impacts, risk assessment, and Shariah adherence. This serves as a starting point for organizing and structuring the forthcoming clauses. This is needed to establish the context of the new clauses.', 'section': 'Title', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC1: An Islamic Financial Institution (IFI) shall disclose in its financial statements the nature and extent of significant risks arising from political dynamics, including legislative gridlock, potential government shutdowns, and changes in fiscal and tax policies, that could reasonably be expected to affect the IFI's financial position, financial performance, or cash flows. This disclosure shall include a qualitative assessment of the potential impact on the IFI's ability to comply with Shariah principles. (ref: AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements))\", 'justification': \"Added new clause FAS8.POL1.ACC1 to address the gap in transparency concerning political risks affecting IFIs, reflecting the need for better disclosure. This integrates accounting standards with Shariah principles by including a qualitative assessment of the impact on Shariah compliance, as highlighted in the 'reasoning_summary'. The references given are AAOIFI Governance Standard 3 on Transparency and Disclosure; FAS 5, Accounting for Contingencies; AAOIFI AS 1, paragraphs 40-42 (Disclosure Requirements)\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC2: For IFIs with significant exposure to sectors or activities directly affected by political or governmental actions (e.g., government contracts, infrastructure projects, or specific tax incentives), the IFI shall disclose a sensitivity analysis illustrating the potential impact of reasonably possible adverse changes in political or governmental policies on the carrying amount of related assets and liabilities. This analysis should explicitly consider the impact on expected returns and Shariah compliance. (ref: AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis))', 'justification': 'Added new clause FAS8.POL1.ACC2 to mandate sensitivity analysis for IFIs heavily exposed to politically sensitive sectors. This addresses the need for IFIs to assess risks related to changes in political policies and their effects on asset and liability values, incorporating Shariah compliance, derived from proposal 1. The references given are AAOIFI Governance Standard 14 on Risk Management; IFRS 7, Financial Instruments: Disclosures (Sensitivity Analysis)', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC3: IFIs shall incorporate political and governmental risks into their scenario planning and stress testing processes. These scenarios should consider a range of plausible political and economic outcomes, including scenarios where governmental policies are delayed, modified, or terminated. The results of these stress tests, including the impact on the IFI's capital adequacy and Shariah compliance, shall be disclosed to the Shariah Supervisory Board and senior management. (ref: AAOIFI Governance Standard 14 on Risk Management)\", 'justification': 'Added new clause FAS8.POL1.ACC3, derived from Proposal 1, requiring political and governmental risks to be integrated into scenario planning and stress testing. This ensures a proactive approach to risk management by considering various potential political outcomes and assessing their impacts on capital adequacy and Shariah compliance, and the results are disclosed. The reference is AAOIFI Governance Standard 14 on Risk Management.', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC4: When political or governmental actions result in a significant impairment of an asset or a significant increase in a liability, the IFI shall recognize the impairment loss or the increase in the liability in the period in which the political or governmental action occurs and it becomes probable that the carrying value of the asset is impaired or a liability has been incurred. The determination of impairment and measurement of the loss shall be subject to review and approval by the Shariah Supervisory Board to ensure compliance with Shariah principles. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets))', 'justification': 'Added new clause FAS8.POL1.ACC4 to define the accounting treatment of impairments and liabilities arising from political events, emphasizing Shariah compliance through Shariah Supervisory Board review. This clause addresses the gap by making a direct link between political action and accounting recognition of impairments, from proposal 1. The references are: AAOIFI Accounting Standard 1 on General Presentation and Disclosure; FAS 5, Accounting for Contingencies; IFRS 9, Financial Instruments (Impairment); AAOIFI AS 12, paragraphs 25-30 (Impairment of Assets).', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.POL1.ACC5: In cases where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or a violation of Shariah principles (such as riba or gharar), the IFI shall disclose the nature of the alteration, the potential impact on Shariah compliance, and the measures taken to ensure fairness ('adl) and avoid exploitation. This may include renegotiation of contract terms, alternative solutions, or seeking guidance from the Shariah Supervisory Board. (ref: AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance)\", 'justification': \"Added new clause FAS8.POL1.ACC5 to address contractual alterations and ensure fairness ('adl) in alignment with Shariah principles when political actions impact contract outcomes. The new clause incorporates proposal 1 and incorporates the Shariah concern by adding the importance of fairness and adherence to the principles. The references given are AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah; Principle of 'Adl (Justice) in Islamic Finance).\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC6: If an IFI has entered into contracts or commitments whose performance is contingent upon the passage of specific legislation or government action that is rendered uncertain due to political events, the IFI shall disclose the nature of these contracts or commitments, the associated risks, and the potential financial impact if the legislation or action fails to materialize. The IFI shall also disclose any risk mitigation strategies adopted to manage these risks. (ref: AAOIFI AS 1, paragraphs 43-45 (Contingencies))', 'justification': 'Added clause FAS8.POL1.ACC6 to address the disclosures for contingent contracts affected by political uncertainty. This addition directly responds to the identification of the gap and provides a framework for the accounting procedures by enhancing risk mitigation disclosure. The reference is AAOIFI AS 1, paragraphs 43-45 (Contingencies).', 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.POL1.ACC7: In the event of significant volatility in the market caused by political events, the IFI should provide additional sensitivity analysis in the notes to the financial statements, illustrating the potential impact of a range of possible outcomes on key financial metrics. This should explicitly disclose assumptions used in assessing sensitivities. (ref: AAOIFI AS 1, paragraph 46 (Sensitivity Analysis))', 'justification': \"Added clause FAS8.POL1.ACC7 that mandates additional sensitivity analysis during political volatility, with explicit disclosure of assumptions used, to address the identified gap in accounting for political events' impact. This clause integrates the need for better sensitivity analysis to market changes. The reference given is AAOIFI AS 1, paragraph 46 (Sensitivity Analysis).\", 'section': 'Accounting Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH1: IFIs must disclose potential material impacts of political events, including legislative changes or failures such as budget reconciliation, on their financial position and performance. This disclosure should include a qualitative assessment of the event's potential influence on asset values, project viability, and overall financial stability. (ref: AAOIFI Governance Standard 2 on Transparency and Disclosure)\", 'justification': \"Added new clause FAS8.SH1 to introduce the Shariah-compliant disclosure requirements related to political events impacting IFIs, grounded in Shariah principles. This clause addresses the need for transparency and disclosure and ensures a Shariah-compliant approach to assessing these impacts, derived from proposal 3 and the 'reasoning_summary'. The reference is AAOIFI Governance Standard 2 on Transparency and Disclosure.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH2: IFIs shall conduct scenario planning and stress testing that incorporate potential adverse political and economic scenarios. These tests must assess the IFI's ability to maintain solvency, fulfill its obligations, and comply with Shariah principles under such conditions. (ref: General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management)\", 'justification': \"Added new clause FAS8.SH2 to mandate Shariah-compliant scenario planning and stress testing, derived from the reasoning. This integrates Shariah principles by requiring the assessment of compliance under adverse political and economic scenarios. The references are General principle of risk management in Islamic finance based on 'istikrah' (foreseeability) and AAOIFI Governance Standard 14 on Risk Management.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.SH3: IFIs must establish internal Shariah review mechanisms to assess the impact of political events and fiscal policy changes on the Shariah compliance of their operations and products. This includes identifying potential risks to existing contracts and investments and developing mitigation strategies. (ref: AAOIFI Governance Standard 2 on Shariah Supervisory Board)', 'justification': 'Added new clause FAS8.SH3 to necessitate the establishment of internal Shariah review mechanisms, drawing from proposal 3, to ensure compliance during political events and policy changes. This clause requires IFIs to monitor and mitigate Shariah-related risks to their operations. The reference given is AAOIFI Governance Standard 2 on Shariah Supervisory Board.', 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH4: In instances where political or governmental actions significantly alter the expected outcomes of a contract or investment, potentially leading to unjust enrichment or violation of Shariah principles (such as riba or gharar), the IFI should implement measures to ensure fairness ('adl) and avoid exploitation, potentially including renegotiation of contract terms or alternative solutions that align with Shariah principles. All alterations should be approved by the Shariah Supervisory Board. (ref: Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah)\", 'justification': \"Added new clause FAS8.SH4 to ensure fairness ('adl) and prevent exploitation in contracts when political actions cause significant alterations. This clause demands adherence to Shariah principles, as described in the 'reasoning_summary', and approval from the Shariah Supervisory Board. The references are Principle of 'Adl (Justice) in Islamic Finance; AAOIFI Shariah Standard 2 on Murabaha; AAOIFI Shariah Standard 3 on Mudarabah.\", 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': \"FAS8.SH5: Where political instability or specific political events significantly increase the risk profile of an IFI's investments or operations, the IFI should implement and disclose risk mitigation strategies compliant with Shariah principles. These strategies may include, but are not limited to, diversification, hedging (where Shariah-compliant), and enhanced due diligence on affected assets. (ref: AAOIFI Shariah Standard 23 on Hedging in Islamic Finance)\", 'justification': 'Added new clause FAS8.SH5 to provide guidance on Shariah-compliant risk mitigation strategies during political instability. This ensures that IFIs take steps to reduce risks while adhering to Shariah principles, addressing identified gaps in existing frameworks. The reference given is AAOIFI Shariah Standard 23 on Hedging in Islamic Finance.', 'section': 'Shariah Clauses', 'type': 'addition'}, {'old_paragraph': 'No original FAS document available.', 'new_paragraph': 'FAS8.SH6: In cases where political dynamics create uncertainty regarding the enforceability of contracts or the realization of expected returns, IFIs should apply a conservative approach to asset valuation, reflecting the increased risk. Such valuation adjustments must be clearly documented and justified based on Shariah-accepted principles of fair value and impairment. (ref: AAOIFI Accounting Standard 1 on General Presentation and Disclosure)', 'justification': 'Added new clause FAS8.SH6 to implement a conservative approach to asset valuation when political factors create uncertainty in contract enforceability or returns realization. This requirement guarantees an increased application of asset valuation according to Shariah-accepted principles. The reference given is AAOIFI Accounting Standard 1 on General Presentation and Disclosure.', 'section': 'Shariah Clauses', 'type': 'addition'}], 'key_changes_summary': 'The main updates to FAS 8 focus on addressing the impact of political events on Islamic Financial Institutions (IFIs). Key areas updated include:\\n\\n*   **Disclosure of Political Risks (FAS8.POL1.ACC1, FAS8.SH1):** New requirements for disclosing significant risks arising from political dynamics, including impacts on Shariah compliance.\\n*   **Sensitivity Analysis (FAS8.POL1.ACC2, FAS8.POL1.ACC7):** Mandating sensitivity analyses for IFIs exposed to politically sensitive sectors and during market volatility caused by political events.\\n*   **Scenario Planning and Stress Testing (FAS8.POL1.ACC3, FAS8.SH2):** Incorporating political risks into scenario planning and stress testing, with disclosure to the Shariah Supervisory Board.\\n*   **Impairment Recognition (FAS8.POL1.ACC4):** Requirements for recognizing impairment losses or increases in liabilities due to political actions, subject to Shariah Supervisory Board approval.\\n*   **Contractual Alterations and Fairness (FAS8.POL1.ACC5, FAS8.SH4):** Ensuring fairness and Shariah compliance when political actions alter contract outcomes.\\n*   **Risk Mitigation Strategies (FAS8.SH5):** Implementing and disclosing Shariah-compliant risk mitigation strategies during political instability.\\n*   **Conservative Asset Valuation (FAS8.SH6):** Applying a conservative approach to asset valuation when political factors create uncertainty.\\n*   **Contingent Contracts (FAS8.POL1.ACC6):** Disclosure for contracts contingent on uncertain legislation due to political events.\\n\\nThese changes ensure that IFIs provide transparent disclosures, enhance risk management practices, and maintain ethical financial practices consistent with Shariah principles in the face of political uncertainty.', 'change_statistics': {'additions': 14, 'deletions': 0, 'modifications': 0}}}}"